
###############################################################################
#
# Text for exceptions
#
###############################################################################

# Monitor
XBM01.D=Falha na inicializa\u00e7\u00e3o devido a uma exce\u00e7\u00e3o. Consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
XBM02.D=Falha na inicializa\u00e7\u00e3o devido \u00e0 funcionalidade ausente para {0}. Verifique se o seu classpath inclui o Derby correto.
XBM05.D=Falha na inicializa\u00e7\u00e3o devido a informa\u00e7\u00f5es sobre vers\u00e3o ausente para {0}.
XBM06.D=Falha na inicializa\u00e7\u00e3o, um banco de dados criptografado n\u00e3o pode ser acessado sem a senha de reinicializa\u00e7\u00e3o correta.
XBM07.D=Falha na inicializa\u00e7\u00e3o, a senha de reinicializa\u00e7\u00e3o deve ter pelo menos 8 bytes.
XBM08.D=Could not instantiage {0} StorageFactory class {1}.

XBM0G.D=Falha ao iniciar o mecanismo de criptografia. Certifique-se de estar executando o Java 2 e ter feito o download de um provedor de criptografia como o jce e de coloc\u00e1-lo em seu classpath.
XBM0H.D=O diret\u00f3rio {0} n\u00e3o pode ser criado.
XBM0I.D=O diret\u00f3rio {0} n\u00e3o pode ser removido.
XBM0J.D=O diret\u00f3rio {0} j\u00e1 existe.
XBM0K.D=Subprotocolo desconhecido para nome do banco de dados {0}.
XBM0L.D=A classe do esquema de autentica\u00e7\u00e3o especificada {0} n\u00e3o implementa a interface de autentica\u00e7\u00e3o {1}.
XBM0M.D=Erro ao criar inst\u00e2ncia da classe do esquema de autentica\u00e7\u00e3o {0}.
XBM0N.D=Falha no registro do Driver JDBC com java.sql.DriverManager. Consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
XBM0P.D=O provedor de servi\u00e7o \u00e9 somente leitura, opera\u00e7\u00e3o n\u00e3o permitida.
XBM0S.D=N\u00e3o \u00e9 poss\u00edvel renomear o arquivo ''{0}'' como ''{1}''
XBM0T.D=Subprotocolo amb\u00edguo para o nome do banco de dados {0}.
XBM0U.S=Nenhuma classe foi registrada para o identificador {0}
XBM0V.S=Uma exce\u00e7\u00e3o foi lan\u00e7ada ao carregar a classe {1} registrada para o identificador {0}
XBM0W.S=Uma exce\u00e7\u00e3o foi lan\u00e7ada ao criar uma inst\u00e2ncia da classe {1} registrada para o identificador {0}
XBM0X.D=A descri\u00e7\u00e3o de territ\u00f3rio ''{0}'' fornecida \u00e9 inv\u00e1lida, ln[_CO[_variant]] era esperado\n ln=c\u00f3digo de idioma ISO-639 com duas letras min\u00fasculas, CO=c\u00f3digo de idioma ISO-3166 com duas letras mai\u00fasculas, consulte java.util.Locale.
XBM0Y.D=Diret\u00f3rio do banco de dados de backup {0} n\u00e3o localizado. Certifique-se de que o caminho do backup especificado esteja correto.
XBM0Z.D=Imposs\u00edvel copiar arquivo ''{0}'' para ''{1}''. Certifique-se de que haja espa\u00e7o suficiente e que as permiss\u00f5es estejam corretas.  
XBM0Q.D=Arquivo {0} n\u00e3o localizado. Certifique-se de que a c\u00f3pia de backup seja a correta e que n\u00e3o esteja corrompida.
XBM0R.D=Imposs\u00edvel remover Arquivo {0}.

# Upgrade
XCW00.D=Upgrade de ''{0}'' para ''{1}'' n\u00e3o suportado.

# Feature not supported


# COntext service
08000=Conex\u00e3o encerrada por interrup\u00e7\u00e3o desconhecida.

#../java/com/ibm/db2j/protocol/BasicServices/LockManager/messages.properties
40001=N\u00e3o foi poss\u00edvel obter um bloqueio devido a um congelamento, o ciclo de bloqueios e waiters \u00e9:\n {0}A v\u00edtima selecionada \u00e9 XID : {1}

40XL1=N\u00e3o \u00e9 poss\u00edvel obter um bloqueio dentro do tempo requerido
40XL2=N\u00e3o \u00e9 poss\u00edvel obter um bloqueio dentro do tempo requerido. O dump de lockTable \u00e9: {0}

# ClassManager
XBCM1.S=Erro de liga\u00e7\u00e3o Java lan\u00e7ado durante o carregamento da classe {0} gerada.
XBCM2.S=N\u00e3o \u00e9 poss\u00edvel criar uma inst\u00e2ncia da classe {0} gerada.
XBCM3.S=O m\u00e9todo {1}() n\u00e3o existe na classe {0} gerada.

# Properties

XCY00.S=Valor inv\u00e1lido para a propriedade ''{0}''=''{1}''.
XCY02.S=A altera\u00e7\u00e3o da propriedade solicitada n\u00e3o \u00e9 suportada ''{0}''=''{1}''.
XCY03.S=A propriedade solicitada ''{0}'' n\u00e3o foi definida.

# Cryptography
XBCX0.S=Exce\u00e7\u00e3o do provedor Cryptography, consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
XBCX1.S=Inicializando cifra com modo ilegal, deve ser ENCRYPT ou DECRYPT.
XBCX2.S=Inicializando cifra com uma senha de reinicializa\u00e7\u00e3o muito curta, deve ter pelo menos {0} caracteres
XBCX5.S=N\u00e3o \u00e9 poss\u00edvel alterar a senha de reinicializa\u00e7\u00e3o para nula.
XBCX6.S=N\u00e3o \u00e9 poss\u00edvel alterar a senha de reinicializa\u00e7\u00e3o para um tipo seri\u00e1vel que n\u00e3o seja em cadeia.
XBCX7.S=Formato incorreto para altera\u00e7\u00e3o da senha de reinicializa\u00e7\u00e3o.  O formato deve ser : old_boot_password, new_boot_password.
XBCX8.S=N\u00e3o \u00e9 poss\u00edvel alterar a senha de reinicializa\u00e7\u00e3o de um banco de dados n\u00e3o criptografado.
XBCX9.S=N\u00e3o \u00e9 poss\u00edvel alterar a senha de reinicializa\u00e7\u00e3o de um banco de dados somente leitura.
XBCXA.S=Senha de reinicializa\u00e7\u00e3o incorreta.
XBCXB.S=Conte\u00fado da criptografia incorreto ''{0}'' ou conte\u00fado n\u00e3o especificado. Deve ser utilizado ''NoPadding''.
XBCXC.S=O algoritmo da criptografia ''{0}'' n\u00e3o existe. Verifique se o provedor escolhido ''{1}'' suporta esse algoritmo.
XBCXD.S=O algoritmo da criptografia n\u00e3o pode ser alterado ap\u00f3s a cria\u00e7\u00e3o do banco de dados.
XBCXE.S=O provedor de criptografia n\u00e3o pode ser alterado ap\u00f3s a cria\u00e7\u00e3o do banco de dados.
XBCXF.S=N\u00e3o \u00e9 poss\u00edvel encontrar a classe ''{0}'' que representa o provedor de criptografia.
XBCXG.S=O provedor de criptografia ''{0}'' n\u00e3o existe.
XBCXH.S=encryptionAlgorithm ''{0}'' n\u00e3o est\u00e1 no formato correto. O formato correto \u00e9 algorithm/feedbackMode/NoPadding.
XBCXI.S=O modo de feedback ''{0}'' n\u00e3o \u00e9 suportado. Os modos de feedback suportados s\u00e3o CBC, CFB, OFB e ECB.
XBCXJ.S=O aplicativo est\u00e1 utilizando uma vers\u00e3o do JCE (Java Cryptography Extension) anterior \u00e0 1.2.1.  Fa\u00e7a upgrade para o JCE 1.2.1 e tente executar a opera\u00e7\u00e3o novamente.
XBCXK.S=A chave de criptografia fornecida n\u00e3o combina com a chave de criptografia usada na cria\u00e7\u00e3o do banco de dados. Por favor assegure-se que voc\u00ea est\u00e1 utilizando a chave de criptografia correta e tente novamente. 
XBCXL.S=O processo de verifica\u00e7\u00e3o da chave de criptografia n\u00e3o foi bem sucedida, veja a pr\u00f3xima exce\u00e7\u00e3o para detalhes. Uma das poss\u00edveis causas pode ser devido a um erro ao acessar o arquivo apropriado para executar o processo de verifica\u00e7\u00e3o.

#../java/com/ibm/db2j/impl/BasicServices/CacheService/Generic/messages.properties

# CacheStatementException messages
# sqlstate range: XBCA0 to XBCAZ

XBCA0.S=N\u00e3o \u00e9 poss\u00edvel criar um novo objeto com a chave {1} no cache {0}, ele j\u00e1 existe no cache.


# java/com/ibm/db2j/protocol/Database/Storage/Access/Interface.
# sqlstate range: XSAI0 to XSAIZ
XSAI2.S=O aglomerado ({0}) solicitado n\u00e3o existe.
XSAI3.S=Recurso n\u00e3o implementado.

# java/com/ibm/db2j/protocol/Database/Storage/Access/Interface
# RunTimeStatistics properties messages.
# sqlstate range: XSAJ0 to XSAJZ
XSAJ0.U=Tipo de varredura
XSAJ1.U=N\u00famero de p\u00e1ginas visitadas
XSAJ2.U=N\u00famero de linhas visitadas
XSAJ3.U=N\u00famero de linhas visitadas exclu\u00eddas
XSAJ4.U=N\u00famero de linhas qualificadas
XSAJ5.U=N\u00famero de colunas buscadas
XSAJ6.U=Conjunto de bits das colunas buscadas
XSAJ7.U=Altura da \u00e1rvore
XSAJ8.U=Tipo de ordena\u00e7\u00e3o
XSAJA.U=N\u00famero de entradas das linhas
XSAJB.U=N\u00famero de sa\u00eddas das linhas
XSAJC.U=N\u00famero de execu\u00e7\u00f5es mescladas
XSAJD.U=Tamanho das execu\u00e7\u00f5es mescladas
XSAJE.U=Todos

#NOTE: The next three messages are the names of types of scans.
XSAJF.U=btree
XSAJG.U=heap
XSAJH.U=sort

#NOTE: The next two messages are types of sorts
XSAJI.U=externa
XSAJJ.U=interna

# java/com/ibm/db2j/protocol/Database/Storage/Access/XA.
# sqlstate range: XSAX0 to XSAXZ
XSAX0.S=Viola\u00e7\u00e3o do protocolo XA.
XSAX1.S=Houve uma tentativa de inicializar uma transa\u00e7\u00e3o global com um Xid de uma transa\u00e7\u00e3o global existente.

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/AccessManager/Generic
# sqlstate range: XSAM0 to XSAMZ
XSAM0.S=Exce\u00e7\u00e3o encontrada ao tentar reinicializar o m\u00f3dulo para ''{0}''.
XSAM2.S=N\u00e3o h\u00e1 nenhum \u00edndice ou aglomerado com conglom id ''{0}'' para eliminar.
XSAM3.S=N\u00e3o h\u00e1 nenhum \u00edndice ou aglomerado com conglom id ''{0}''.
XSAM4.S=N\u00e3o h\u00e1 nenhuma ordena\u00e7\u00e3o chamada ''{0}''.
XSAM5.S=A varredura deve ser aberta e posicionada chamando next() antes de fazer outras chamadas.
XSAM6.S=Registro {2} na p\u00e1gina {1} do cont\u00eainer {0} n\u00e3o encontrado.


#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/Generic
# sqlstate range: XSCG0 to XSCGZ
XSCG0.S=N\u00e3o foi poss\u00edvel criar um gabarito.

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/Heap
# sqlstate range: XSCH0 to XSCHZ

XSCH8.S=O recurso n\u00e3o est\u00e1 implementado.
XSCH7.S=A varredura n\u00e3o est\u00e1 posicionada.
XSCH6.S=O cont\u00eainer heap com o id do cont\u00eainer {0} est\u00e1 fechado.
XSCH5.S=H\u00e1 uma incompatibilidade em uma tabela base entre o n\u00famero de colunas solicitadas {0} e o n\u00famero m\u00e1ximo de colunas {1}.
XSCH4.S=N\u00e3o foi poss\u00edvel criar o aglomerado.
XSCH1.S=Cont\u00eainer {0} n\u00e3o encontrado.
XSCH0.S=N\u00e3o foi poss\u00edvel criar o cont\u00eainer.

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/BTree/Generic
# sqlstate range: XSCB0 to XSCBZ
XSCB9.S=Reservado para teste.
XSCB8.S=O aglomerado btree {0} est\u00e1 fechado.
XSCB7.S=Foi encontrado um erro interno durante a varredura btree - current_rh \u00e9 nulo = {0}, chave de posi\u00e7\u00e3o \u00e9 nula = {1}.
XSCB6.S=Limita\u00e7\u00e3o: O registro de um \u00edndice secund\u00e1rio btree n\u00e3o pode ser atualizado ou inserido devido \u00e0 falta de espa\u00e7o na p\u00e1gina.  Utilize os par\u00e2metros derby.storage.pageSize e/ou derby.storage.pageReservedSpace como alternativa para esta limita\u00e7\u00e3o.
XSCB5.S=A linha n\u00e3o p\u00f4de ser encontrada na \u00e1rvore durante a a\u00e7\u00e3o l\u00f3gica de desfazer uma inser\u00e7\u00e3o ou exclus\u00e3o de btree.
XSCB4.S=Um m\u00e9todo em uma varredura btree aberta foi chamado antes do posicionamento da varredura na primeira linha (ex. ainda n\u00e3o foi feita nenhuma chamada next()).  O estado atual da varredura \u00e9 ({0}).
XSCB3.S=Recurso n\u00e3o implementado.
XSCB2.S=A propriedade solicitada {0} n\u00e3o foi encontrada na lista de propriedades especificadas para createConglomerate() de um \u00edndice secund\u00e1rio btree.
XSCB1.S=Cont\u00eainer {0} n\u00e3o encontrado.
XSCB0.S=N\u00e3o foi poss\u00edvel criar o cont\u00eainer.

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Sort/External
# sqlstate range: XSAS0 to XSASZ

XSAS6.S=N\u00e3o foi poss\u00edvel adquirir recursos para ordena\u00e7\u00e3o.
XSAS3.S=O tipo da linha inserida em uma ordena\u00e7\u00e3o n\u00e3o corresponde ao gabarito da ordena\u00e7\u00e3o.
XSAS1.S=Houve uma tentativa de buscar uma linha antes do in\u00edcio de uma ordena\u00e7\u00e3o ou ap\u00f3s o final dela.
XSAS0.S=Um m\u00e9todo de interface do controlador de varredura foi chamado; isso n\u00e3o \u00e9 adequado a uma varredura em uma ordena\u00e7\u00e3o.

# java/com/ibm/db2j/protocol/Database/Storage/RawStore/Interface.
# statement errors.
# sqlstate range: XSRS0 to XSRSZ
XSRS0.S=N\u00e3o \u00e9 poss\u00edvel congelar o banco de dados depois que ele j\u00e1 tiver sido congelado.
XSRS1.S=N\u00e3o \u00e9 poss\u00edvel fazer backup do banco de dados para {0}, que n\u00e3o \u00e9 um diret\u00f3rio.
XSRS4.S=Erro ao renomear o arquivo (durante o backup) de {0} para {1}.
XSRS5.S=Erro ao copiar o arquivo (durante o backup) de {0} para {1}.
XSRS6.S=N\u00e3o \u00e9 poss\u00edvel criar o diret\u00f3rio de backup {0}.
XSRS7.S=O backup encontrou uma exce\u00e7\u00e3o inesperada.
XSRS8.S=O Dispositivo de Log s\u00f3 pode ser definido durante o tempo de cria\u00e7\u00e3o, ele n\u00e3o pode ser alterado agora.
XSRS9.S=O registro {0} n\u00e3o existe mais


# java/com/ibm/db2j/impl/Database/Storage/RawStore/Log/Generic
# statement errors.
# sqlstate range: XSLB0 to XSLBZ
XSLB9.S=N\u00e3o \u00e9 poss\u00edvel fazer nenhuma altera\u00e7\u00e3o, a cria\u00e7\u00e3o de logs foi encerrada.
XSLB8.S=Tentando redefinir uma varredura para {0} al\u00e9m dos limites de {1}.
XSLB6.S=Tentando registrar um Registro de logs com comprimento 0 ou -ve.
XSLB5.S=Inst\u00e2ncia truncationLWM {1} ilegal para o ponto de truncamento {0}. A faixa permitida \u00e9 de {2} a {3}.
XSLB4.S=N\u00e3o \u00e9 poss\u00edvel encontrar truncationLWM {0}.
XSLB2.S=Opera\u00e7\u00e3o de log {0} registrando dados excessivos, preenchendo o buffer interno de logs.
XSLB1.S=A opera\u00e7\u00e3o de log {0} encontrou erro ao gravar a si mesma no fluxo de logs. Isso pode ter sido causado por uma opera\u00e7\u00e3o de log incorreta ou o buffer interno de logs estava cheio devido a uma opera\u00e7\u00e3o de log excessivamente grande.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Log/Generic
# database errors.
# sqlstate range: XSLA0 to XSLAZ
XSLAT.D=O diret\u00f3rio de log {0} existe. Certifique-se de que a localiza\u00e7\u00e3o do logDevice especificado esteja correta. 
XSLAS.D=Diret\u00f3rio de log {0} n\u00e3o localizado no backup durante a restaura\u00e7\u00e3o. Certifique-se de que a c\u00f3pia de backup seja a correta e que n\u00e3o esteja corrompida.
XSLAR.D=Imposs\u00edvel copiar arquivo de log ''{0}'' para ''{1}'' durante a restaura\u00e7\u00e3o. Certifique-se de que haja espa\u00e7o suficiente e que as permiss\u00f5es estejam corretas.  
XSLAQ.D=N\u00e3o \u00e9 poss\u00edvel criar o arquivo de log no diret\u00f3rio {0}.
XSLAP.D=O Banco de Dados em {0} \u00e9 da vers\u00e3o {1}. N\u00e3o \u00e9 poss\u00edvel fazer upgrade do bancos de dados beta,
XSLAO.D=Falha na recupera\u00e7\u00e3o devido ao problema inesperado {0}.
XSLAN.D=O banco de dados em {0} tinha um formato incompat\u00edvel com a vers\u00e3o atual do software.  O banco de dados foi criado ou atualizado pela vers\u00e3o {1}.
XSLAM.D=N\u00e3o \u00e9 poss\u00edvel verificar o formato do banco de dados em {1} devido a IOException.
XSLAL.D=O tamanho do registro de log {2} excedeu o tamanho m\u00e1ximo permitido para o arquivo de log {3}. Erro no arquivo de log {0}, posi\u00e7\u00e3o {1}
XSLAK.D=O banco de dados excedeu o maior n\u00famero de arquivos de log {0}.
XSLAJ.D=O sistema de registro foi marcado para encerrar devido a um problema anterior e n\u00e3o permitir\u00e1 outras opera\u00e7\u00f5es at\u00e9 que o sistema seja encerrado e iniciado novamente.
XSLAI.D=N\u00e3o \u00e9 poss\u00edvel registrar o registro de log do ponto de verifica\u00e7\u00e3o
XSLAH.D=Um banco de dados somente leitura est\u00e1 sendo atualizado.
XSLAF.D=Um banco de dados somente leitura foi criado com buffers de dados sujos.
XSLAE.D=O arquivo de controle em {0} n\u00e3o pode ser gravado ou atualizado.
XSLAD.D=O registro de log na inst\u00e2ncia {2} do arquivo de log {3} est\u00e1 corrompido. Comprimento do registro de log esperado {0}, comprimento real {1}.
XSLAC.D=O banco de dados em {0} possui um formato incompat\u00edvel com a vers\u00e3o atual do software, ele pode ter sido criado ou atualizado por uma vers\u00e3o posterior.
XSLAB.D=N\u00e3o \u00e9 poss\u00edvel encontrar o arquivo de log {0}. Verifique se a propriedade logDevice est\u00e1 definida corretamente com o separador de caminho correto da sua plataforma.
XSLAA.D=O armazenamento foi marcado para ser encerrado por uma exce\u00e7\u00e3o anterior.
XSLA8.D=N\u00e3o \u00e9 poss\u00edvel reverter a transa\u00e7\u00e3o {0}, tentando compensar a opera\u00e7\u00e3o {1} com {2}
XSLA7.D=N\u00e3o \u00e9 poss\u00edvel refazer a opera\u00e7\u00e3o {0} no log.
XSLA6.D=N\u00e3o \u00e9 poss\u00edvel recuperar o banco de dados.
XSLA5.D=N\u00e3o \u00e9 poss\u00edvel ler o fluxo de logs por alguma raz\u00e3o para reverter a transa\u00e7\u00e3o {0}.
XSLA4.D=N\u00e3o \u00e9 poss\u00edvel gravar o log, ele est\u00e1 praticamente cheio.  Exclua os arquivos desnecess\u00e1rios.  Tamb\u00e9m \u00e9 poss\u00edvel que o sistema de arquivos seja somente leitura ou que haja falhas no disco ou algum outro problema com a m\u00eddia.
XSLA3.D=Log Corrompido, h\u00e1 dados inv\u00e1lidos no fluxo de logs.
XSLA2.D=O sistema ser\u00e1 encerrado, Exce\u00e7\u00e3o de E/S obtida ao acessar o arquivo de log.
XSLA1.D=O Registro de Log foi enviado para o fluxo, mas ele n\u00e3o pode ser aplicado para o armazenamento (Objeto {0}).  Isso tamb\u00e9m pode causar problemas de recupera\u00e7\u00e3o.
XSLA0.D=N\u00e3o \u00e9 poss\u00edvel liberar o arquivo de log para o disco {0}.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# statement errors.
# sqlstate range: XSTA0 to XSTAZ
# changed XSTA0 and XSTA1 to match DB2 sqlstates - bug 4466
3B501.S=Um SAVEPOINT com o nome transmitido j\u00e1 existe na transa\u00e7\u00e3o atual.
3B502.S=Um RELEASE ou ROLLBACK TO SAVEPOINT foi especificado, mas o savepoint n\u00e3o existe.
3B001.S=SAVEPOINT, {0} n\u00e3o existe ou n\u00e3o est\u00e1 ativo na transa\u00e7\u00e3o atual.
3B002.S=O n\u00famero m\u00e1ximo de pontos de salvamentos foi alcan\u00e7ado. 
XSTA2.S=Uma transa\u00e7\u00e3o j\u00e1 estava ativa quando houve a tentativa de tornar outra transa\u00e7\u00e3o ativa.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# transaction errors.
# sqlstate range: 40XT0 to 40XTZ
40XT0=Um erro interno foi identificado pelo m\u00f3dulo RawStore.
40XT1=Ocorreu uma exce\u00e7\u00e3o durante a transa\u00e7\u00e3o.
40XT2=Ocorreu uma exce\u00e7\u00e3o durante a revers\u00e3o de um SAVEPOINT.
40XT4=Houve uma tentativa de encerramento de uma transa\u00e7\u00e3o que ainda estava ativa, a transa\u00e7\u00e3o foi interrompida.
40XT5=Exce\u00e7\u00e3o ocorrida durante uma transa\u00e7\u00e3o interna.
40XT6=O banco de dados est\u00e1 no estado de quiesce, n\u00e3o \u00e9 poss\u00edvel ativar a transa\u00e7\u00e3o.  Aguarde um momento, at\u00e9 que ele saia do estado de quiesce.
40XT7=A opera\u00e7\u00e3o n\u00e3o \u00e9 suportada em uma transa\u00e7\u00e3o interna.

#
#java/com/ibm/db2j/internalUtil
#	Id Parse Errors       			XCXA0-XCXAZ
#  	Db Class Path Parse Errors 	 	XCXB0-XCXBZ
# 	Id List Parse Errors			XCXC0-XCXCZ
#  	IO Errors						XCXD0-XCXDZ
#	LocaleFinder Errors				XCXE0-XCXEZ
XCXA0.S=Identificador inv\u00e1lido.
XCXB0.S=Classpath do banco de dados inv\u00e1lido: ''{0}''.
XCXC0.S=Lista de ids inv\u00e1lida.
XCXE0.S=Voc\u00ea est\u00e1 tentando executar uma opera\u00e7\u00e3o que utiliza o territ\u00f3rio do banco de dados, mas o banco de dados ainda n\u00e3o possui um territ\u00f3rio. 
# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# system errors.
# sqlstate range: XSTB0 to XSTBZ
XSTB0.M=Ocorreu uma exce\u00e7\u00e3o durante a interrup\u00e7\u00e3o da transa\u00e7\u00e3o.
XSTB2.M=N\u00e3o \u00e9 poss\u00edvel registrar as altera\u00e7\u00f5es da transa\u00e7\u00e3o, tente gravar em um banco de dados somente leitura.
XSTB3.M=N\u00e3o \u00e9 poss\u00edvel interromper a transa\u00e7\u00e3o porque o gerenciador de logs \u00e9 nulo, provavelmente devido a um erro anterior.
XSTB5.M=A cria\u00e7\u00e3o de banco de dados com o registro desativado encontrou um problema inesperado.
XSTB6.M=N\u00e3o \u00e9 poss\u00edvel substituir uma tabela de transa\u00e7\u00e3o por outra enquanto a tabela estiver sendo utilizada.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# transaction errors.
# sqlstate range: 40XD0 to 40XDZ
40XD0=O cont\u00eainer foi fechado
40XD1=O cont\u00eainer foi aberto no modo somente leitura
40XD2=O cont\u00eainer {0} n\u00e3o pode ser aberto, ele foi eliminado ou n\u00e3o existe


# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# statement errors.
# sqlstate range: XSDA0 to XSDAZ
XSDA1.S=Houve uma tentativa de acessar um slot fora de faixa em uma p\u00e1gina
XSDA2.S=Houve uma tentativa de atualizar um registro exclu\u00eddo
XSDA3.S=Limita\u00e7\u00e3o: O registro n\u00e3o pode ser atualizado ou inserido devido \u00e0 falta de espa\u00e7o na p\u00e1gina. Utilize os par\u00e2metros derby.storage.pageSize e/ou derby.storage.pageReservedSpace como alternativa para esta limita\u00e7\u00e3o.
XSDA4.S=Ocorreu uma exce\u00e7\u00e3o inesperada
XSDA5.S=Houve uma tentativa de recuperar um registro que n\u00e3o tinha sido exclu\u00eddo
XSDA6.S=A coluna {0} da linha \u00e9 nula, precisa ser definida para apontar para um objeto.
XSDA7.S=Restaura\u00e7\u00e3o de um objeto SQLData ou seri\u00e1vel da classe {0}, tentativa de ler mais dados do que foi originalmente armazenado
XSDA8.S=Ocorreu uma exce\u00e7\u00e3o durante a restaura\u00e7\u00e3o de um objeto SQLData ou seri\u00e1vel da classe {0}
XSDA9.S=Classe n\u00e3o encontrada durante a restaura\u00e7\u00e3o de um objeto SQLData ou seri\u00e1vel da classe {0}
XSDAA.S=Data e hora {0} ilegais, a data e a hora s\u00e3o provenientes de uma p\u00e1gina diferente ou de uma implementa\u00e7\u00e3o incompat\u00edvel
XSDAB.S=n\u00e3o \u00e9 poss\u00edvel definir uma data e hora nulas
XSDAC.S=Tentativa de mover linhas ou p\u00e1ginas de um cont\u00eainer para outro.
XSDAD.S=Tentativa de mover zero linhas de uma p\u00e1gina para outra.
XSDAE.S=S\u00f3 \u00e9 poss\u00edvel criar um identificador de registros com um id do identificador especial de registros.
XSDAF.S=Utilizando o identificador especial de registros como se fosse um identificador normal de registros.
XSDAG.S=A principal transa\u00e7\u00e3o do aninhamento de aloca\u00e7\u00e3o n\u00e3o pode abrir o cont\u00eainer.
XSDAI.S=A p\u00e1gina {0} que est\u00e1 sendo removida j\u00e1 est\u00e1 bloqueada para desaloca\u00e7\u00e3o.
XSDAJ.S=Ocorreu uma exce\u00e7\u00e3o durante a grava\u00e7\u00e3o de um objeto SQLData ou seri\u00e1vel
XSDAK.S=Uma p\u00e1gina incorreta foi obtida para o identificador de registros {0}.
XSDAL.S=O identificador de registros {0} inesperadamente aponta para a p\u00e1gina estourada.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# database errors.
# sqlstate range: XSDB0 to XSDBZ
XSDB0.D=Exce\u00e7\u00e3o inesperada na p\u00e1gina da mem\u00f3ria {0}
XSDB1.D=Formato de p\u00e1gina desconhecido na p\u00e1gina {0}
XSDB2.D=Formato de cont\u00eainer desconhecido no cont\u00eainer {0}: {1}
XSDB3.D=As informa\u00e7\u00f5es sobre o cont\u00eainer n\u00e3o podem ser alteradas depois de gravadas: posteriormente {0}, agora {1}
XSDB4.D=A p\u00e1gina {0} est\u00e1 na vers\u00e3o {1}, o arquivo de log cont\u00e9m altera\u00e7\u00f5es na vers\u00e3o {2}, est\u00e3o faltando registros de logs nesta p\u00e1gina ou a p\u00e1gina n\u00e3o foi gravada corretamente no disco.
XSDB5.D=O log alterou o registro na p\u00e1gina {0}, o qual est\u00e1 al\u00e9m do final do cont\u00eainer.
XSDB6.D=Outra inst\u00e2ncia do Derby j\u00e1 pode ter reinicializado o banco de dados {0}.
XSDB7.D=AVISO: O Derby (inst\u00e2ncia {0}) est\u00e1 tentando reinicializar o banco de dados {1} mesmo que o Derby (inst\u00e2ncia {2}) ainda esteja ativo.  Apenas uma inst\u00e2ncia do Derby deve reinicializar um banco de dados. Pode ter ocorrido ou resultar em danos graves e irrecuper\u00e1veis.
XSDB8.D=AVISO: O Derby (inst\u00e2ncia {0}) est\u00e1 tentando reinicializar o banco de dados {1} mesmo que o Derby (inst\u00e2ncia {2}) ainda esteja ativo.  Apenas uma inst\u00e2ncia do Derby deve reinicializar um banco de dados. A reinicializa\u00e7\u00e3o simult\u00e2nea de 2 inst\u00e2ncias do Derby no mesmo banco de dados pode resultar em danos graves e irrecuper\u00e1veis.  A propriedade db2j.database.forceDatabaseLock=true foi definida, portanto, o banco de dados n\u00e3o ser\u00e1 reinicializado at\u00e9 que db.lck n\u00e3o esteja mais presente.  Normalmente, essearquivo \u00e9 removido quando a primeira inst\u00e2ncia do Derby que ser\u00e1 reinicializada no banco de dados j\u00e1 existe, mas ele pode ser abandonado no encerramento.  Nesse caso, ser\u00e1 necess\u00e1rio remover o arquivo manualmente.  \u00c9 importante verificar se nenhuma outra VM est\u00e1 acessando o banco de dados antes de excluir manualmente o arquivo db.lck.
XSDB9.D=O cont\u00eainer de fluxo {0} est\u00e1 corrompido.
XSDBA.D=Falha na tentativa de alocar o objeto {0}.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/FileSystem
# statment errors.
# sqlstate range: XSDF0 to XSDFZ
XSDF0.S=N\u00e3o foi poss\u00edvel criar o arquivo {0}, ele j\u00e1 existe.
XSDF1.S=Ocorreu uma exce\u00e7\u00e3o durante a cria\u00e7\u00e3o do arquivo {0} no cont\u00eainer
XSDF2.S=Exce\u00e7\u00e3o durante cria\u00e7\u00e3o do arquivo {0} para o cont\u00eainer, o arquivo n\u00e3o p\u00f4de ser removido.  A exce\u00e7\u00e3o foi: {1}.
XSDF3.S=N\u00e3o \u00e9 poss\u00edvel criar o segmento {0}.
XSDF4.S=Ocorreu uma exce\u00e7\u00e3o durante a remo\u00e7\u00e3o do arquivo {0} do cont\u00eainer eliminado, o arquivo n\u00e3o p\u00f4de ser removido {1}.
XSDF6.S=N\u00e3o \u00e9 poss\u00edvel encontrar a p\u00e1gina de aloca\u00e7\u00e3o {0}.
XSDF7.S=A p\u00e1gina criada recentemente falhou ao ser travada {0}
XSDF8.S=N\u00e3o \u00e9 poss\u00edvel encontrar a p\u00e1gina {0} para reutiliz\u00e1-la.
XSDFB.S=Opera\u00e7\u00e3o n\u00e3o suportada por um banco de dados somente leitura
XSDFD.S=Imagem diferente de p\u00e1gina lida em 2 E/S na P\u00e1gina {0}, checksum estava incorreto na primeira imagem, checksum estava correto na segunda imagem. A seguir, as imagens da p\u00e1gina: {1} {2}
XSDFF.S=A opera\u00e7\u00e3o solicitada falhou devido a uma exce\u00e7\u00e3o inesperada.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/FileSystem
# database errors.
# sqlstate range: XSDG0 to XSDGZ
XSDG0.D=A p\u00e1gina {0} n\u00e3o p\u00f4de ser lida a partir do disco.
XSDG1.D=A p\u00e1gina {0} n\u00e3o p\u00f4de ser gravada no disco. Verifique se o disco est\u00e1 cheio.
XSDG2.D=Checksum inv\u00e1lido na p\u00e1gina {0}, esperado={1}, vers\u00e3o do disco={2}, dump da p\u00e1gina: {3}
XSDG3.D=N\u00e3o foi poss\u00edvel acessar os metadados do cont\u00eainer {0}
XSDG5.D=O banco de dados n\u00e3o est\u00e1 no modo de cria\u00e7\u00e3o quando createFinished \u00e9 chamado.
XSDG6.D=Diret\u00f3rio de segmento de dados n\u00e3o localizado no backup {0} durante a restaura\u00e7\u00e3o. Certifique-se de que a c\u00f3pia de backup seja a correta e que n\u00e3o esteja corrompida.
XSDG7.D=Imposs\u00edvel remover o diret\u00f3rio {0} durante a restaura\u00e7\u00e3o. Certifique-se de que as permiss\u00f5es estejam corretas.
XSDG8.D=Imposs\u00edvel copiar o diret\u00f3rio ''{0}'' para ''{1}'' durante a restaura\u00e7\u00e3o. Certifique-se de que haja espa\u00e7o suficiente e que as permiss\u00f5es estejam corretas.  

# language
01500=A limita\u00e7\u00e3o {0} na tabela {1} foi eliminada.
01501=A exibi\u00e7\u00e3o {0} foi eliminada.
01502=O disparo {0} na tabela {1} foi eliminado.
01503=A coluna {0} na tabela {1} foi modificada pela inclus\u00e3o de uma limita\u00e7\u00e3o que n\u00e3o era nula.
01504=O novo \u00edndice \u00e9 uma duplica\u00e7\u00e3o de um \u00edndice existente: {0}.
01505=O valor {0} pode estar truncado.
01003=Os valores nulos foram eliminados do argumento de uma fun\u00e7\u00e3o de coluna.
0100E=XX Tentativa de retornar muitos conjuntos de resultados
02000=Nenhuma linha foi encontrada para FETCH, UPDATE ou DELETE; ou o resultado de uma consulta \u00e9 uma tabela vazia.
21000=A subconsulta escalar \u00e9 permitida apenas para retornar uma \u00fanica linha.
22001=Foi encontrado um erro de truncamento ao tentar reduzir {0} ''{1}'' para o comprimento {2}.
54006=O comprimento resultante da opera\u00e7\u00e3o {0} \u00e9 maior que {1}.
22003=O valor resultante est\u00e1 fora do intervalo para o tipo de dados {0}.
22005=Houve uma tentativa de obter um valor de dados do tipo ''{0}'' a partir de um valor de dados do tipo ''{1}''.
22007.S.180=A representa\u00e7\u00e3o da cadeia de um valor datetime est\u00e1 fora do intervalo.
22007.S.181=A sintaxe da cadeia de um valor datetime est\u00e1 incorreta.
22011=O segundo ou terceiro argumentos da fun\u00e7\u00e3o SUBSTR est\u00e1 fora do intervalo.
22012=Tentativa de dividir por zero.
22013=Tentativa de obter a raiz quadrada de um n\u00famero negativo, ''{0}''.
22014=A posi\u00e7\u00e3o inicial de LOCATE \u00e9 inv\u00e1lida; ela deve ser um inteiro positivo.  O \u00edndice a partir do qual a pesquisa ser\u00e1 iniciada \u00e9 ''{2}''.  A cadeia que ser\u00e1 pesquisada \u00e9 ''{0}''.  A cadeia a partir da qual a pesquisa ser\u00e1 executada \u00e9 ''{1}''.

22015=A fun\u00e7\u00e3o ''{0}'' n\u00e3o \u00e9 permitida no conjunto de tipos a seguir.  O primeiro operando \u00e9 do tipo ''{1}''.  O segundo operando \u00e9 do tipo ''{2}''.  O terceiro operando (posi\u00e7\u00e3o inicial) \u00e9 do tipo ''{3}''.
22018=Formato de cadeia de caracteres inv\u00e1lido para o tipo {0}.
22019=Seq\u00fc\u00eancia de escape inv\u00e1lida, ''{0}''. A cadeia de escape deve ter exatamente um caractere. Ela n\u00e3o pode ser nula ou ter mais de um caractere.
22025=O caractere de escape deve ser seguido pelo caractere de escape, '_' ou '%'. Ele n\u00e3o pode ser seguido por outro caractere ou estar no final do padr\u00e3o.
22027=A fun\u00e7\u00e3o interna TRIM() suporta um \u00fanico caractere de recorte.  As fun\u00e7\u00f5es internas LTRIM() e RTRIM() suportam m\u00faltiplos caracteres de recorte.
22500=N\u00e3o \u00e9 poss\u00edvel utilizar par\u00e2metros para o padr\u00e3o LIKE e para a cl\u00e1usula ESCAPE.
22501=Uma cl\u00e1usula ESCAPE de NULL retorna resultados indefinidos e n\u00e3o \u00e9 permitida.
23502=A coluna ''{0}'' n\u00e3o pode aceitar um valor NULL.
23505=A instru\u00e7\u00e3o foi abortada pois ela teria causado um valor de chave duplicado em uma limita\u00e7\u00e3o de chave exclusiva ou prim\u00e1ria ou em um \u00edndice exclusivo identificado por ''{0}'' definido em ''{1}''.
23503={2} na tabela ''{1}'' causou uma viola\u00e7\u00e3o na limita\u00e7\u00e3o da chave externa ''{0}'' para a chave {3}.  A instru\u00e7\u00e3o foi revertida.
23513=A limita\u00e7\u00e3o de verifica\u00e7\u00e3o ''{1}'' foi violada durante a execu\u00e7\u00e3o de INSERT ou UPDATE na tabela ''{0}''.
38000=A execu\u00e7\u00e3o ''{0}'' ocorreu durante a avalia\u00e7\u00e3o de uma express\u00e3o.
38001=A rotina externa n\u00e3o tem permiss\u00e3o para executar instru\u00e7\u00f5es SQL.
38002=A rotina tentou modificar dados, mas a rotina n\u00e3o foi definida como MODIFIES SQL DATA.
38004=A rotina tentou ler dados, mas a rotina n\u00e3o foi definida como READS SQL DATA.
39004=Um valor NULL n\u00e3o pode ser transmitido a um m\u00e9todo que leva um par\u00e2metro do tipo primitivo ''{0}''.
40XC0=Instru\u00e7\u00e3o inutilizada. Isso pode ter sido causado pela captura de um erro grave de transa\u00e7\u00e3o dentro dessa instru\u00e7\u00e3o.
# this error is retired in 1.3
42000=Erro de sintaxe ou viola\u00e7\u00e3o de regras de acesso. Consulte os erros adicionais para obter detalhes.

# DB2 error for max length violation by char, varchar and long varchar. In future, this error message will be used for other purposes too
42601=Em uma instru\u00e7\u00e3o ALTER TABLE, a coluna ''{0}'' foi especificada como NOT NULL e a cl\u00e1usula DEFAULT n\u00e3o foi especificada ou foi especificada como DEFAULT NULL.
42601.S.372=Instru\u00e7\u00e3o ALTER TABLE n\u00e3o pode incluir uma coluna IDENTITY em uma tabela. 
42606=Foi detectada uma constante hexadecimal iniciada com ''{0}''.
54002=Uma constante de cadeia iniciada com ''{0}'' \u00e9 muito longa.
42611=O comprimento, precis\u00e3o ou atributo de escala para a coluna, ou mapeamento de tipo ''{0}'' n\u00e3o \u00e9 v\u00e1lida. 

42605=O n\u00famero de argumentos para a fun\u00e7\u00e3o ''{0}'' est\u00e1 incorreto.
42610=Nem todos os argumentos para a fun\u00e7\u00e3o COALESC/VALUE podem ser par\u00e2metros. \u00c9 necess\u00e1rio ter pelo menos um par\u00e2metro que n\u00e3o seja um argumento.
42613=V\u00e1rias palavras-chave ou palavras-chave em conflito envolvendo a cl\u00e1usula ''{0}'' est\u00e3o presentes.
42621=Uma limita\u00e7\u00e3o de verifica\u00e7\u00e3o ou coluna gerada definida com ''{0}'' \u00e9 inv\u00e1lida.
42734=O nome ''{0}'' especificado no contexto ''{1}'' n\u00e3o \u00e9 exclusivo.
# DB2 error for invalid set schema
42802=O n\u00famero de valores designados n\u00e3o \u00e9 igual ao n\u00famero de colunas especificadas ou impl\u00edcitas.
42815.S.713=O valor de substitui\u00e7\u00e3o para ''{0}'' \u00e9 inv\u00e1lido.
42815.S.171=O tipo dos dados, comprimento ou valor dos argumentos ''{0}'' e ''{1}'' \u00e9 incompat\u00edvel.
42820=O literal de ponto flutuante ''{0}'' cont\u00e9m mais de 30 caracteres.
42824=Um operando de LIKE n\u00e3o \u00e9 uma cadeia, ou o primeiro operando n\u00e3o \u00e9 uma coluna.
42831=''{0}'' n\u00e3o pode ser uma coluna de uma chave prim\u00e1ria ou chave exclusiva, pois ela pode conter valores nulos.
42834=SET NULL n\u00e3o pode ser especificado porque FOREIGN KEY ''{0}'' n\u00e3o pode conter valores nulos.

42884=Nenhuma rotina autorizada denominada ''{0}'' do tipo ''{1}'' tendo argumentos compat\u00edveis foi localizada.
42886=''{0}'' par\u00e2metro ''{1}'' requer um marcador de par\u00e2metro ''?''.
42894=O valor DEFAULT ou o valor de atributo IDENTITY n\u00e3o s\u00e3o v\u00e1lidos para a coluna ''{0}''.
428C1=Apenas uma coluna de identidade \u00e9 permitida por tabela.
42903=Uso inv\u00e1lido de fun\u00e7\u00e3o de agrega\u00e7\u00e3o.
42908=A instru\u00e7\u00e3o CREATE VIEW n\u00e3o inclui uma lista de colunas.
42915=A chave externa ''{0}'' \u00e9 inv\u00e1lida devido a ''{1}''.

42972=Uma cl\u00e1usula ON associada a um operador JOIN n\u00e3o \u00e9 v\u00e1lida.
42X01=Erro de sintaxe: {0}.
42X02={0}.
42X03=O nome da coluna ''{0}'' est\u00e1 em mais de uma tabela na lista FROM.
42X04=A coluna ''{0}'' n\u00e3o est\u00e1 em nenhuma tabela da lista FROM ou aparece dentro de uma especifica\u00e7\u00e3o de jun\u00e7\u00e3o e est\u00e1 fora do escopo da especifica\u00e7\u00e3o de jun\u00e7\u00e3o ou, ainda, aparece em uma cl\u00e1usula HAVING e n\u00e3o est\u00e1 na lista GROUP BY.  Se essa for uma instru\u00e7\u00e3o CREATE ou ALTER TABLE, ent\u00e3o, ''{0}'' n\u00e3o ser\u00e1 uma coluna na tabela de destino.
42X05=A tabela ''{0}'' n\u00e3o existe.
42X06=Muitas colunas de resultados especificadas para a tabela ''{0}''.
42X07=O valor nulo \u00e9 permitido apenas em uma cl\u00e1usula VALUES, dentro de uma instru\u00e7\u00e3o INSERT.
42X08=O construtor da classe ''{0}'' n\u00e3o pode ser utilizado como uma tabela virtual externa, pois a classe n\u00e3o implementa ''{1}''
42X09=O nome da tabela ou alias ''{0}'' \u00e9 usado mais de uma vez na lista FROM.
42X10=''{0}'' n\u00e3o \u00e9 um nome exposto de tabela no escopo em que aparece.
42622=O nome ''{0}'' \u00e9 muito longo. O comprimento m\u00e1ximo \u00e9 ''{1}''.
42X12=O nome da coluna ''{0}'' aparece mais de uma vez na instru\u00e7\u00e3o de cria\u00e7\u00e3o de tabela.
54011=Um n\u00famero excessivo de colunas ({0}) foi especificado para a tabela ou visualiza\u00e7\u00e3o {1}. O limite \u00e9 {2}.
42Z9F=N\u00famero excessivo de \u00edndices ({0}) na tabela {1}. O limite \u00e9 {2}.
42X13=O nome da coluna ''{0}'' aparece mais de uma vez na lista de colunas de uma instru\u00e7\u00e3o de inser\u00e7\u00e3o.
42X14=''{0}'' n\u00e3o \u00e9 uma coluna na tabela ou VTI ''{1}''.
42X15=O nome da coluna ''{0}'' aparece em uma instru\u00e7\u00e3o sem uma lista FROM.
42X16=O nome da coluna ''{0}'' aparece diversas vezes na cl\u00e1usula SET de uma instru\u00e7\u00e3o de atualiza\u00e7\u00e3o.
42X17=O valor ''{0}'' n\u00e3o \u00e9 v\u00e1lido como uma especifica\u00e7\u00e3o joinOrder na lista de propriedades de uma cl\u00e1usula FROM. Somente os valores FIXED e UNFIXED s\u00e3o v\u00e1lidos.
42803=Uma express\u00e3o contendo a coluna ''{0}'' \u00e9 exibida na lista SELECT e n\u00e3o faz parte de uma cl\u00e1usula GROUP BY.
42818=Compara\u00e7\u00f5es entre ''{0}'' e ''{1}'' n\u00e3o s\u00e3o suportadas.
42X19=A cl\u00e1usula WHERE ou HAVING ou a defini\u00e7\u00e3o CHECK CONSTRAINT \u00e9 uma express\u00e3o ''{0}''.  Ela deve ser uma express\u00e3o BOOLEAN.
42X23=O cursor {0} n\u00e3o pode ser atualizado.
#42X24=The unary ''-'' operator is not allowed on the ''{0}'' type.
42X25=A fun\u00e7\u00e3o ''{0}'' n\u00e3o \u00e9 permitida no tipo ''{1}''.
42X26=A classe ''{0}'' da coluna ''{1}'' n\u00e3o existe ou est\u00e1 inacess\u00edvel. Isso pode ocorrer se a classe n\u00e3o for p\u00fablica.
42X28=Excluir a tabela ''{0}'' n\u00e3o \u00e9 o objetivo do cursor ''{1}''.
42X29=Atualizar a tabela ''{0}'' n\u00e3o \u00e9 o objetivo do cursor ''{1}''.
42X30=O cursor ''{0}'' n\u00e3o foi encontrado. Verifique se a execu\u00e7\u00e3o autom\u00e1tica est\u00e1 DESATIVADA.
42X31=A coluna ''{0}'' n\u00e3o est\u00e1 na lista FOR UPDATE do cursor ''{1}''.
42X32=O n\u00famero de colunas na lista de colunas derivadas deve corresponder ao n\u00famero de colunas na tabela ''{0}''.
42X33=A lista de colunas derivadas cont\u00e9m um nome de coluna duplicado ''{0}''.
42X34=H\u00e1 um ? par\u00e2metro na lista de sele\u00e7\u00e3o.  Isso n\u00e3o \u00e9 permitido.
42X35=N\u00e3o \u00e9 permitido que operandos de ''{0}'' sejam ? par\u00e2metros.
42X36=N\u00e3o \u00e9 permitido que o operador ''{0}'' obtenha ? um par\u00e2metro como um operando.
42X37=O operador un\u00e1rio ''{0}'' n\u00e3o \u00e9 permitido no tipo ''{1}''.
42X38=''SELECT *'' \u00e9 permitido apenas em subconsultas EXISTS e NOT EXISTS.
42X39=A subconsulta \u00e9 permitida apenas para retornar uma \u00fanica coluna.
42X40=NOT possui um operando que n\u00e3o \u00e9 booleano. O operando de NOT deve ser avaliado como TRUE, FALSE ou UNKNOWN.
42X41=A propriedade ''{0}'' n\u00e3o \u00e9 v\u00e1lida na cl\u00e1usula Properties de uma lista FROM (a propriedade estava sendo definida como ''{1}'').
42821=Colunas do tipo ''{0}'' n\u00e3o podem conter valores do tipo ''{1}''. 
42X43=O ResultSetMetaData retornado para a classe/objeto ''{0}'' era nulo. ResultSetMetaData n\u00e3o deve ser nulo para utilizar essa classe como uma tabela virtual externa.
42X44=Comprimento inv\u00e1lido ''{0}'' na especifica\u00e7\u00e3o da coluna.
# 42X45=
# 42X46=
# 42X47=
42X48=O valor ''{1}'' n\u00e3o \u00e9 uma precis\u00e3o v\u00e1lida para {0}.
42X49=O valor ''{0}'' n\u00e3o \u00e9 um literal inteiro v\u00e1lido.
42X50=N\u00e3o foi encontrado nenhum m\u00e9todo que correspondesse \u00e0 chamada de m\u00e9todo {0}.{1}({2}), mesmo ap\u00f3s tentar todas as combina\u00e7\u00f5es de tipos primitivos e de objetos e todas as convers\u00f5es poss\u00edveis de tipos para qualquer par\u00e2metro que a chamada de m\u00e9todo pudesse ter.  Isso pode ocorrer porque o m\u00e9todo existe mas n\u00e3o \u00e9 p\u00fablico e/ou est\u00e1tico ou porque os tipos de par\u00e2metros n\u00e3o s\u00e3o invoca\u00e7\u00f5es de m\u00e9todos que podem ser convertidos.
42X51=A classe ''{0}'' n\u00e3o existe ou est\u00e1 inacess\u00edvel. Isso pode ocorrer se a classe n\u00e3o for p\u00fablica.
42X52=A chamada do m\u00e9todo (''{0}'') utilizando um receptor do tipo primitivo Java ''{1}" n\u00e3o \u00e9 permitida.
42X53=O predicado LIKE pode ter apenas os operandos ''CHAR'' ou ''VARCHAR''. O tipo ''{0}'' n\u00e3o \u00e9 permitido.
42X54=O m\u00e9todo Java ''{0}'' possui ? como receptor.  Isso n\u00e3o \u00e9 permitido.
42X55=O nome da tabela ''{1}'' deve ser id\u00eantico a ''{0}''.
42X56=O n\u00famero de colunas na lista de colunas exibidas n\u00e3o corresponde ao n\u00famero de colunas na express\u00e3o de consulta subjacente da defini\u00e7\u00e3o de exibi\u00e7\u00e3o de''{0}''.
42X57=getColumnCount() da tabela virtual externa ''{0}'' retornou um valor inv\u00e1lido ''{1}''.  Os valores v\u00e1lidos s\u00e3o >= 1.
42X58=O n\u00famero de colunas \u00e0 esquerda e \u00e0 direita de UNION deve ser id\u00eantico.
42X59=O n\u00famero de colunas em cada construtor VALUES deve ser id\u00eantico.
42X60=Valor inv\u00e1lido ''{0}'' para a propriedade insertMode especificada na tabela ''{1}''.
42X61=Os tipos ''{0}'' e ''{1}'' n\u00e3o s\u00e3o compat\u00edveis com UNION.
42X62=''{0}'' n\u00e3o \u00e9 permitido no esquema ''{1}''.
42X63=A cl\u00e1usula USING n\u00e3o retornou nenhum resultado, nenhum par\u00e2metro pode ser definido.
42X64=Valor inv\u00e1lido ''{0}'' especificado para a propriedade useStatistics na lista de propriedades. TRUE ou FALSE s\u00e3o os \u00fanicos valores v\u00e1lidos.
42X65=O \u00edndice ''{0}'' n\u00e3o existe.
42X66=O nome da coluna ''{0}'' aparece mais do que uma vez na instru\u00e7\u00e3o de cria\u00e7\u00e3o de \u00edndice.
42X68=N\u00e3o foi encontrado nenhum campo ''{0}'' que pertencesse \u00e0 classe ''{1}''.  Isso pode ocorrer porque o campo existe, mas n\u00e3o \u00e9 p\u00fablico ou porque a classe n\u00e3o existe ou n\u00e3o \u00e9 p\u00fablica.
42X69=N\u00e3o \u00e9 permitido fazer refer\u00eancia a um campo (''{0}'') utilizando uma express\u00e3o de refer\u00eancia do tipo primitivo Java ''{1}''.
42X72=N\u00e3o foi encontrado nenhum campo est\u00e1tico ''{0}'' que pertencesse \u00e0 classe ''{1}''.  Isso pode ocorrer porque o campo existe, mas n\u00e3o \u00e9 p\u00fablico e/ou est\u00e1tico ou porque a classe n\u00e3o existe ou n\u00e3o \u00e9 p\u00fablica.
42X73=A resolu\u00e7\u00e3o do m\u00e9todo de assinatura {0}.{1}({2}) era amb\u00edgua. (Nenhum m\u00e9todo \u00fanico especificado de forma m\u00e1xima.)
42X74=Sintaxe inv\u00e1lida da instru\u00e7\u00e3o CALL.
42X75=Nenhum construtor foi encontrado com a assinatura {0}({1}).  Isso pode ocorrer porque os tipos de par\u00e2metros n\u00e3o s\u00e3o invoca\u00e7\u00f5es de m\u00e9todos que podem ser convertidos.
42X76=Pelo menos uma coluna, ''{0}'', na chave prim\u00e1ria sendo inclu\u00edda \u00e9 anul\u00e1vel. Todas as colunas em uma chave prim\u00e1ria devem ser n\u00e3o-anul\u00e1veis.
42X77=A posi\u00e7\u00e3o da coluna ''{0}'' est\u00e1 fora do intervalo para a express\u00e3o de consulta.
42X78=A coluna ''{0}'' n\u00e3o est\u00e1 no resultado da express\u00e3o de consulta.
42X79=O nome da coluna ''{0}'' aparece mais de uma vez no resultado da express\u00e3o de consulta.
42877=Um nome qualificado de coluna ''{0}'' n\u00e3o \u00e9 permitido na cl\u00e1usula ORDER BY.
42X80=A cl\u00e1usula VALUES deve conter pelo menos 1 elemento e nenhum elemento deve estar vazio.
42X82=A cl\u00e1usula USING retornou mais de uma linha, s\u00e3o permitidas apenas ResultSets de linhas \u00fanicas.
42X83=As limita\u00e7\u00f5es da coluna ''{0}'' exigem que ela seja anul\u00e1vel ou n\u00e3o anul\u00e1vel.
42X84=O \u00edndice ''{0}'' foi criado para refor\u00e7ar a limita\u00e7\u00e3o ''{1}''.  Ele s\u00f3 pode ser eliminado atrav\u00e9s da elimina\u00e7\u00e3o da limita\u00e7\u00e3o.
42X85=Exige-se que a restri\u00e7\u00e3o ''{0}'' esteja no mesmo esquema da tabela ''{1}''.
42X86=Falha na tabela ALTER. N\u00e3o h\u00e1 limita\u00e7\u00f5es ''{0}'' na tabela ''{1}''.
42X87=Pelo menos uma express\u00e3o de resultado (then ou else) da express\u00e3o ''{0}'' n\u00e3o deve ser ''?''.
42X88=A condicional possui um operando que n\u00e3o \u00e9 booleano. O operando de Condicional deve ser avaliado como TRUE, FALSE ou UNKNOWN.
42X89=Os tipos ''{0}'' e ''{1}'' n\u00e3o s\u00e3o tipos compat\u00edveis. (Nenhum tipo pode ser atribu\u00eddo a outro tipo.)
42X90=Mais de uma limita\u00e7\u00e3o de chave prim\u00e1ria foi especificada para a tabela ''{0}''.
42X91=O nome da limita\u00e7\u00e3o ''{0}'' aparece mais de uma vez na instru\u00e7\u00e3o de cria\u00e7\u00e3o de tabela.
42X92=O nome da coluna ''{0}'' aparece mais de uma vez na lista de colunas da limita\u00e7\u00e3o.
42X93=A tabela ''{0}'' cont\u00e9m uma defini\u00e7\u00e3o de limita\u00e7\u00e3o com a coluna ''{1}'' que n\u00e3o est\u00e1 na tabela.
42Z93=As limita\u00e7\u00f5es ''{0}'' e ''{1}'' possuem o mesmo conjunto de colunas, o que n\u00e3o \u00e9 permitido.
42Z96=Os VTIs de leitura e grava\u00e7\u00e3o n\u00e3o s\u00e3o suportados em ambientes JDK 1.1/JDBC 1.2: ''{0}''
42Z9B=A interface da tabela virtual externa n\u00e3o suporta colunas blob ou clob. ''{0}'' coluna ''{1}''.
42Z9D=Instru\u00e7\u00f5es ''{0}'' n\u00e3o s\u00e3o permitidas em disparadores ''{1}''.
42Z9E=A limita\u00e7\u00e3o ''{0}'' n\u00e3o \u00e9 uma limita\u00e7\u00e3o de {1}.
42X94={0} ''{1}'' n\u00e3o existe.
42X96=O caminho de classe do banco de dados cont\u00e9m um arquivo jar desconhecido ''{0}''.
42X98=N\u00e3o s\u00e3o permitidos par\u00e2metros em uma defini\u00e7\u00e3o VIEW.
42Y00=A classe ''{0}'' n\u00e3o implementa org.apache.derby.iapi.db.AggregateDefinition e dessa forma n\u00e3o pode ser utilizada como express\u00e3o de agrega\u00e7\u00e3o.
42Y01=A limita\u00e7\u00e3o ''{0}'' \u00e9 inv\u00e1lida.
42Y03=''{0}'' n\u00e3o \u00e9 reconhecido como uma fun\u00e7\u00e3o ou procedimento.

# EXTERNAL NAME is SQL keyword - do not translate
42Y04=N\u00e3o \u00e9 poss\u00edvel criar um procedimento ou fun\u00e7\u00e3o com EXTERNAL NAME ''{0}'', pois ele n\u00e3o \u00e9 uma lista separada por pontos. O formato esperado \u00e9 <full java path>.<method name> .

42Y05=N\u00e3o h\u00e1 nenhuma Chave Externa denominada ''{0}''.
42Y07=O esquema ''{0}'' n\u00e3o existe
42Y08=As limita\u00e7\u00f5es da chave externa n\u00e3o s\u00e3o permitidas nas tabelas do sistema.
42Y09=M\u00e9todos inv\u00e1lidos s\u00e3o permitidos apenas em uma instru\u00e7\u00e3o CALL.
42Y10=Um construtor de tabela que n\u00e3o esteja em uma instru\u00e7\u00e3o INSERT tem todos os par\u00e2metros? em uma de suas colunas.  Para cada coluna, pelo menos uma das linhas deve possuir um n\u00e3o par\u00e2metro.
42Y11=Uma especifica\u00e7\u00e3o de jun\u00e7\u00e3o \u00e9 requerida com a cl\u00e1usula ''{0}''.
42Y12=A cl\u00e1usula ON de JOIN \u00e9 uma express\u00e3o ''{0}''.  Ela deve ser uma express\u00e3o BOOLEAN.
42Y13=O nome da coluna ''{0}'' aparece mais de uma vez na instru\u00e7\u00e3o de cria\u00e7\u00e3o de exibi\u00e7\u00e3o.
42Z97=A renomea\u00e7\u00e3o da coluna ''{0}'' far\u00e1 com que a limita\u00e7\u00e3o de verifica\u00e7\u00e3o ''{1}'' seja interrompida.
42Z99=O literal String ou Hex n\u00e3o pode ultrapassar 64K.
42Y16=N\u00e3o foi encontrado nenhum m\u00e9todo p\u00fablico est\u00e1tico ''{0}'' na classe ''{1}''.  Isso pode ter ocorrido porque o m\u00e9todo existe, mas n\u00e3o \u00e9 p\u00fablico ou est\u00e1tico.
42846=N\u00e3o \u00e9 poss\u00edvel converter os tipos ''{0}'' em ''{1}''.
42Y19=''{0}'' aparece diversas vezes na lista GROUP BY. As colunas da lista GROUP BY devem ser amb\u00edguas.
42Y22=A agrega\u00e7\u00e3o {0} n\u00e3o pode operar no tipo {1}.
42Y23=Informa\u00e7\u00f5es incorretas sobre o tipo de JDBC retornado da coluna {0}.
42Y24=A exibi\u00e7\u00e3o ''{0}'' n\u00e3o pode ser atualizada. (Atualmente, as exibi\u00e7\u00f5es n\u00e3o podem ser atualizadas.)
42Y25=''{0}'' \u00e9 uma tabela do sistema.  Os usu\u00e1rios n\u00e3o podem modificar o conte\u00fado dessa tabela.
#42Y26=Parameters are not allowed in the WHEN clause of a trigger.
42Y27=N\u00e3o s\u00e3o permitidos par\u00e2metros na a\u00e7\u00e3o de disparo.
42Y29=A lista SELECT de uma consulta n\u00e3o agrupada cont\u00e9m pelo menos uma express\u00e3o inv\u00e1lida.  Quando a lista SELECT contiver pelo menos uma agrega\u00e7\u00e3o, todas as entradas dever\u00e3o ser express\u00f5es de agrega\u00e7\u00e3o v\u00e1lidas.
42Y30=A lista SELECT de uma consulta agrupada cont\u00e9m pelo menos uma express\u00e3o inv\u00e1lida.  Em uma lista SELECT com uma lista GROUP BY, SELECT pode conter apenas colunas de agrupamento e express\u00f5es de agrega\u00e7\u00e3o v\u00e1lidas.
42Y32=A classe do agregador ''{0}'' para a agrega\u00e7\u00e3o ''{1}'' no tipo {2} n\u00e3o implementa com.ibm.db2j.aggregates.Aggregator.

42Y33=A agrega\u00e7\u00e3o {0} cont\u00e9m uma ou mais agrega\u00e7\u00f5es.
42Y34=O nome da coluna ''{0}'' corresponde a mais de uma coluna de resultados na tabela ''{1}''.
42Y35=A refer\u00eancia da coluna ''{0}'' \u00e9 inv\u00e1lida. Quando a lista SELECT contiver pelo menos uma agrega\u00e7\u00e3o, todas as entradas dever\u00e3o ser express\u00f5es de agrega\u00e7\u00e3o v\u00e1lidas.
42Y36=A refer\u00eancia da coluna ''{0}'' \u00e9 inv\u00e1lida. Em uma lista SELECT com uma lista GROUP BY, SELECT pode conter apenas colunas de agrupamento e express\u00f5es de agrega\u00e7\u00e3o v\u00e1lidas.
42Y37=''{0}'' \u00e9 um primitivo Java e n\u00e3o pode ser utilizado com este operador.
42Y38=insertMode = a substitui\u00e7\u00e3o n\u00e3o \u00e9 permitida em uma inser\u00e7\u00e3o cuja tabela de destino, ''{0}'', \u00e9 referida na lista SELECT.
# NOTE: The parameter to this message is a keyword used as a noun phrase.
# Some possible values are "subquery", "CurrentDate", and "?".
42Y39=''{0}'' pode n\u00e3o ser exibido em uma defini\u00e7\u00e3o de CHECK CONSTRAINT pois ela poder\u00e1 retornar resultados n\u00e3o-determin\u00edsticos.
42Y40=''{0}'' aparece diversas vezes na lista da coluna UPDATE OF para o disparo ''{1}''.
42Y41=''{0}'' n\u00e3o pode ser chamado diretamente por meio da INSTRU\u00c7\u00c3O EXECUTE, pois ele faz parte de um disparo.
42Y42=A escala ''{1}'' n\u00e3o \u00e9 uma escala v\u00e1lida para um {0}.
42Y43=A escala ''{0}'' n\u00e3o \u00e9 uma escala v\u00e1lida com a precis\u00e3o de ''{1}''.
42Y44=Chave inv\u00e1lida, ''{0}'', especificada da lista de propriedades da lista FROM. As chaves suportadas atualmente que fazem distin\u00e7\u00e3o entre mai\u00fasculas e min\u00fasculas s\u00e3o ''{1}''.
42Y45=N\u00e3o \u00e9 poss\u00edvel ligar o VTI ''{0}'', pois ele \u00e9 um VTI de disparo especial e esta instru\u00e7\u00e3o n\u00e3o faz parte de uma a\u00e7\u00e3o de disparo ou cl\u00e1usula WHEN.
42Y46=Lista de propriedades inv\u00e1lidas na lista FROM.  N\u00e3o h\u00e1 nenhum \u00edndice ''{0}'' na tabela ''{1}''.
42Y48=Lista de propriedades inv\u00e1lidas na lista FROM.  N\u00e3o h\u00e1 nenhuma limita\u00e7\u00e3o nomeada ''{0}'' na tabela ''{1}'' ou a limita\u00e7\u00e3o n\u00e3o cont\u00e9m um \u00edndice auxiliar.
42Y49=M\u00faltiplos valores especificados para a chave de propriedade ''{0}''.

42Y50=A lista de propriedades da tabela ''{0}'' pode conter valores de \u00edndice ou de limita\u00e7\u00e3o, mas n\u00e3o ambos.
42Y55=''{0}'' n\u00e3o pode ser executado em ''{1}'' porque ele n\u00e3o existe.
42Y56=joinStrategy inv\u00e1lida, ''{0}'', especificada na lista de propriedades da tabela ''{1}''. Os valores atualmente suportados para joinStrategy s\u00e3o ''hash'', ''nestedloop''.
42Y58=NumberFormatException ocorrida ao converter o valor ''{0}'' para a substitui\u00e7\u00e3o do otimizador ''{1}''.
42Y59=Valor inv\u00e1lido, ''{0}'', especificado para a substitui\u00e7\u00e3o de hashInitialCapacity. O valor deve ser > 0.
42Y60=Valor inv\u00e1lido, ''{0}'', especificado para a substitui\u00e7\u00e3o de hashLoadFactor. O valor deve ser > 0.0 e <= 1.0.
42Y61=Valor inv\u00e1lido, ''{0}'', especificado para a substitui\u00e7\u00e3o de hashMaxCapacity. O valor deve ser > 0.
42Y62=''{0}'' n\u00e3o \u00e9 permitido em ''{1}'' porque ele \u00e9 uma exibi\u00e7\u00e3o.
42Y63=A jun\u00e7\u00e3o de sinais num\u00e9ricos exige um predicado equijoin otimiz\u00e1vel em uma coluna do \u00edndice ou heap selecionado.  Um predicado equijoin otimiz\u00e1vel n\u00e3o existe em nenhuma coluna da tabela ou \u00edndice ''{0}''. Utilize a substitui\u00e7\u00e3o do otimizador de ''\u00edndice'' para especificar um \u00edndice ou heap na tabela ''{1}''.
42Y64=O valor ''{0}'' de bulkFetch \u00e9 inv\u00e1lido: o valor m\u00ednimo para bulkFetch \u00e9 1.
42Y65=bulkFetch n\u00e3o \u00e9 permitido nas jun\u00e7\u00f5es ''{0}''.
42Y66=bulkFetch n\u00e3o \u00e9 permitido em cursores que podem ser atualizados.
42Y67=O esquema ''{0}'' n\u00e3o pode ser eliminado.
42Y69=N\u00e3o foi encontrado nenhum plano de execu\u00e7\u00e3o v\u00e1lido para esta instru\u00e7\u00e3o. Pode ter um dos seguintes motivos: voc\u00ea especificou uma estrat\u00e9gia de jun\u00e7\u00e3o de sinais num\u00e9ricos quando uma jun\u00e7\u00e3o de sinais num\u00e9ricos n\u00e3o era permitida (nenhum equijoin otimiz\u00e1vel) ou voc\u00ea est\u00e1 tentando juntar duas ExternalVirtualTables, uma fazendo refer\u00eancia \u00e0 outra, e, portanto, a instru\u00e7\u00e3o n\u00e3o pode ser avaliada.
42Y70=A ordena\u00e7\u00e3o de jun\u00e7\u00e3o especificada pelo usu\u00e1rio n\u00e3o \u00e9 uma ordena\u00e7\u00e3o de jun\u00e7\u00e3o legal. Isso pode ocorrer porque uma coluna de jun\u00e7\u00e3o de uma tabela interna est\u00e1 sendo transmitida como um par\u00e2metro para uma tabela virtual externa.
42Y71=A fun\u00e7\u00e3o de sistema ou procedimento ''{0}'' n\u00e3o pode ser eliminada.
42Y82=A instru\u00e7\u00e3o preparada armazenada e gerada no sistema ''{0}'' n\u00e3o pode ser eliminada com a INSTRU\u00c7\u00c3O DROP.  Ela faz parte de um disparo.
42Y83=Um nulo sem tipo n\u00e3o \u00e9 permitido como um argumento para a agrega\u00e7\u00e3o {0}.  Especifique um tipo mais adequado para o nulo.
# NOTE: The parameter to this message is a keyword used as a noun phrase.
# Some possible values are "subquery", "CurrentDate", and "?".
42Y84=''{0}'' pode n\u00e3o aparecer em uma defini\u00e7\u00e3o DEFAULT.
42Y85=A palavra-chave DEFAULT \u00e9 permitida apenas em uma cl\u00e1usula VALUES quando VALUES aparece dentro de uma instru\u00e7\u00e3o INSERT.
42Y90=FOR UPDATE n\u00e3o \u00e9 permitida neste tipo de instru\u00e7\u00e3o.
42Y91=A cl\u00e1usula USING n\u00e3o \u00e9 permitida em uma INSTRU\u00c7\u00c3O EXECUTE para uma a\u00e7\u00e3o de disparo.
42Y92=Os disparos {0} podem fazer refer\u00eancia apenas \u00e0s tabelas/vari\u00e1veis de transi\u00e7\u00e3o {1}.
42Y93=Cl\u00e1usula REFERENCING ilegal: \u00e9 permitido apenas um nome para cada tipo de tabela/vari\u00e1vel de transi\u00e7\u00e3o.
42Y94=AND ou OR possui um operando que n\u00e3o \u00e9 booleano. Os operandos de AND e OR devem ser avaliados como TRUE, FALSE ou UNKNOWN.
42Y95=O operador ''{0}'' com um tipo de operando \u00e0 esquerda de ''{1}'' e um tipo de operando \u00e0 direita de ''{2}'' n\u00e3o \u00e9 suportado.
42Y96.U=UNKNOWN
42Y97=Caractere de escape inv\u00e1lido na linha ''{0}'', coluna ''{1}''.
42Y98.U=Encontrado "{0}" na linha {1}, coluna {2}
42Y99.U=Erro lexical na linha {0}, coluna {1}.  Encontrado: {2}
42Z00.U=Chamada de m\u00e9todo Java ou refer\u00eancia de campo
# This message is put into message 42X75 when a parameter doesn't have a
# datatype. For example, from the parameterWidening test:
#
# values (java.lang.Integer::toString(?, null));
# ERROR 42X50: No method was found with the signature
# java.lang.Integer.toString(UNTYPED, UNTYPED).  It may be that the method
# exists, but it is not public and/or static, or that the parameter types
# are not method invocation convertible.
42Z01.U=UNTYPED
42Z02=M\u00faltiplas agrega\u00e7\u00f5es DISTINCT n\u00e3o s\u00e3o suportadas ao mesmo tempo.
42Z07=As agrega\u00e7\u00f5es n\u00e3o s\u00e3o permitidas na cl\u00e1usula ON.
42Z08=A substitui\u00e7\u00e3o em massa da inser\u00e7\u00e3o n\u00e3o \u00e9 permitida em ''{0}'' porque ela possui um disparo ativado ({1}).
42Z09.U=COLUMN DEFAULT para
#
# The following message is used in error messages where we want to say that
# certain operations on streams are illegal. The word "stream" is not a
# keyword or method name, so it should be translated.
42Z11.U=fluxo

# alter table modify column error messages.
#####
42Z15=Tipo Inv\u00e1lido especificado para a coluna ''{0}''. O tipo de uma coluna pode n\u00e3o ser alterado.
42Z16=Apenas colunas do tipo VARCHAR podem ter seus comprimentos alterados. 
42Z17=Comprimento Inv\u00e1lido especificado para a Coluna ''{0}''. O comprimento deve ser maior do que o comprimento da coluna atual
42Z18=A coluna ''{0}'' faz parte de uma limita\u00e7\u00e3o da chave externa ''{1}''. Para alterar o comprimento dessa coluna, \u00e9 preciso eliminar primeiramente a limita\u00e7\u00e3o, executar ALTER TABLE e, em seguida, recriar a limita\u00e7\u00e3o.
42Z19=A coluna ''{0}'' est\u00e1 sendo referida por pelo menos uma limita\u00e7\u00e3o da chave externa ''{1}''. Para alterar o comprimento dessa coluna, \u00e9 preciso eliminar as limita\u00e7\u00f5es que est\u00e3o fazendo refer\u00eancia, executar ALTER TABLE e, em seguida, recriar a limita\u00e7\u00e3o.
42Z20=A coluna ''{0}'' n\u00e3o pode ser anul\u00e1vel. Ela faz parte de uma chave prim\u00e1ria que n\u00e3o pode ter nenhuma coluna anul\u00e1vel.

#####
# end of alter table modify constraints.
# identity error message (from 42Z21-42Z29)
#####
42837=ALTER TABLE ''{0}'' especificou atributos para a coluna ''{1}'' que n\u00e3o s\u00e3o compat\u00edveis com a coluna existente.
42Z21=Incremento inv\u00e1lido especificado para a identidade da coluna ''{0}''. A incrementa\u00e7\u00e3o deve ser diferente de zero.
42Z22=Tipo inv\u00e1lido especificado para a coluna de identidade ''{0}''. OS \u00fanicos tipos v\u00e1lidos para as colunas de identidade s\u00e3o BIGINT, INT e SMALLINT.
42Z23=Tentativa de modificar uma coluna de identidade ''{0}''. 
42Z24=Estouro ocorrido no valor de identidade da coluna ''{1}'' na tabela ''{0}''.
42Z25=ERRO INTERNO Contado de Identidade: Atualiza\u00e7\u00e3o chamada sem argumentos com o valor atual = NULL.
42Z26=Uma coluna ''{0}'' com um padr\u00e3o de identidade n\u00e3o pode ser tornada nula.
42Z27=Uma coluna anul\u00e1vel, ''{0}'', n\u00e3o pode ser modificada para ter a identidade padr\u00e3o.
#####
# end of identity error messages.

42Z30.U=tempo gasto nessa ResultSet =
42Z31.U=tempo gasto nessa ResultSet e abaixo =
42Z32.U=divis\u00e3o total do tempo:

42Z33.U=hor\u00e1rio do construtor (milissegundos) =
42Z34.U=hor\u00e1rio de abertura (milissegundos) =
42Z35.U=pr\u00f3ximo hor\u00e1rio (milissegundos) =
42Z36.U=hor\u00e1rio de encerramento (milissegundos) =
42Z37.U=Nenhum
42Z38.U=As informa\u00e7\u00f5es sobre posicionamento n\u00e3o est\u00e3o dispon\u00edveis porque essa ResultSet nunca foi aberta.
42Z39.U=Exce\u00e7\u00e3o inesperada {0} ao obter o posicionador.
## NOTE: In the following message, {0} will be either >= or >
42Z40.U={0} na(s) primeira(s) {1} coluna(s).
42Z41.U=Sem\u00e2nticas nulas ordenadas nas seguintes colunas:

42Z42.U=ID da coluna
42Z43.U=Operador
42Z44.U=Nulos ordenados
42Z45.U=Valor de retorno desconhecido
42Z46.U=Resultado de compara\u00e7\u00e3o negativo
42Z47.U=A obten\u00e7\u00e3o do plano de consulta como uma Cadeia n\u00e3o \u00e9 atualmente suportada para {0}
## NOTE: In the following message, {0} and {1} are integer indexes into a 2-d array
42Z48.U=Id da coluna [{0}][{1}]

# matches DB2
42939=N\u00e3o \u00e9 poss\u00edvel criar um objeto com o nome de esquema ''{0}''.




42Z50=ERRO INTERNO: N\u00e3o \u00e9 poss\u00edvel gerar um c\u00f3digo para {0}.
42Z53=ERRO INTERNO: N\u00e3o \u00e9 poss\u00edvel definir o tipo de ativa\u00e7\u00e3o que ser\u00e1 gerado para a op\u00e7\u00e3o de n\u00f3 {0}.
42Z54.U=Esta exce\u00e7\u00e3o interrompe a instru\u00e7\u00e3o ap\u00f3s a an\u00e1lise - nenhum outro processo \u00e9 necess\u00e1rio.
42Z55.U=Exce\u00e7\u00e3o interrompida ap\u00f3s a an\u00e1lise pela flag de depura\u00e7\u00e3o StopAfterParsing.
42Z56.U=Exce\u00e7\u00e3o interrompida ap\u00f3s a liga\u00e7\u00e3o pela flag de depura\u00e7\u00e3o StopAfterBinding.
42Z57.U=Exce\u00e7\u00e3o interrompida ap\u00f3s a otimiza\u00e7\u00e3o pela flag de depura\u00e7\u00e3o StopAfterOptimizing.
42Z58.U=Exce\u00e7\u00e3o interrompida ap\u00f3s a gera\u00e7\u00e3o pela flag de depura\u00e7\u00e3o StopAfterGenerating.

## More RUNTIMESTATISTICS messages
42Z80.U=seri\u00e1vel
42Z81.U=leitura consolidada
42Z82.U=exclusivo
42Z83.U=compartilhamento instant\u00e2neo
42Z84.U=compartilhar
42Z85.U=tabela
42Z86.U=linha
42Z87.U=compartilhar tabela
42Z88.U=compartilhar linha

# More generic language stuff
42Z90=A classe ''{0}'' n\u00e3o retorna uma ResultSet atualiz\u00e1vel.
42Z91=subconsulta
42Z92=leitura repet\u00edvel
42Z9A=leitura n\u00e3o consolidada

# Declare global temporary table language stuff. Does not match DB2, specific to Derby behavior
XCL478.S=A fun\u00e7\u00e3o solicitada n\u00e3o pode fazer refer\u00eancia a tabelas no esquema SESSION.
# Declare global temporary table language stuff. Matches DB2
428EK=O qualificador do nome de uma tabela tempor\u00e1ria global declarada deve ser SESSION.
42995=A fun\u00e7\u00e3o solicitada n\u00e3o se aplica a tabelas tempor\u00e1rias globais.
42962=Coluna com tipo de coluna longo ou par\u00e2metro ''{0}'' n\u00e3o s\u00e3o permitidos em tabelas tempor\u00e1rias globais declaradas ou em defini\u00e7\u00f5es de procedimento.

## org.apache.derby.impl.sql.execute.rts
43X00.U=Anexado a
43X01.U=N\u00famero Inicial de Subconsultas
# NOTE: In this case, the name of the type of ResultSet is "Any". ResultSet
# is the name of an interface, so it should not be translated.
43X02.U=ResultSet qualquer
43X03.U=N\u00famero de aberturas
43X04.U=Linhas exibidas
43X05.U=Conjunto de resultados de origem
43X06.U=N\u00famero Final de Subconsultas
43X07.U=contagem de linhas estimadas pelo otimizador
43X08.U=custo estimado pelo otimizador
43X09.U=segundos
43X10.U=Total
43X11.U=N\u00f3
43X12.U={0} n\u00e3o est\u00e1 atualmente implementado para {1}
# NOTE: In this case, the name of the type of ResultSet is "Any". ResultSet
# is the name of an interface, so it should not be translated.
43X13.U=Excluir ResultSet utilizando o
43X14.U=bloqueio de tabelas
43X15.U=bloqueio de linhas
43X16.U=Linhas exclu\u00eddas
43X17.U=deferidas
43X18.U=\u00cdndices atualizados
43X19.U=Excluir
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X20.U=ResultSet de Agrega\u00e7\u00e3o Escalar Distinta
# NOTE: In this message, "input" is being used as a verb
43X21.U=Entrada de linhas
43X22.U=Agrega\u00e7\u00e3o Escalar Distinta
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X23.U=ResultSet de Varredura distinta para {0} utilizando {1} {2}
43X24.U=limita\u00e7\u00e3o
43X25.U=\u00edndice
43X26.U=ResultSet de Varredura Distinta para {0}
#NOTE: In this message, {0} will be something like "serializable" or "read
# committed", and {1} will be something like "share" or "exclusive".
43X27.U=no n\u00edvel de isolamento {0} utilizando o bloqueio {1}
43X28.U=informa\u00e7\u00f5es de varredura
43X29.U=A coluna distinta \u00e9 o n\u00famero de colunas
43X30.U=As colunas distintas s\u00e3o os n\u00fameros de colunas
43X31.U=Tamanho da tabela de sinais num\u00e9ricos
43X32.U=Linhas filtradas
43X33.U=pr\u00f3ximo hor\u00e1rio em milissegundos/linhas
43X34.U=posi\u00e7\u00e3o inicial
43X35.U=posi\u00e7\u00e3o de parada
43X36.U=qualificadores de varredura
#NOTE: The message means the set of qualifiers that filter rows returned
# by the "next" operation, not the set of qualifiers that come next.
43X37.U=pr\u00f3ximos qualificadores
#NOTE: In this message, {0} is a table name and {1} is an index name
43X38.U=em {0} utilizando {1}
43X39.U=Varredura Distinta
43X40.U=Informa\u00e7\u00f5es de Ordena\u00e7\u00e3o
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X41.U=ResultSet de Agrega\u00e7\u00e3o em Grupo
43X42.U=Possui agrega\u00e7\u00e3o distinta
43X43.U=Na seq\u00fc\u00eancia de ordena\u00e7\u00e3o
43X44.U=Agrega\u00e7\u00e3o em Grupo
43X45.U=Jun\u00e7\u00e3o Existente de Sinais Num\u00e9ricos
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X46.U=ResultSet de Jun\u00e7\u00e3o Existente de Sinais Num\u00e9ricos
43X47.U=Jun\u00e7\u00e3o de Sinais Num\u00e9ricos
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X48.U=ResultSet de Jun\u00e7\u00e3o de Sinais Num\u00e9ricos
43X49.U=Jun\u00e7\u00e3o Externa Esquerda de Sinais Num\u00e9ricos
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X50.U=ResultSet de Jun\u00e7\u00e3o Externa Esquerda de Sinais Num\u00e9ricos
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {1} is either "constraint" or "index", {0} is a table name, and {2} is a
# constraint or index name.
43X51.U=ResultSet de Varredura de Sinais Num\u00e9ricos para {0} utilizando {1} {2}
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X52.U=ResultSet de Varredura de Sinais Num\u00e9ricos para {0}
43X53.U=A chave de sinais num\u00e9ricos \u00e9 o n\u00famero de colunas
43X54.U=As chaves de sinais num\u00e9ricos s\u00e3o os n\u00fameros de colunas
43X55.U=Varredura de Sinais Num\u00e9ricos
43X56.U=Subconsultas anexadas
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X57.U=ResultSet da Tabela de Sinais Num\u00e9ricos
43X58.U=Tabela de Sinais Num\u00e9ricos
43X59.U=todos
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43X60.U=Indexar Linha para ResultSet de Linha Base para {0}
43X61.U=Colunas acessadas a partir de heap
#NOTE: {0} is a table name
43X62.U=para {0}
43X63.U=Indexar Linha para Linha Base
43X64.U=modo de inser\u00e7\u00e3o: inser\u00e7\u00e3o em massa
43X65.U=modo de inser\u00e7\u00e3o: normal (n\u00e3o \u00e9 poss\u00edvel executar a inser\u00e7\u00e3o em massa devido a uma tabela cheia)
43X66.U=modo de inser\u00e7\u00e3o: normal
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X67.U=Inserir ResultSet utilizando
43X68.U=Linhas inseridas
43X69.U=Inserir
43X70.U=Jun\u00e7\u00e3o
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43X71.U=ResultSet de Varredura de \u00cdndice de Chaves Mais Recente para {0} utilizando o \u00edndice {1}
43X72.U=no n\u00edvel de isolamento {0} utilizando o bloqueio {1} escolhido pelo otimizador
43X73.U=Varredura de Tabela
43X74.U=Varredura de \u00cdndice
#NOTE: {0} is a table name or class name
43X75.U=em {0}
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X76.U=ResultSet Materializado
43X77.U=tempo de cria\u00e7\u00e3o do aglomerado tempor\u00e1rio (milissegundos)
43X78.U=tempo de busca do aglomerado tempor\u00e1rio (milissegundos)
43X79.U=Linhas vistas da esquerda
43X80.U=Linhas vistas da direita
43X81.U=Linhas retornadas
43X82.U=Conjunto de resultados \u00e0 esquerda
43X83.U=Conjunto de resultados \u00e0 direita
43X84.U=Jun\u00e7\u00e3o Existente de Loops Aninhados
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X85.U=ResultSet de Jun\u00e7\u00e3o Existente de Loops Aninhados
43X86.U=Jun\u00e7\u00e3o de Loops Aninhados
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X87.U=ResultSet de Jun\u00e7\u00e3o de Loops Aninhados
43X88.U=Linhas vazias retornadas \u00e0 direita
43X89.U=Jun\u00e7\u00e3o Externa Esquerda de Loops Aninhados
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X90.U=ResultSet de Jun\u00e7\u00e3o Externa Esquerda de Loops Aninhados
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X91.U=Normalizar ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X92.U=ResultSet \u00danica
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X93.U=ResultSet Restrita ao Projeto
43X94.U=restri\u00e7\u00e3o
43X95.U=proje\u00e7\u00e3o
43X96.U=tempo de restri\u00e7\u00e3o (milissegundos)
43X97.U=tempo de proje\u00e7\u00e3o (milissegundos)
43X98.U=Restrita ao Projeto
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X99.U=ResultSet de Linhas
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y00.U=ResultSet de Agrega\u00e7\u00e3o Escalar
43Y01.U=Otimiza\u00e7\u00e3o da Chave de \u00cdndice
43Y02.U=Agrega\u00e7\u00e3o Escalar
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y03.U=Rolar ResultSet Sem Diferencia\u00e7\u00e3o
43Y04.U=N\u00famero de leituras a partir da tabela de sinais num\u00e9ricos
43Y05.U=N\u00famero de grava\u00e7\u00f5es na tabela de sinais num\u00e9ricos
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y06.U=Ordenar ResultSet
43Y07.U=Eliminar duplica\u00e7\u00f5es
43Y08.U=Ordenar
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name, {1} is either "constraint" or "index", {2} is a
# constraint or index name.
43Y09.U=ResultSet de Varredura de \u00cdndice para {0} utilizando {1} {2}
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43Y10.U=ResultSet de Varredura de Tabelas para {0}
43Y11.U=Bloqueio real utilizado: bloqueio de n\u00edvel de tabela.
43Y12.U=Tamanho da Busca
43Y13.U=qualificadores
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y14.U=ResultSet de Uni\u00e3o
43Y15.U=Uni\u00e3o
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is either "table" or "row"
43Y16.U=Atualizar ResultSet utilizando o bloqueio {0}
43Y17.U=Linhas atualizadas
43Y18.U=Atualizar
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a Java class name.
43Y19.U=ResultSet de VTI para {0}
43Y20.U=VTI
43Y21.U=Subconsultas materializadas
43Y22.U=Nome da Instru\u00e7\u00e3o
43Y23.U=Texto da Instru\u00e7\u00e3o
# NOTE: This means the amount of time it takes to parse
43Y24.U=Tempo de An\u00e1lise
# NOTE: This means the amount of time it takes to bind
43Y25.U=Tempo de Liga\u00e7\u00e3o
# NOTE: This means the amount of time it takes to optimize
43Y26.U=Tempo de Otimiza\u00e7\u00e3o
# NOTE: This means the amount of time it takes to generate
43Y27.U=Tempo de Gera\u00e7\u00e3o
# NOTE: This means the amount of time it takes to compile
43Y28.U=Tempo de Compila\u00e7\u00e3o
# NOTE: This means the amount of time it takes to execute
43Y29.U=Tempo de Execu\u00e7\u00e3o
43Y30.U=Data e Hora Iniciais de Compila\u00e7\u00e3o
43Y31.U=Data e Hora Finais de Compila\u00e7\u00e3o
43Y32.U=Data e Hora Iniciais de Execu\u00e7\u00e3o
43Y33.U=Data e Hora Finais de Execu\u00e7\u00e3o
43Y44.U=Texto de Planejamento de Execu\u00e7\u00e3o de Instru\u00e7\u00e3o
43Y45.U=Executar 100% do Tempo, {0} segundos
43Y46.U=Inserir ResultSet de VTI
43Y47.U=Excluir ResultSet de VTI
43Y49.U=Inserir VTI
43Y50.U=Excluir VTI
43Y51.U=Excluir Cascade ResultSet
43Y52.U=Excluir Cascade ResultSet utilizando
43Y53.U=A\u00e7\u00f5es Referenciais em Tabelas Dependentes
43Y54.U=Come\u00e7ar A\u00e7\u00e3o Referencial em N\u00famero de Tabela Dependente
43Y55.U=Finalizar A\u00e7\u00e3o Referencial em N\u00famero de Tabela Dependente

54004=A instru\u00e7\u00e3o SELECT possui um n\u00famero excessivo de itens em GROUP BY, ORDER BY ou na lista de sele\u00e7\u00e3o.
54008=A instru\u00e7\u00e3o CREATE INDEX especifica muitas colunas (16 \u00e9 o m\u00e1ximo).
54023=O limite do n\u00famero de par\u00e2metros para um procedimento foi excedido. O limite \u00e9 {0} e o n\u00famero de par\u00e2metros para o procedimento {1} \u00e9 {2}.
54038=Profundidade m\u00e1xima excedida para os disparadores aninhados.

## all other org.apache.derby.catalog.types
44X00.U=Nome do Tipo SQL
44X05.U=pr\u00f3ximo erro

X0X02.S=A tabela ''{0}'' n\u00e3o pode ser bloqueada no modo ''{1}''.
X0X03.S=Estado de transa\u00e7\u00e3o inv\u00e1lido - o cursor suspenso requer o mesmo n\u00edvel de isolamento
X0X05.S=A tabela ''{0}'' n\u00e3o existe.
X0X0E.S=Posi\u00e7\u00e3o de coluna ''{0}'' listada na matriz de sele\u00e7\u00e3o de coluna autogerada n\u00e3o encontrada na tabela de inser\u00e7\u00e3o.
X0X0F.S=Nome de coluna ''{0}'' listado na matriz de sele\u00e7\u00e3o de coluna autogerada n\u00e3o encontrada na tabela de inser\u00e7\u00e3o.
X0X07.S=N\u00e3o \u00e9 poss\u00edvel eliminar o arquivo jar ''{0}'' porque ele est\u00e1 no db2j.database.classpath ''{0}''.
X0X10.S=A cl\u00e1usula USING retornou mais de uma linha, s\u00e3o permitidas apenas ResultSets de linhas \u00fanicas.
X0X11.S=A cl\u00e1usula USING n\u00e3o retornou nenhum resultado, nenhum par\u00e2metro pode ser definido.
X0X13.S=O arquivo jar ''{0}'' n\u00e3o existe no esquema ''{1}''.
X0X57.S=Houve uma tentativa de colocar um valor Java do tipo ''{0}'' em um valor SQL, mas n\u00e3o h\u00e1 nenhum tipo SQL correspondente.  O valor Java provavelmente \u00e9 o resultado de uma chamada de m\u00e9todo ou acesso de campo.
X0X60.S=J\u00e1 existe um cursor com o nome ''{0}''.
X0X61.S=Os valores da coluna ''{4}'' no \u00edndice ''{0}'' e na tabela ''{1}.{2}'' n\u00e3o correspondem \u00e0 localiza\u00e7\u00e3o de linhas {3}.  O valor no \u00edndice \u00e9 ''{5}'', enquanto na tabela base \u00e9 ''{6}''.  A chave completa do \u00edndice, incluindo a localiza\u00e7\u00e3o da linha, \u00e9 ''{7}''.   A a\u00e7\u00e3o de corre\u00e7\u00e3o sugerida \u00e9 a recria\u00e7\u00e3o do \u00edndice.
X0X62.S=Inconsist\u00eancia encontrada entre a tabela ''{0}'' e o \u00edndice ''{1}''.  Erro ao tentar recuperar a localiza\u00e7\u00e3o da linha ''{2}'' a partir da tabela.  A chave completa do \u00edndice, incluindo a localiza\u00e7\u00e3o da linha, \u00e9 ''{3}''. A a\u00e7\u00e3o de corre\u00e7\u00e3o sugerida \u00e9 a recria\u00e7\u00e3o do \u00edndice.
X0X63.S=Obtida IOException ''{0}''.
X0X67.S=As colunas do tipo ''{0}'' podem n\u00e3o ser utilizadas em CREATE INDEX, ORDER BY, GROUP BY, UNION ou DISTINCT, pois n\u00e3o s\u00e3o suportadas compara\u00e7\u00f5es para esse tipo.
X0X81.S={0} ''{1}'' n\u00e3o existe.
X0X85.S=O \u00edndice ''{0}'' n\u00e3o foi criado porque ''{1}'' n\u00e3o \u00e9 um tipo v\u00e1lido de \u00edndice.
X0X86.S=0 \u00e9 um valor de par\u00e2metro inv\u00e1lido para ResultSet.absolute(int row).
X0X87.S=ResultSet.relative(int row) n\u00e3o pode ser chamado quando o cursor n\u00e3o estiver posicionado em uma linha.
X0X95.S=A opera\u00e7\u00e3o ''{0}'' n\u00e3o pode ser executada no objeto ''{1}'', pois h\u00e1 uma ResultSet aberta, dependente desse objeto.
X0X99.S=O \u00edndice ''{0}'' n\u00e3o existe.
X0Y16.S=''{0}'' n\u00e3o \u00e9 uma exibi\u00e7\u00e3o.  Se for uma tabela, utilize DROP TABLE.
X0Y23.S=A opera\u00e7\u00e3o ''{0}'' n\u00e3o pode ser executada no objeto ''{1}'', pois VIEW ''{2}'' \u00e9 dependente desse objeto.
X0Y24.S=A opera\u00e7\u00e3o ''{0}'' n\u00e3o pode ser executada no objeto ''{1}'', pois STATEMENT ''{2}'' \u00e9 dependente desse objeto.
X0Y25.S=A opera\u00e7\u00e3o ''{0}'' n\u00e3o pode ser executada no objeto ''{1}'', pois {2} ''{3}'' \u00e9 dependente desse objeto.
X0Y26.S=Exige-se que o \u00edndice ''{0}'' esteja no mesmo esquema da tabela ''{1}''.
X0Y28.S=O \u00edndice ''{0}'' n\u00e3o pode ser criado na tabela do sistema ''{1}''.  Os usu\u00e1rios n\u00e3o podem criar \u00edndices nas tabelas do sistema.
# column c already exists in table t.
X0Y32.S={0} ''{1}'' j\u00e1 existe em {2} ''{3}''.
X0Y38.S=N\u00e3o \u00e9 poss\u00edvel criar o \u00edndice ''{0}'', pois a tabela ''{1}'' n\u00e3o existe.
X0Y41.S=A limita\u00e7\u00e3o ''{0}'' \u00e9 inv\u00e1lida: a tabela referida {1} n\u00e3o possui nenhuma chave prim\u00e1ria.  Inclua uma chave prim\u00e1ria em {1} ou especifique explicitamente as colunas de uma limita\u00e7\u00e3o exclusiva \u00e0s quais essa chave externa faz refer\u00eancia.
X0Y42.S=A limita\u00e7\u00e3o ''{0}'' \u00e9 inv\u00e1lida: os tipos de colunas da chave externa n\u00e3o correspondem aos tipos das colunas referenciadas.
X0Y43.S=A limita\u00e7\u00e3o ''{0}'' \u00e9 inv\u00e1lida: o n\u00famero de colunas em {0} ({1}) n\u00e3o corresponde ao n\u00famero de colunas na chave referida ({2}).
X0Y44.S=A limita\u00e7\u00e3o ''{0}'' \u00e9 inv\u00e1lida: n\u00e3o h\u00e1 nenhuma limita\u00e7\u00e3o de chave prim\u00e1ria ou exclusiva na tabela ''{1}'' que corresponda ao n\u00famero e aos tipos de colunas na chave externa.
X0Y45.S=A limita\u00e7\u00e3o de chave externa ''{0}'' n\u00e3o pode ser inclu\u00edda ou ativada na tabela {1},  pois uma ou mais chaves externas n\u00e3o possuem refer\u00eancias a chaves correspondentes.
X0Y46.S=A limita\u00e7\u00e3o ''{0}'' \u00e9 inv\u00e1lida: a tabela referida {1} n\u00e3o existe.
X0Y54.S=O esquema ''{0}'' n\u00e3o pode ser eliminado porque ele n\u00e3o est\u00e1 vazio.
X0Y55.S=O n\u00famero de linhas da tabela base n\u00e3o corresponde ao n\u00famero de linhas em pelo menos um dos \u00edndices da tabela. O \u00edndice ''{0}'' na tabela ''{1}.{2}'' possui {3} linhas, mas a tabela base possui {4} linhas.   A a\u00e7\u00e3o de corre\u00e7\u00e3o sugerida \u00e9 a recria\u00e7\u00e3o do \u00edndice.
X0Y56.S=''{0}'' n\u00e3o \u00e9 permitido na tabela do sistema ''{1}''.
X0Y57.S=Uma coluna n\u00e3o anul\u00e1vel n\u00e3o pode ser inclu\u00edda na tabela ''{0}'', pois a tabela cont\u00e9m pelo menos uma linha.  Colunas n\u00e3o anul\u00e1veis s\u00f3 podem ser inclu\u00eddas em tabelas vazias.
X0Y58.S=A tentativa de incluir uma limita\u00e7\u00e3o de chave prim\u00e1ria \u00e0 tabela ''{0}'' falhou porque a tabela j\u00e1 tem uma limita\u00e7\u00e3o desse tipo. Uma tabela pode ter uma \u00fanica limita\u00e7\u00e3o de chave prim\u00e1ria.
X0Y59.S=A tentativa de incluir ou ativar a(s) limita\u00e7\u00e3o(\u00f5es) na tabela ''{1}'' falhou porque a tabela cont\u00e9m {2} linha(s) que violam a(s) seguinte(s) limita\u00e7\u00e3o(\u00f5es) de verifica\u00e7\u00e3o: {0}.
X0Y63.S=O comando na tabela ''{0}'' falhou. Foram encontrados dados nulos na chave prim\u00e1ria ou na(s) coluna(s) de \u00edndice/limita\u00e7\u00f5es exclusivas. Todas as colunas em uma chave prim\u00e1ria ou exclusiva n\u00e3o devem ser anul\u00e1veis.
X0Y66.S=N\u00e3o \u00e9 poss\u00edvel emitir a consolida\u00e7\u00e3o em uma conex\u00e3o aninhada quando houver uma opera\u00e7\u00e3o pendente na conex\u00e3o pai.
X0Y67.S=N\u00e3o \u00e9 poss\u00edvel emitir a a\u00e7\u00e3o de revers\u00e3o em uma conex\u00e3o aninhada quando houver uma opera\u00e7\u00e3o pendente na conex\u00e3o pai.
X0Y68.S={0} ''{1}'' j\u00e1 existe.
X0Y69.S={1} n\u00e3o \u00e9 permitido porque o disparo {0} est\u00e1 ativo em {2}.
X0Y70.S=INSERT, UPDATE e DELETE n\u00e3o s\u00e3o permitidos na tabela {1} porque o disparo {0} est\u00e1 ativo.
X0Y71.S=A manipula\u00e7\u00e3o da transa\u00e7\u00e3o, como SET ISOLATION, n\u00e3o \u00e9 permitida pois o disparador {0} est\u00e1 ativo.
X0Y72.S=A substitui\u00e7\u00e3o em massa da inser\u00e7\u00e3o n\u00e3o \u00e9 permitida em ''{0}'' porque ela possui um disparo ativado ({1}).
X0Y77.S=N\u00e3o \u00e9 poss\u00edvel emitir a a\u00e7\u00e3o de defini\u00e7\u00e3o da instru\u00e7\u00e3o de isolamento de transa\u00e7\u00e3o em uma transa\u00e7\u00e3o global que esteja em andamento, pois ela consolidaria implicitamente a transa\u00e7\u00e3o global.

X0Y78.S=Statement.executeQuery() n\u00e3o pode ser chamado com uma instru\u00e7\u00e3o que retorna uma contagem de linha.
X0Y79.S=Statement.executeUpdate() n\u00e3o pode ser chamado com uma instru\u00e7\u00e3o que retorna uma ResultSet.
X0Y80.S=Falha na tabela ALTER ''{0}''. Encontrados dados nulos na coluna ''{1}''.
X0Y83.S=AVISO: Durante a exclus\u00e3o de uma linha de uma tabela, a linha de \u00edndice da linha da tabela base {0} n\u00e3o foi encontrada no \u00edndice com o id aglomerado {1}.  Esse problema foi automaticamente corrigido como parte da opera\u00e7\u00e3o de exclus\u00e3o.
XCL01.S=O resultado n\u00e3o retorna linhas; opera\u00e7\u00e3o {0} n\u00e3o permitida.
XCL05.S=Ativa\u00e7\u00e3o encerrada, opera\u00e7\u00e3o {0} n\u00e3o permitida.
XCL07.S=O cursor ''{0}'' est\u00e1 fechado. Verifique se a execu\u00e7\u00e3o autom\u00e1tica est\u00e1 DESATIVADA.
XCL08.S=O cursor ''{0}'' n\u00e3o est\u00e1 em uma linha.
XCL09.S=Uma ativa\u00e7\u00e3o foi transmitida ao m\u00e9todo ''{0}'' que n\u00e3o corresponde a PreparedStatement.
XCL10.S=PreparedStatement foi recompilado e os par\u00e2metros foram alterados.  Se estiver utilizando o JDBC, \u00e9 necess\u00e1rio preparar a instru\u00e7\u00e3o novamente.
XCL12.S=Houve uma tentativa de colocar um valor de dados do tipo ''{0}'' em um valor de dados do tipo ''{1}''.
XCL13.S=A posi\u00e7\u00e3o do par\u00e2metro ''{0}'' est\u00e1 fora da faixa.  O n\u00famero de par\u00e2metros dessa instru\u00e7\u00e3o preparada \u00e9 ''{1}''.
XCL15.S=ClassCastException ocorrida ao chamar o m\u00e9todo compareTo() em um objeto ''{0}''.  O par\u00e2metro para compareTo() \u00e9 da classe ''{1}''.
XCL16.S=ResultSet fechada, opera\u00e7\u00e3o ''{0}'' n\u00e3o permitida. Verifique se a execu\u00e7\u00e3o autom\u00e1tica est\u00e1 DESATIVADA.
XCL17.S=Instru\u00e7\u00e3o n\u00e3o permitida nesse banco de dados.
XCL19.S=Linha ausente na tabela ''{0}'' para a chave ''{1}''.
XCL20.S=Os cat\u00e1logos no n\u00edvel da vers\u00e3o ''{0}'' n\u00e3o podem ser atualizados para o n\u00edvel da vers\u00e3o ''{1}''.
XCL21.S=Voc\u00ea est\u00e1 tentando executar uma instru\u00e7\u00e3o de defini\u00e7\u00e3o de dados (CREATE, DROP ou ALTER) durante a prepara\u00e7\u00e3o de uma instru\u00e7\u00e3o diferente. Isso n\u00e3o \u00e9 permitido. Isso pode ocorrer se voc\u00ea executar uma instru\u00e7\u00e3o de defini\u00e7\u00e3o de dados de dentro de um inicializador est\u00e1tico de uma classe Java que est\u00e1 sendo utilizada de dentro de uma instru\u00e7\u00e3o SQL.
XCL22.S=O par\u00e2metro {0} n\u00e3o pode ser registrado como um par\u00e2metro OUT porque ele \u00e9 um par\u00e2metro IN.
XCL23.S=O n\u00famero do tipo SQL ''{0}'' n\u00e3o \u00e9 um tipo suportado por registerOutParameter().
XCL24.S=O par\u00e2metro {0} parece ser um par\u00e2metro de sa\u00edda, mas ele n\u00e3o foi designado por registerOutParameter().  Se ele n\u00e3o for um par\u00e2metro de sa\u00edda, ele dever\u00e1 ser definido como tipo {1}.
XCL25.S=O par\u00e2metro {0} n\u00e3o pode ser registrado para ser do tipo {1} porque ele faz mapeamentos para o tipo {2} e eles s\u00e3o incompat\u00edveis.
XCL26.S=O par\u00e2metro {0} n\u00e3o \u00e9 um par\u00e2metro de sa\u00edda.
XCL27.S=Os par\u00e2metros de sa\u00edda retornados n\u00e3o podem ser definidos.
XCL30.S=IOException foi lan\u00e7ada ao ler um ''{0}'' de um InputStream.
XCL31.S=Instru\u00e7\u00e3o encerrada.

# Delete Rule Restrictions Violation Messages
XCL33.S=A tabela n\u00e3o pode ser definida como dependente da tabela {0} devido a restri\u00e7\u00f5es da regra de exclus\u00e3o. (O relacionamento \u00e9 auto-referenci\u00e1vel e um relacionamento auto-referenci\u00e1vel j\u00e1 existe na regra de exclus\u00e3o SET NULL.) 
XCL34.S=A tabela n\u00e3o pode ser definida como dependente da tabela {0} devido a restri\u00e7\u00f5es da regra de exclus\u00e3o. (O relacionamento forma um ciclo de duas ou mais tabelas que fazem com que a tabela seja exclu\u00edda-conectada a si mesma (todas as outras regras de exclus\u00e3o no ciclo seriam CASCADE)). 
XCL35.S=A tabela n\u00e3o pode ser definida como dependente da tabela {0} devido a restri\u00e7\u00f5es da regra de exclus\u00e3o. (O relacionamento faz com que a tabela seja exclu\u00edda-conectada \u00e0 tabela indicada atrav\u00e9s de diversos relacionamentos e a regra de exclus\u00e3o do relacionamento existente seja SET NULL.). 

XCL36.S=a regra de exclus\u00e3o da chave externa ser {0}. (A restri\u00e7\u00e3o referencial \u00e9 auto-referenci\u00e1vel e uma restri\u00e7\u00e3o auto-referenci\u00e1vel existente cont\u00e9m a regra de exclus\u00e3o indicada (NO ACTION, RESTRICT ou CASCADE).) 
XCL37.S=a regra de exclus\u00e3o da chave externa ser {0}. (A restri\u00e7\u00e3o referencial \u00e9 auto-referenci\u00e1vel e a tabela depende de um relacionamento com uma regra de exclus\u00e3o de CASCADE.)
XCL38.S=a regra de exclus\u00e3o da chave externa ser {0}. (O relacionamento faria com que a tabela fosse exclu\u00edda-conectada \u00e0 mesma tabela atrav\u00e9s de diversos relacionamentos e tais relacionamentos devem ter a mesma regra de exclus\u00e3o (NO ACTION, RESTRICT ou CASCADE).) 

XCL39.S=a regra de exclus\u00e3o da chave externa n\u00e3o pode ser CASCADE. (Existe uma restri\u00e7\u00e3o auto-referenci\u00e1vel com uma regra de exclus\u00e3o SET NULL, NO ACTION ou RESTRICT.) 
XCL40.S=a regra de exclus\u00e3o da chave externa n\u00e3o pode ser CASCADE. (O relacionamento formaria um ciclo que faria com que a tabela fosse exclu\u00edda-conectada a si mesma. Uma das regras de exclus\u00e3o existentes no ciclo n\u00e3o \u00e9 CASCADE, portanto esse relacionamento pode ser defin\u00edvel se a regra de exclus\u00e3o n\u00e3o for CASCADE.) 
XCL41.S=a regra de exclus\u00e3o da chave externa n\u00e3o pode ser CASCADE. (O relacionamento faria com que outra tabela fosse exclu\u00edda-conectada \u00e0 mesma tabela atrav\u00e9s de diversos caminhos com diferentes regras de exclus\u00e3o ou com a regra de exclus\u00e3o igual a SET NULL.) 
XCL42.S="CASCADE"
XCL43.S="SET NULL"
XCL44.S="RESTRICT"
XCL45.S="NO ACTION"
XCL46.S="SET DEFAULT"

XCL47.S=O uso de ''{0}'' requer o upgrade do banco de dados da vers\u00e3o {1} para a vers\u00e3o {2} ou posterior.

XCL48.S= TRUNCATE TABLE n\u00e3o \u00e9 permitida em ''{0}'' porque restri\u00e7\u00f5es de chave exclusiva/principal nessa tabela s\u00e3o referidas por restri\u00e7\u00f5es de chave externa ativadas de outras tabelas.
XCL49.S= TRUNCATE TABLE n\u00e3o \u00e9 permitida em ''{0}'' porque ela possui um acionador DELETE ativado ({1}).
XCL50.S=O upgrade do banco de dados a partir de uma vers\u00e3o anterior n\u00e3o \u00e9 suportado. O banco de dados acessado est\u00e1 no n\u00edvel de vers\u00e3o ''{0}'' - este software est\u00e1 no n\u00edvel de vers\u00e3o ''{1}''.


# Transaction states, matches DB2
25000=Estado inv\u00e1lido de transa\u00e7\u00e3o.

# Authorization
25501=N\u00e3o \u00e9 poss\u00edvel definir a propriedade da conex\u00e3o como somente leitura em uma transa\u00e7\u00e3o ativa.
25502=Uma altera\u00e7\u00e3o nos dados SQL n\u00e3o \u00e9 permitida para um banco de dados, usu\u00e1rio ou conex\u00e3o somente leitura.
25503=A DDL n\u00e3o \u00e9 permitida em um banco de dados, usu\u00e1rio ou conex\u00e3o somente leitura.
25505=Um usu\u00e1rio somente leitura ou um usu\u00e1rio em um banco de dados somente leitura n\u00e3o pode desativar o modo somente leitura em uma conex\u00e3o.
28501=Propriedade de autoriza\u00e7\u00e3o de banco de dados inv\u00e1lida ''{0}={1}''.
28502.C=O nome do usu\u00e1rio ''{0}'' n\u00e3o \u00e9 v\u00e1lido. 
28503=O(s) usu\u00e1rio(s) ''{0}'' n\u00e3o deve(m) estar nas listas de autoriza\u00e7\u00f5es de acesso completo e somente leitura.
28504=Usu\u00e1rio(s) repetido(s) ''{1}'' na lista de acesso ''{0}'';
04501.C=Conex\u00e3o ao banco de dados recusada.


# Dependency Manager
XD003.S=N\u00e3o \u00e9 poss\u00edvel restaurar a depend\u00eancia do disco. DependableFinder = ''{0}''. Informa\u00e7\u00f5es adicionais: ''{1}''.
XD004.S=N\u00e3o \u00e9 poss\u00edvel armazenar depend\u00eancias.


#../java/com/ibm/db2j/impl/Connectivity/JDBC/Local/messages.properties
24000=Estado do cursor inv\u00e1lido - nenhuma linha atual.

07000=Pelo menos um par\u00e2metro n\u00e3o pode ser inicializado para a instru\u00e7\u00e3o atual.

# 07004 : {0} is an number {1) is fixed text OUT or INOUT
07004=O par\u00e2metro {0} \u00e9 um par\u00e2metro de procedimento {1} e deve ser registrado com CallableStatement.registerOutParameter antes da execu\u00e7\u00e3o.

07009=Nenhum par\u00e2metro de entrada.

S0022=A coluna ''{0}'' n\u00e3o foi encontrada.
XJ009.S=O uso do CallableStatement requerido para chamada de procedimento armazenado ou uso de par\u00e2metros de sa\u00edda: {0}
XJ010.S=N\u00e3o \u00e9 poss\u00edvel emitir savepoint quando o autoCommit est\u00e1 ativo.
XJ011.S=N\u00e3o \u00e9 poss\u00edvel transmitir nulo para o nome do savepoint.
XJ012.S=''{0}'' j\u00e1 est\u00e1 fechado.
XJ013.S=Nenhum ID para savepoints nomeados.
XJ014.S=Nenhum nome para savepoints n\u00e3o nomeados.
XJ016.S=O m\u00e9todo ''{0}'' n\u00e3o \u00e9 permitido na instru\u00e7\u00e3o preparada.
XJ017.S=Nenhum comando de savepoint permitido dentro do c\u00f3digo de acionador.
XJ018.S=O nome da coluna n\u00e3o pode ser nulo.
XJ020.S=Tipo de objeto que n\u00e3o pode ser convertido para o TIPO ''{0}'', valor de java.sql.Types era inv\u00e1lido ou o objeto era nulo.
XJ022.S=N\u00e3o \u00e9 poss\u00edvel definir o fluxo: ''{0}''.
XJ023.S=Fluxo de entrada cont\u00e9m menos dados do que o comprimento solicitado.
XJ025.S=O fluxo de entrada n\u00e3o pode ter comprimento negativo.
XJ030.S=N\u00e3o \u00e9 poss\u00edvel definir AUTOCOMMIT ON durante uma conex\u00e3o aninhada.
XJ042.S=''{0}'' n\u00e3o \u00e9 um valor v\u00e1lido para a propriedade ''{1}''.
XJ044.S=''{0}'' \u00e9 uma escala inv\u00e1lida.
XJ045.S=N\u00edvel de isolamento (atualmente) n\u00e3o suportado ou inv\u00e1lido, ''{0}'', transmitido para Connection.setTransactionIsolationLevel(). Os valores atualmente suportados s\u00e3o java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED e java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
XJ04B.S=O batch n\u00e3o pode conter um comando que tenta retornar um conjunto de resultados.
XJ04C.S=O batch CallableStatement n\u00e3o pode conter par\u00e2metros de sa\u00edda.
XJ056.S=N\u00e3o \u00e9 poss\u00edvel definir AUTOCOMMIT ON durante uma conex\u00e3o XA.
XJ057.S=N\u00e3o \u00e9 poss\u00edvel executar uma transa\u00e7\u00e3o global utilizando a conex\u00e3o, o processo de execu\u00e7\u00e3o deve continuar na interface XAResource.
XJ058.S=N\u00e3o \u00e9 poss\u00edvel reverter uma transa\u00e7\u00e3o global utilizando a conex\u00e3o, o processo de execu\u00e7\u00e3o deve continuar na interface XAResource.
XJ059.S=N\u00e3o \u00e9 poss\u00edvel fechar uma conex\u00e3o enquanto uma transa\u00e7\u00e3o global ainda estiver ativa.
XJ05C.S=N\u00e3o \u00e9 poss\u00edvel definir a capacidade de reten\u00e7\u00e3o do ResultSet.HOLD_CURSORS_OVER_COMMIT para uma transa\u00e7\u00e3o global.
XJ061.S=O m\u00e9todo ''{0}'' \u00e9 permitido apenas nos cursores de rolagem.
XJ062.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para ResultSet.setFetchSize(int rows).
XJ063.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para Statement.setMaxRows(int maxRows).  O valor do par\u00e2metro deve ser >= 0.
XJ064.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para setFetchDirection(int direction).
XJ065.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para Statement.setFetchSize(int rows).
XJ066.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para Statement.setMaxFieldSize(int max).
XJ067.S=O ponteiro de texto SQL \u00e9 nulo.
XJ068.S=Somente executeBatch e clearBatch s\u00e3o permitidos no meio de um batch.
XJ069.S=Nenhum m\u00e9todo SetXXX \u00e9 permitido em caso de Utiliza\u00e7\u00e3o de Instru\u00e7\u00e3o de Execu\u00e7\u00e3o.
XJ080.S=A Utiliza\u00e7\u00e3o de Instru\u00e7\u00e3o de Execu\u00e7\u00e3o transmitiu {0} par\u00e2metros em vez de {1}.
XJ070.S=Argumento com posicionamento negativo ou sem posicionamento ''{0}'' transmitido em um m\u00e9todo Blob ou Clob.
XJ071.S=Argumento com comprimento negativo ou sem comprimento ''{0}'' transmitido em um m\u00e9todo Blob ou Clob.
XJ072.S=Padr\u00e3o nulo ou searchStr transmitido em um m\u00e9todo Blob ou Clob com posicionamento.
XJ073.S=Os dados nesse m\u00e9todo Blob ou Clob n\u00e3o est\u00e3o mais dispon\u00edveis. Raz\u00f5es poss\u00edveis s\u00e3o: sua transa\u00e7\u00e3o foi executada ou sua conex\u00e3o foi fechada.
XJ076.S=O argumento de posicionamento ''{0}'' excede o tamanho de Blob/Clob.
XJ077.S=Exce\u00e7\u00e3o obtida ao tentar ler o primeiro byte/caractere do padr\u00e3o Blob/Clob utilizando getBytes/getSubString.
XJ082.U=Valores de BLOB/CLOB n\u00e3o s\u00e3o permitidos como par\u00e2metros ou receptores de m\u00e9todos.

0A000.S=Recurso n\u00e3o implementado: {0}.

XJ004.C=Banco de dados ''{0}'' n\u00e3o encontrado.
08004=Conex\u00e3o recusada : {0}
A020=Autentica\u00e7\u00e3o inv\u00e1lida.
08003=Nenhuma conex\u00e3o atual.
XJ028.C=O URL ''{0}'' n\u00e3o est\u00e1 no formato correto.
XJ040.C=Falha ao iniciar o banco de dados ''{0}''. Consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
XJ041.C=Falha ao criar o banco de dados ''{0}''. Consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
XJ049.C=Conflito entre atributos de cria\u00e7\u00e3o especificados.
XJ081.C=Atributos create/restore/recovery conflitantes foram especificados.
XJ05B.C=O atributo JDBC ''{0}'' possui um valor inv\u00e1lido ''{1}''. Os valores v\u00e1lidos s\u00e3o ''{2}''.

XXXXX.C.6=Encerramento normal da sess\u00e3o do banco de dados.

08006.D=Encerramento do banco de dados ''{0}''.

XJ015.M=Encerramento do sistema Derby.

01J01=O banco de dados ''{0}'' n\u00e3o foi criado, foi feita a conex\u00e3o com um banco de dados existente.
01J02=Cursores sens\u00edveis \u00e0 rolagem n\u00e3o est\u00e3o atualmente implementados.
01J03=ResultSets atualiz\u00e1veis n\u00e3o est\u00e3o atualmente implementadas.
01J04=A classe ''{0}'' da coluna ''{1}'' n\u00e3o implementa java.io.Serializable ou java.sql.SQLData. As inst\u00e2ncias devem implementar uma dessas interfaces para permitir que elas sejam armazenadas.
01J05=\u00caxito no upgrade do banco de dados. O banco de dados cujo upgrade foi executado est\u00e1 pronto para ser utilizado. Falha na revalida\u00e7\u00e3o das instru\u00e7\u00f5es preparadas armazenadas. Consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes sobre a falha. 
XJ001.U=Exce\u00e7\u00e3o Java: ''{1}: {0}''.
XJ050.U=O banco de dados requer upgrade da vers\u00e3o {0}, defina o atributo ''upgrade=true'' no URL da conex\u00e3o JDBC para permitir o upgrade para a vers\u00e3o {1}.


# org.apache.derby.database.UserUtility
#
XCZ00.S=Permiss\u00e3o desconhecida ''{0}''.
XCZ01.S=Usu\u00e1rio desconhecido ''{0}''.
XCZ02.S=Par\u00e2metro inv\u00e1lido ''{0}''=''{1}''.

# SQL J Jar support
46001=Exce\u00e7\u00e3o ocorrida ao acessar o arquivo jar utilizando a URL ''{0}''.

###############################################################################
#
# Text for non-exception strings
#
###############################################################################

# Log
L001=------------  INICIAR MENSAGEM DE ERRO -------------\n
L002=------------  FINALIZAR MENSAGEM DE ERRO -------------\n
L003=\n------------  INICIAR PILHA DE ERROS DE ENCERRAMENTO -------------\n
L004=\n------------  FINALIZAR PILHA DE ERROS DE ENCERRAMENTO -------------\n
L005=\n------------  INICIAR PILHA DE ERROS -------------\n
L006=\n------------  FINALIZAR PILHA DE ERROS -------------\n
L007=AVISO: Arquivo de log n\u00e3o encontrado, criando novo log. Poss\u00edvel inconsist\u00eancia no banco de dados
L008=Excluindo Logfile antigo incompat\u00edvel {0}
L009=Excluindo Logfile antigo {0}
L010=Registro de log incompleto detectado no arquivo {0} removendo arquivo de log da posi\u00e7\u00e3o {1} para eof em {2}.
L011=O daemon do ponto de verifica\u00e7\u00e3o obteve uma exce\u00e7\u00e3o padr\u00e3o
L012=o registro de log N\u00e3o \u00e9 o primeiro, mas a transa\u00e7\u00e3o n\u00e3o est\u00e1 na tabela de transa\u00e7\u00e3o : {0}
L013=o registro de log \u00e9 o primeiro, mas a transa\u00e7\u00e3o j\u00e1 est\u00e1 na tabela de transa\u00e7\u00e3o : {0}
L014=Inst\u00e2ncia inicial incorreta
L015=existe um novo arquivo de log e ele n\u00e3o pode ser exclu\u00eddo {0}
L016=n\u00e3o \u00e9 poss\u00edvel criar um novo arquivo de log {0}
L017=n\u00e3o \u00e9 poss\u00edvel criar um novo arquivo de log {0} devido a {1}
L018=O sistema pode estar em um estado inconsistente, arquivo {0} ausente

# Class Manager
C000=Classe {0}  gravada para o arquivo {1}. Forne\u00e7a suporte com o arquivo e com as seguintes informa\u00e7\u00f5es de exce\u00e7\u00e3o: {2}
C001=A classe {0} tem um tipo de certificado desconhecido no jar {1}, exceto o certificado X509.
C002=Exce\u00e7\u00e3o de seguran\u00e7a lan\u00e7ada ao acessar a classe {0} no jar {1} : {2}
C003=Exce\u00e7\u00e3o ao carregar jar {0} - {1} do banco de dados
C004=Carregador de classe stale para classe {0}
C005=Carregador de Classes do Banco de Dados iniciado - derby.database.classpath=''{0}''
C006={0} carregado a partir do jar {1} do banco de dados
C007=Exce\u00e7\u00e3o ao carregar a classe {0} a partir do jar {1} - {2}

# RawStore Data

D001=:\n Reinicializando a vers\u00e3o {0} do Derby: inst\u00e2ncia {1}\nno diret\u00f3rio de banco de dados {2} \n
D002=:\nEncerrando a inst\u00e2ncia {0}
D004=Backup iniciado para o banco de dados localizado em {0}
D005=backup antigo movido de {0} para {1}
D006=diret\u00f3rio de banco de dados copiado de {0} para {1}
D007=banco de dados service.properties editado para utilizar o dispositivo de log padr\u00e3o
D008=erro ao editar o banco de dados service.properties, backup interrompido: {0}
D009=diret\u00f3rio de log copiado de {0} para {1}
D010=Backup interrompido devido a um erro
D011=backup antigo removido em {0}
D012=Backup conclu\u00eddo, inst\u00e2ncia de log em {0} \n

# Connectivity 
J004=identidade do banco de dados
J005=encerrar Derby
J007=criar banco de dados
J008=nenhum detalhe
J010=criptografar banco de dados no disco
J013=fazer upgrade do banco de dados
J016=provedor de servi\u00e7os criptografados
J017=algoritmo criptografado
J018=comprimento de chave criptografada
J019=chave externa criptografada
J020=chave secreta criptografada
J021=territ\u00f3rio do banco de dados
J022=nome do usu\u00e1rio
J023=senha do usu\u00e1rio
J025=registrar caminho do diret\u00f3rio
J028=caminho de backup para recupera\u00e7\u00e3o de avan\u00e7o
J100=Imposs\u00edvel localizar a classe de servidor de rede, {0}. Seu caminho de classe deve conter csnet.jar.
J101=Imposs\u00edvel carregar a classe de servidor de rede, {0}. {1}  Verifique a integridade de seu arquivo csnet.jar.
J102=Uma exce\u00e7\u00e3o foi lan\u00e7ada durante a inicializa\u00e7\u00e3o do servidor de rede. {0}
J103=Uma exce\u00e7\u00e3o foi lan\u00e7ada durante o encerramento do servidor de rede. {0}

# Authentication
A001=FATAL: N\u00e3o h\u00e1 nenhum Servi\u00e7o de Autentica\u00e7\u00e3o para o sistema
A002=FATAL: N\u00e3o h\u00e1 nenhum Servi\u00e7o de Autentica\u00e7\u00e3o para o banco de dados
A011=AVISO: Nenhum nome de Host/Servidor LDAP mencionado na propriedade {0}; assumindo localhost:389

I015=org.apache.derby.jdbc.EmbeddedDriver n\u00e3o est\u00e1 registrado com o gerenciador do driver JDBC
I024=O banco de dados n\u00e3o est\u00e1 dispon\u00edvel
I025=O driver JDBC n\u00e3o est\u00e1 dispon\u00edvel

# Import/Export
XIE01.S=A conex\u00e3o era nula.
XIE03.S=Dados encontrados na linha {0} da coluna {1} ap\u00f3s o delimitador de parada
XIE04.S=Arquivo de dados n\u00e3o encontrado: {0}
XIE05.S=O arquivo de dados n\u00e3o pode ser nulo.
XIE06.S=O nome da entidade era nulo.
XIE07.S=Os separadores de registros e campos n\u00e3o podem ser subcadeias uns dos outros.
XIE08.S=N\u00e3o existe nenhuma coluna por nome: {0}
XIE09.S=O n\u00famero total de colunas na linha \u00e9: {0}
XIE0B.S=A coluna ''{0}'' na tabela \u00e9 do tipo {1}, ela n\u00e3o \u00e9 suportada pela importa\u00e7\u00e3o/exporta\u00e7\u00e3o.
XIE0D.S=N\u00e3o \u00e9 poss\u00edvel encontrar o separador de registro na linha {0}
XIE0E.S=endOfFile lido em local inesperado na linha {0}
XIE0I.S=IOException obtido ao gravar dados no arquivo
XIE0J.S=Um delimitador n\u00e3o \u00e9 v\u00e1lido ou foi utilizado mais de uma vez.
XIE0K.S=O per\u00edodo foi especificado como delimitador de cadeia de caracteres.
XIE0M.S=A tabela ''{0}'' n\u00e3o existe.

# Monitor
M001=\n# *****************************************************************************\n# ***                N\u00c3O edite este arquivo.                                ***\n# *** A ALTERA\u00c7\u00c3O DO CONTE\u00daDO DESSE ARQUIVO PODE CAUSAR CORRUP\u00c7\u00c3O DE DADOS. ***\n# *****************************************************************************




#  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#
#
#  DO NOT TRANSLATE MESSAGES OR TEXT BELOW THIS LINE
#
#
# ----------------------------------------------------------------------------------------------------------


