# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

01001=Se ha intentado actualizar o suprimir una fila ya suprimida\: no se ha actualizado o suprimido ninguna fila.
01003=Se han eliminado valores nulos del argumento de una funci\u00F3n de columna.
01006=Privilegio no revocado del usuario {0}.
01007=La funci\u00F3n {0} no se ha revocado del ID de autenticaci\u00F3n {1}.
01008=WITH ADMIN OPTION de funci\u00F3n {0} no revocada de ID de autenticaci\u00F3n {1}.
0100E=Intento de XX de devolver demasiados conjuntos de resultados. 
01500=Se ha eliminado la restricci\u00F3n {0} de la tabla {1}.
01501=Se ha eliminado la vista {0}.
01502=Se ha eliminado el desencadenante {0} de la tabla {1}.
01503=Se ha modificado la columna {0} de la tabla {1} a\u00F1adiendo una restricci\u00F3n no nula.
01504=El nuevo \u00EDndice es un duplicado de un \u00EDndice existente\: {0}.
01505=Es posible que el valor {0} est\u00E9 truncado.
01522=El sin\u00F3nimo ''{0}'' reci\u00E9n definido se ha resuelto en el objeto ''{1}'' que no est\u00E1 actualmente definido.
01J01=No se ha creado la base de datos ''{0}'', en su lugar se ha realizado una conexi\u00F3n con una base de datos existente.
01J02=Los cursores sensibles al desplazamiento no est\u00E1n implementados actualmente.
01J04=La clase ''{0}'' para la columna ''{1}'' no implementa java.io.Serializable o java.sql.SQLData. Las instancias deben implementar una de estas interfaces para permitir poder ser almacenadas.
01J05=Actualizaci\u00F3n de base de datos correcta. La base de datos actualizada est\u00E1 preparada ahora para su uso. No se han podido revalidar las sentencias preparadas almacenadas. Consulte la excepci\u00F3n siguiente para obtener detalles sobre la anomal\u00EDa.
01J06=ResultSet no actualizable. La consulta no califica para generar un ResultSet actualizable.
01J07=ResultSetHoldability restringido a ResultSet.CLOSE_CURSORS_AT_COMMIT para una transacci\u00F3n global.
01J08=No se ha podido abrir el tipo de resultSet {0}. El tipo de ResultSet {1} est\u00E1 abierto.
01J10=Los conjuntos de resultados sensibles a desplazamiento no est\u00E1n soportados por el servidor; se est\u00E1 volviendo a correlacionar con el cursor de s\u00F3lo avance
01J12=No se puede obtener el texto de mensaje desde el servidor. Consulte la excepci\u00F3n siguiente. El procedimiento almacenado SYSIBM.SQLCAMESSAGE no est\u00E1 instalado en el servidor. P\u00F3ngase en contacto con el administrador de bases de datos.
01J13=El n\u00FAmero de filas devueltas ({0}) es demasiado grande para caber en un entero; el valor devuelto se truncar\u00E1.
01J14=Se est\u00E1 utilizando la autorizaci\u00F3n de SQL sin habilitar primero la autenticaci\u00F3n.
02000=No se ha encontrado ninguna fila para FETCH, UPDATE o DELETE; o el resultado de una consulta es una tabla vac\u00EDa.
07000=Al menos un par\u00E1metro de la sentencia actual no est\u00E1 inicializado.
07004=El par\u00E1metro {0} es un par\u00E1metro de procedimiento {1} y por tanto debe registrarse con CallableStatement.registerOutParameter antes de la ejecuci\u00F3n.
07009=Sin par\u00E1metros de entrada.
08000.S.1=No se puede cerrar una conexi\u00F3n con una transacci\u00F3n activa.  La transacci\u00F3n permanece abierta y la conexi\u00F3n no se ha cerrado.
08000=Conexi\u00F3n cerrada por una interrupci\u00F3n desconocida.
08001.C.10=No se ha podido establecer una conexi\u00F3n debido a que la se\u00F1al de seguridad es mayor que el m\u00E1ximo que permite el protocolo de red.
08001.C.11=No se ha podido establecer una conexi\u00F3n debido a que el id de usuario tiene una longitud de cero o es mayor que el m\u00E1ximo que permite el protocolo de red.
08001.C.12=No se ha podido establecer una conexi\u00F3n debido a que la contrase\u00F1a tiene una longitud de cero o es mayor que el m\u00E1ximo que permite el protocolo de red.
08001.C.1=La propiedad de Derby DataSource {0} necesaria no est\u00E1 establecida.
08001.C.2={0} \: Error al conectarse al servidor {1} en el puerto {2} con el mensaje {3}.
08001.C.3=SocketException\: ''{0}''
08001.C.4=No se puede abrir la corriente en el socket\: ''{0}''.
08001.C.5=El id de usuario ({0}) est\u00E1 fuera del rango entre 1 y {1}.
08001.C.6=La longitud de la contrase\u00F1a ({0}) est\u00E1 fuera del rango entre 1 y {1}.
08001.C.7=El id de usuario no puede ser nulo.
08001.C.8=La contrase\u00F1a no puede ser nula.
08001.C.9=No se ha podido establecer una conexi\u00F3n debido a que el nombre de base de datos ''{0}'' es mayor que la longitud m\u00E1xima que permite el protocolo de red.
08003.C.1=getConnection() no v\u00E1lido en una Conexi\u00F3nAgrupada cerrada.
08003.C.2=El m\u00E9todo Lob llamado despu\u00E9s de una conexi\u00F3n se ha cerrado
08003.C.3=La conexi\u00F3n f\u00EDsica subyacente est\u00E1 obsoleta o cerrada.
08003=Sin conexi\u00F3n actual.
08004.C.10=No se puede seleccionar permiso del sistema para crear la base de datos ''{0}'' [{1}].
08004.C.11=Falta permiso para el usuario ''{0}'' para crear la base de datos ''{1}'' [{2}].
08004.C.1=Se ha producido una anomal\u00EDa de autenticaci\u00F3n de conexi\u00F3n.  Raz\u00F3n\: {0}.
08004.C.2=Se ha rechazado la conexi\u00F3n porque no se ha encontrado la base de datos {0}.
08004.C.3=Conexi\u00F3n de base de datos rechazada.
08004.C.4=El usuario ''{0}'' no puede cerrar la sesi\u00F3n de la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.5=El usuario ''{0}'' no puede (re)cifrar la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.6=El usuario ''{0}'' no puede efectuar un actualizaci\u00F3n completa (hard upgrade) de la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.7=La conexi\u00F3n con la base de datos ''{0}'' ha sido rechazada porque est\u00E1 en modo esclavo de r\u00E9plica.
08004.C.8=El usuario ''{0}'' no puede emitir una operaci\u00F3n de repetici\u00F3n en la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.9=Falta permiso para el usuario ''{0}'' para apagar el sistema [{1}].
08004=Conexi\u00F3n rechazada\: {0}
08006.C.1=Se ha producido un error durante un restablecimiento de la conexi\u00F3n y se ha finalizado la conexi\u00F3n.  Consulte las excepciones encadenadas para obtener detalles.
08006.C.2=SocketException\: ''{0}''
08006.C.3=Se ha detectado un error de comunicaciones\: {0}.
08006.C.4=Se ha producido un error durante un restablecimiento de conexi\u00F3n diferido y la conexi\u00F3n se ha finalizado.  Consulte las excepciones encadenadas para obtener detalles.
08006.C.5=No hay suficientes datos mientras se lee desde la red - se esperaba un m\u00EDnimo de {0} y s\u00F3lo se han recibido {1} bytes.  La conexi\u00F3n se ha finalizado.
08006.C.6=Se ha intentado materializar por completo datos lob demasiado grandes para JVM.  La conexi\u00F3n se ha finalizado.
08006.C=Se ha encontrado un error de protocolo de red y se ha finalizado la conexi\u00F3n\: {0}
08006.D=Conclusi\u00F3n de la base de datos ''{0}''.
0A000.C.6=El mandato DRDA {0} no est\u00E1 actualmente implementado.  La conexi\u00F3n se ha finalizado.
0A000.S.1=El m\u00E9todo JDBC todav\u00EDa no se ha implementado.
0A000.S.2=El m\u00E9todo JDBC {0} no est\u00E1 soportado por el servidor. Actualice el servidor.
0A000.S.3=La propiedad resultSetHoldability {0} no est\u00E1 soportada
0A000.S.4=El servidor no da soporte a sercancel().
0A000.S.5=El mecanismo de seguridad ''{0}'' no est\u00E1 soportado.
0A000.S.7=El tipo de datos ''{0}'' no est\u00E1 soportado.
0A000.S=Caracter\u00EDstica no implementada\: {0}.
0P000.S.1=Especificaci\u00F3n de funci\u00F3n no v\u00E1lida, no se ha garantizado la funci\u00F3n al usuario actual o P\u00DABLICO\: ''{0}''.
0P000=Especificaci\u00F3n de funci\u00F3n no v\u00E1lida, la funci\u00F3n no existe\: ''{0}''.
10000=Se ha encontrado un error al evaluar una expresi\u00F3n de consulta XML para el operador {0}\: {1}
21000=La subconsulta escalar tiene permitido devolver una sola fila.
22001=Se ha producido un error de truncamiento al intentar recortar {0} ''{1}'' a una longitud {2}.
22003.S.1=El a\u00F1o ({0}) excede el m\u00E1ximo ''{1}''.
22003.S.2=El decimal s\u00F3lo puede tener un m\u00E1ximo de 31 d\u00EDgitos.
22003.S.3=Se ha producido un desbordamiento durante la conversi\u00F3n del tipo de datos num\u00E9rico de ''{0}'' a {1}.
22003=El valor resultante queda fuera del rango para el tipo de datos {0}.
22004.S.4=La longitud de ({0}) excede la longitud m\u00E1xima para el tipo de datos ({1}).
22005.S.1=No se ha podido convertir un valor del tipo ''{0}'' al tipo ''{1}'' \: la codificaci\u00F3n no est\u00E1 soportada.
22005.S.2=El convertidor de caracteres necesario no est\u00E1 disponible.
22005.S.3=La serie Unicode no se puede convertir a la serie Ebcdic
22005.S.4=Tipo JDBC no reconocido. Tipo\: {0}, columnCount\: {1}, columnIndex\: {2}.
22005.S.5=Tipo JDBC no v\u00E1lido para el par\u00E1metro {0}.
22005.S.6=Tipo SQL Java no reconocido {0}.
22005=Se ha intentado obtener un valor de datos de tipo ''{0}'' de un valor de datos de tipo ''{1}''.
22007.S.180=La representaci\u00F3n de serie de un valor de fecha y hora queda fuera de rango.
22007.S.181=La sintaxis de la representaci\u00F3n de serie de un valor de fecha y hora es incorrecta.
22008.S=''{0}'' es un argumento no v\u00E1lido en la funci\u00F3n {1}.
2200L=Los valores asignados a columnas XML deben tener nodos DOCUMENT formados correctamente.
2200M=DOCUMENT de XML no v\u00E1lido\: {0}
2200V=Elemento de contexto no v\u00E1lido para el operador {0}; los elementos de contexto deben ser nodos DOCUMENT formados correctamente.
2200W=Error de serializaci\u00F3n de XQuery\: Se ha intentado serializar uno o m\u00E1s nodos de Atributo de nivel superior.
22011=El segundo o tercer argumento de la funci\u00F3n SUBSTR queda fuera de rango.
22012=Intento de divisi\u00F3n por cero.
22013=Intento de calcular la ra\u00EDz cuadrada de un n\u00FAmero negativo, ''{0}''.
22014=La posici\u00F3n inicial de LOCATE no es v\u00E1lida; debe ser un entero positivo. El \u00EDndice desde el que comenzar la b\u00FAsqueda es ''{2}''.  La serie a buscar es ''{0}''.  La serie desde la que buscar es ''{1}''. 
22015.S.1=Conversi\u00F3n de datos no v\u00E1lida\: la conversi\u00F3n solicitada producir\u00EDa una p\u00E9rdida de precisi\u00F3n de {0}
22015=La funci\u00F3n ''{0}'' no est\u00E1 permitida en el siguiente conjunto de tipos.  El primer operando es de tipo ''{1}''.  El segundo operando es de tipo ''{2}''.  El tercer operando (posici\u00F3n inicial) es de tipo ''{3}''.
22018=Formato de serie de caracteres no v\u00E1lido para tipo {0}.
22019=Secuencia de escape no v\u00E1lida, ''{0}''. La serie de escape debe contener exactamente un car\u00E1cter. No puede ser nula o contener m\u00E1s de un car\u00E1cter.
22020=La cadena de la funci\u00F3n trim no es v\u00E1lida, ''{0}''. La cadena de TRIM debe estar formada por un car\u00E1cter o ser nula. No puede tener m\u00E1s de un car\u00E1cter.
22025=El car\u00E1cter de escape debe ir seguido del car\u00E1cter de escape, ''_'' o ''%''. No puede ir seguido de ning\u00FAn otro car\u00E1cter o ir al final del patr\u00F3n.
22027=La funci\u00F3n incorporada TRIM() soporta un solo car\u00E1cter de ajuste.  Las funciones incorporadas LTRIM() y RTRIM() soportan varios caracteres de ajuste.
22028=La serie excede la longitud m\u00E1xima de {0}.
22501=Una cl\u00E1usula ESCAPE de NULL devuelve resultados no definidos y no est\u00E1 permitida.
23502=La columna ''{0}'' no puede aceptar un valor NULL.
23503={2} en la tabla ''{1}'' ha causado una violaci\u00F3n de restricci\u00F3n de clave for\u00E1nea ''{0}'' para la clave {3}.  La sentencia se ha retrotra\u00EDdo.
23505=La sentencia ha terminado anormalmente porque habr\u00EDa provocado un valor de clave duplicado en una restricci\u00F3n de clave \u00FAnica o primaria o en un \u00EDndice \u00FAnico identificado por ''{0}'' definido en ''{1}''.
23513=La restricci\u00F3n de comprobaci\u00F3n ''{1}'' se ha violado al realizar un INSERT o UPDATE en la tabla ''{0}''.
24000=Estado del cursor no v\u00E1lido - sin fila actual.
24501.S=El cursor identificado no est\u00E1 abierto.
25001.S.1=Estado de transacci\u00F3n no v\u00E1lido\: transacci\u00F3n de SQL activa.
25001=No se puede cerrar una conexi\u00F3n mientras todav\u00EDa siga activa una transacci\u00F3n.
25501=No es posible establecer la propiedad de conexi\u00F3n de s\u00F3lo lectura en una transacci\u00F3n activa.
25502=No se permite un cambio de datos SQL en una conexi\u00F3n, usuario o base de datos de s\u00F3lo lectura.
25503=No se permite DDL en una conexi\u00F3n, usuario o base de datos de s\u00F3lo lectura.
25505=Un usuario de s\u00F3lo lectura o un usuario de una base de datos de s\u00F3lo lectura no tiene permitido inhabilitar la modalidad de s\u00F3lo lectura de una conexi\u00F3n.
28502=El nombre de usuario ''{0}'' no es v\u00E1lido. 
2D521.S.1=setAutoCommit(true) no v\u00E1lido durante una transacci\u00F3n global.
2D521.S.2=COMMIT o ROLLBACK no v\u00E1lido para el entorno de ejecuci\u00F3n de aplicaci\u00F3n. 
38000=Se he generado la excepci\u00F3n ''{0}'' al evaluar una expresi\u00F3n.
38001=No se permite a la rutina externa que ejecute sentencias SQL.
38002=La rutina intent\u00F3 modificar datos, cuando \u00E9sta no estaba definida como MODIFIES SQL DATA.
38004=La rutina intent\u00F3 leer datos, cuando \u00E9sta no estaba definida como READS SQL DATA.
39004=No se puede pasar un valor NULL a un m\u00E9todo que toma un par\u00E1metro de tipo primitivo ''{0}''.
3B001.S=SAVEPOINT, {0} no existe o no est\u00E1 activo en la transacci\u00F3n actual.
3B002.S=Se alcanz\u00F3 el n\u00FAmero m\u00E1ximo de SAVEPOINT. 
3B501.S=Ya existe un SAVEPOINT con el nombre que se ha pasado en la transacci\u00F3n actual.
3B502.S=Se ha especificado RELEASE o ROLLBACK TO SAVEPOINT, pero no existe ning\u00FAn SAVEPOINT.
40001=No se ha podido obtener un bloqueo debido a un punto muerto, el ciclo de bloqueos y esperas es\:\n{0}. La v\u00EDctima seleccionada es XID \: {1}.
40XC0=Sentencia muerta. Esto puede haber sido provocado por un error grave de transacci\u00F3n dentro de esta sentencia.
40XD0=Se ha cerrado el contenedor.
40XD1=El contenedor se ha abierto en modalidad de s\u00F3lo lectura.
40XD2=El contenedor {0} no se puede abrir; o bien se ha eliminado o bien no existe.
40XL1=No se ha podido obtener un bloqueo dentro del tiempo solicitado
40XL2=No se ha podido obtener un bloqueo dentro del tiempo solicitado.  El vuelco de lockTable es\: {0}
40XT0=El m\u00F3dulo RawSotre ha identificado un error interno.
40XT1=Se ha generado una excepci\u00F3n al comprometer la transacci\u00F3n.
40XT2=Se ha generado una excepci\u00F3n al retrotraer un SAVEPOINT.
40XT4=Se ha intentado cerrar una transacci\u00F3n que a\u00FAn estaba activa. La transacci\u00F3n ha terminado anormalmente.
40XT5=Se he generado una excepci\u00F3n durante una transacci\u00F3n interna.
40XT6=La base de datos est\u00E1 en estado de reposo, no se puede activar la transacci\u00F3n.  Espere un momento a que salga del estado de reposo.
40XT7=La operaci\u00F3n no est\u00E1 soportada en una transacci\u00F3n interna.
42000=Error de sintaxis o violaci\u00F3n de norma de acceso; consulte los errores adicionales para obtener detalles.
42500=El usuario ''{0}'' no tiene el permiso de {1} en la tabla ''{2}''.''{3}''.
42501=El usuario ''{0}'' no tiene el permiso de {1} en la tabla ''{2}''.''{3}'' para otorgar.
42502=El usuario ''{0}'' no tiene el permiso de {1} en la columna ''{2}'' de la tabla ''{3}''.''{4}''.
42503=El usuario ''{0}'' no tiene el permiso de {1} en la columna ''{2}'' de la tabla ''{3}''.''{4}'' para otorgar.
42504=El usuario ''{0}'' no tiene permiso de ejecuci\u00F3n en {1} ''{2}''.''{3}''.
42505=El usuario ''{0}'' no tiene permiso de ejecuci\u00F3n en {1} ''{2}''.''{3}'' para otorgar.
42506=El usuario ''{0}'' no es el propietario de {1} ''{2}''.''{3}''.
42507=El usuario ''{0}'' no puede realizar la operaci\u00F3n en el esquema ''{1}''.
42508=El usuario ''{0}'' no puede crear el esquema ''{1}''. S\u00F3lo el propietario de la base de datos puede emitir esta sentencia.
42509=La operaci\u00F3n de otorgar o revocar especificada no se permite en el objeto ''{0}''.
4250A=El usuario ''{0}'' no tiene el permiso de {1} en el objeto ''{2}''.''{3}''.
4250B=Propiedad de autorizaci\u00F3n de base de datos no v\u00E1lida ''{0}\={1}''.
4250C=Los usuarios ''{0}'' no pueden estar a la vez en listas de autorizaci\u00F3n de s\u00F3lo lectura y de acceso total.
4250D=Usuario(s) ''{1}'' repetido(s) en lista de acceso ''{0}'';
4250E=Error interno\: id {0} no v\u00E1lido en la lista de permisos de sentencia.
4251A=La sentencia {0} s\u00F3lo la puede emitir el propietario de la base de datos.
42601.S.372=La sentencia ALTER TABLE no puede a\u00F1adir una columna IDENTITY a una tabla.
42601=En una sentencia ALTER TABLE, la columna ''{0}'' se ha especificado como NOT NULL y no se ha especificado la cl\u00E1usula DEFAULT o bien se ha especificado como DEFAULT NULL.
42605=El n\u00FAmero de argumentos para la funci\u00F3n ''{0}'' es incorrecto.
42606=Se ha detectado una constante hexadecimal no v\u00E1lida que comienza por ''{0}''.
42610=Todos los argumentos de la funci\u00F3n COALESCE/VALUE no pueden ser par\u00E1metros. La funci\u00F3n necesita al menos un argumento que no sea un par\u00E1metro.
42611=El atributo de longitud, precisi\u00F3n o escala para columna o correlaci\u00F3n de tipo ''{0}'' no es v\u00E1lido. 
42613=Hay una o m\u00E1s palabras claves conflictivas en relaci\u00F3n a la cl\u00E1usula ''{0}''.
42621=Una restricci\u00F3n de comprobaci\u00F3n o columna generada definida con ''{0}'' no es v\u00E1lida.
42622=El nombre ''{0}'' es demasiado largo. La longitud m\u00E1xima es ''{1}''.
42734=El nombre ''{0}'' especificado en el contexto ''{1}'' no es \u00FAnico.
42802=El n\u00FAmero de valores asignado no coincide con el n\u00FAmero de columnas especificadas o impl\u00EDcitas.
42803=Una expresi\u00F3n que contiene la columna ''{0}'' aparece en la lista SELECT y no forma parte de una cl\u00E1usula GROUP BY.
42815.S.171=El tipo de datos, longitud o valor de argumentos ''{0}'' y ''{1}'' es incompatible.
42815.S.713=El valor de sustituci\u00F3n para ''{0}'' no es v\u00E1lido.
42818=No se admiten comparaciones entre ''{0}'' y ''{1}''. Los tipos deben ser comparables. Adem\u00E1s, los tipos de cadenas tambi\u00E9n deben tener un sistema de ordenaci\u00F3n coincidente. Si el sistema de ordenaci\u00F3n no coincide, una posible soluci\u00F3n es convertir (con CAST) los operandos para forzar el uso del sistema de ordenaci\u00F3n predeterminado (por ejemplo\: SELECT tablename FROM sys.systables WHERE CAST(tablename AS VARCHAR(128)) \= ''T1'')
42820=El literal de coma flotante ''{0}'' contiene m\u00E1s de 30 caracteres.
42821=Las columnas de tipo ''{0}'' no pueden contener valores de tipo ''{1}''. 
42824=Un operando de LIKE no es una serie, o el primer operando no es una columna.
42831=''{0}'' no puede ser una columna de clave primaria o clave \u00FAnica porque puede contener valores nulos.
42834=No se puede especificar SET NULL porque FOREIGN KEY ''{0}'' no puede contener valores nulos.  
42837=ALTER TABLE ''{0}'' ha especificado atributos para la columna ''{1}'' que no son compatibles con la columna existente.
42846=No se pueden convertir los tipos ''{0}'' a ''{1}''.
42877=No se permite un nombre de columna calificado ''{0}'' en la cl\u00E1usula ORDER BY.
42878=La cl\u00E1usula ORDER BY de las sentencias SELECT UNION s\u00F3lo admite referencias de columnas sin cualificar y n\u00FAmeros de posici\u00F3n de columna. En este momento no se admiten otras expresiones.
42879=La cl\u00E1usula ORDER BY no puede contener la columna ''{0}'', ya que la consulta contiene la clave DISTINCT y esa columna no aparece en el resultado de la consulta.
4287A=La cl\u00E1usula ORDER BY no puede especificar ninguna expresi\u00F3n, ya que la consulta indica DISTINCT.
42884=No se encontr\u00F3 ninguna rutina autorizada con el nombre ''{0}'' del tipo ''{1}'' que tuviese argumentos compatibles.
42886=''{0}'' par\u00E1metro ''{1}'' requiere un marcador de par\u00E1metro ''?''.
42894=El valor DEFAULT o el valor del atributo IDENTITY no es v\u00E1lido para la columna ''{0}''.
428C1=S\u00F3lo se permite una columna de identidad en una tabla.
428EK=El calificador para un nombre de tabla temporal global declarada debe ser SESSION.
42903=Uso no v\u00E1lido de una funci\u00F3n de agregaci\u00F3n.
42908=La sentencia CREATE VIEW no incluye una lista de columnas.
42909=La sentencia CREATE TABLE no incluye ninguna lista de columnas.
42915=La clave for\u00E1nea ''{0}'' no es v\u00E1lida debido a ''{1}''. 
42916=No se puede crear el sin\u00F3nimo ''{0}'' para ''{1}'' puesto que dar\u00EDa lugar a una cadena de sin\u00F3nimos circular.
42939=No se puede crear un objeto con el nombre de esquema ''{0}''.
4293A=No se puede crear una funci\u00F3n con el nombre ''{0}'', el prefijo SYS est\u00E1 reservado.
42962=En las definiciones de procedimientos o tablas temporales globales declaradas no se permite el par\u00E1metro ''{0}'' o la columna del tipo long. 
42972=Una cl\u00E1usula ON asociada a un operador JOIN no es v\u00E1lida.
42995=La funci\u00F3n solicitada no se aplica a tablas temporales globales.
42X01=Error de sintaxis\: {0}.
42X02={0}.
42X03=El nombre de columna ''{0}'' est\u00E1 en m\u00E1s de una tabla de la lista FROM.
42X04=La columna ''{0}'' no est\u00E1 en ninguna tabla de la lista FROM o aparece en una especificaci\u00F3n de uni\u00F3n y est\u00E1 fuera del \u00E1mbito de la especificaci\u00F3n de uni\u00F3n o bien aparece en una cl\u00E1usula HAVING y no est\u00E1 en la lista GROUP BY. Si se trata de una sentencia CREATE o ALTER TABLE entonces ''{0}'' no es una columna de la tabla destino.
42X05=La tabla/vista ''{0}'' no existe.
42X06=Se han especificado demasiadas columnas de resultados para la tabla ''{0}''.
42X07=NULL s\u00F3lo est\u00E1 permitido en una cl\u00E1usula VALUES dentro de una sentencia INSERT.
42X08=El constructor de la clase ''{0}'' no se puede utilizar como tabla virtual externa porque la clase no implementa ''{1}''. 
42X09=La tabla o nombre de alias ''{0}'' se utiliza m\u00E1s de una vez en la lista FROM.
42X10=''{0}'' no es un nombre de tabla expuesto en el \u00E1mbito en que aparece.
42X12=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE TABLE.  
42X13=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la lista de columnas de una sentencia INSERT. 
42X14=''{0}'' no es una columna en la tabla o VTI ''{1}''.
42X15=El nombre de columna ''{0}'' aparece en una sentencia sin una lista FROM.
42X16=El nombre de columna ''{0}'' aparece varias veces en la cl\u00E1usula SET de una sentencia UPDATE.
42X17=En la lista Properties de una cl\u00E1usula FROM, el valor ''{0}'' no es v\u00E1lido como especificaci\u00F3n joinOrder. S\u00F3lo son v\u00E1lidos los valores FIXED y UNFIXED.  
42X19=La cl\u00E1usula WHERE o HAVING o definici\u00F3n CHECK CONSTRAINT es una expresi\u00F3n ''{0}''.  Debe ser una expresi\u00F3n BOOLEAN.
42X23=El cursor {0} no es actualizable.
42X24=Se hace referencia a la columna {0} en la cl\u00E1usa HAVING pero no en la lista GROUP BY.
42X25=La funci\u00F3n ''{0}'' no est\u00E1 permitida en el tipo ''{1}''.
42X26=La clase ''{0}'' para la columna ''{1}'' no existe o no es accesible. Esto puede ocurrir si la clase no es p\u00FAblica.
42X28=Suprimir la tabla ''{0}'' no es el destino del cursor ''{1}''.
42X29=Actualizar la tabla ''{0}'' no es el destino del cursor ''{1}''.
42X30=Cursor ''{0}'' no encontrado. Verifique que AutoCommit sea OFF.
42X31=La columna ''{0}'' no est\u00E1 en la lista FOR UPDATE del cursor ''{1}''.
42X32=El n\u00FAmero de columnas en la lista de columnas derivadas debe coincidir con el n\u00FAmero de columnas de la tabla ''{0}''.
42X33=La lista de columnas derivadas contiene un nombre de columna duplicado ''{0}''.
42X34=Hay un par\u00E1metro ? en la lista de selecci\u00F3n.  No est\u00E1 permitido.
42X35=No est\u00E1 permitido que ambos operandos de ''{0}'' sean par\u00E1metros ?.
42X36=No est\u00E1 permitido que el operador ''{0}'' tome un par\u00E1metro ? como operando.
42X37=El operador unitario ''{0}'' no est\u00E1 permitido sobre el tipo ''{1}''.
42X38=''SELECT *'' s\u00F3lo est\u00E1 permitido en subconsultas EXISTS y NOT EXISTS.
42X39=La consulta s\u00F3lo tiene permitido devolver una sola columna.
42X40=Una sentencia NOT tiene un operando que no es booleano. El operando de NOT debe dar como resultado TRUE, FALSE o UNKNOWN. 
42X41=En la cl\u00E1usula Properties de una lista FROM , la propiedad ''{0}'' no es v\u00E1lida (la propiedad se hab\u00EDa establecido como ''{1}''). 
42X42=Nombre de correlaci\u00F3n no permitido para columna ''{0}'' porque es parte de la lista FOR UPDATE.
42X43=El ResultSetMetaData devuelto para la clase/objeto ''{0}'' era nulo. Para poder utilizar esta clase como tabla virtual externa, el valor de ResultSetMetaData no debe ser nulo. 
42X44=Longitud ''{0}'' no v\u00E1lida en la especificaci\u00F3n de columna.
42X45={0} es un tipo no v\u00E1lido para el n\u00FAmero de argumento {1} de {2}.
42X46=Existen varias funciones llamadas ''{0}''. Utilice la signatura completa o el nombre espec\u00EDfico.
42X47=Existen varios procedimientos llamados ''{0}''. Utilice la signatura completa o el nombre espec\u00EDfico.
42X48=El valor ''{1}'' no es una precisi\u00F3n v\u00E1lida para {0}.
42X49=El valor ''{0}'' no es un literal entero v\u00E1lido.
42X50=No se ha encontrado ning\u00FAn m\u00E9todo que coincidiese con la llamada de m\u00E9todo {0}.{1}({2}), despu\u00E9s de probar todas las combinaciones de los tipos de objeto y primitivo y todas las conversiones de tipos posibles de todos los par\u00E1metros que pudiera tener la llamada de m\u00E9todo. El m\u00E9todo puede existir, pero no es p\u00FAblico y/o est\u00E1tico, o los tipos de par\u00E1metro no son convertibles por la invocaci\u00F3n del m\u00E9todo.
42X51=La clase ''{0}'' no existe o es inaccesible. Esto puede ocurrir si la clase no es p\u00FAblica.
42X52=No est\u00E1 permitido que el m\u00E9todo de llamada (''{0}'') que utilice un receptor del tipo primitivo de Java ''{1}''.
42X53=El predicado LIKE s\u00F3lo puede tener los operandos ''CHAR'' o ''VARCHAR''. El tipo ''{0}'' no est\u00E1 permitido.
42X54=El m\u00E9todo Java ''{0}'' tiene un ? como receptor.  No est\u00E1 permitido.
42X55=El nombre de tabla ''{1}'' debe ser el mismo que ''{0}''.
42X56=El n\u00FAmero de columnas de la lista de columnas de la vista no coincide con el n\u00FAmero de columnas de la expresi\u00F3n de consulta subyacente en la definici\u00F3n de la vista para ''{0}''.
42X57=getColumnCount() de la tabla virtual externa ''{0}'' ha devuelto un valor no v\u00E1lido ''{1}''.  Los valores v\u00E1lidos son mayores o iguales que 1. 
42X58=El n\u00FAmero de columnas en los lados izquierdo y derecho de ''{0}'' debe ser el mismo.
42X59=El n\u00FAmero de columnas en cada constructor VALUES debe ser el mismo.
42X60=Se ha especificado un valor no v\u00E1lido ''{0}'' para la propiedad insertMode de la tabla ''{1}''.
42X61=Los tipos ''{0}'' y ''{1}'' no son compatibles con {2}.
42X62=''{0}'' no est\u00E1 permitido en el esquema ''{1}''.
42X63=La cl\u00E1usula USING no ha devuelto ning\u00FAn resultado. No se pueden establecer par\u00E1metros. 
42X64=En la lista Properties, se ha especificado el valor ''{0}'' no v\u00E1lido para la propiedad useStatistics. Los \u00FAnicos valores v\u00E1lidos son TRUE o FALSE. 
42X65=El \u00EDndice ''{0}'' no existe.
42X66=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE INDEX.
42X68=No se ha encontrado ning\u00FAn campo ''{0}'' perteneciente a la clase ''{1}''.  Es posible que el campo exista pero que no sea p\u00FAblico, o que la clase no exista o no sea p\u00FAblica.
42X69=No est\u00E1 permitido hacer referencia a un campo (''{0}'') utilizando una expresi\u00F3n de referencia del tipo primitivo Java ''{1}''.
42X70=El n\u00FAmero de columnas indicado en la lista de columnas de la tabla no coincide con el n\u00FAmero de columnas de la expresi\u00F3n de consulta asociada a la definici\u00F3n de tabla de ''{0}''.
42X71=Tipo de dato no v\u00E1lido, ''{0}'', para la columna ''{1}''.
42X72=No se ha encontrado ning\u00FAn campo est\u00E1tico ''{0}'' perteneciente a la clase ''{1}''.  El campo puede existir, pero no es p\u00FAblico y/o est\u00E1tico, o bien la clase no existe o \u00E9sta no es p\u00FAblica.  
42X73=Resoluci\u00F3n ambigua del m\u00E9todo para la firma {0}.{1}({2}). (No hay un m\u00E9todo espec\u00EDfico que sea m\u00E1s importante).
42X74=Sintaxis de la sentencia CALL no v\u00E1lida.
42X75=No se ha encontrado ning\u00FAn constructor con la firma {0}({1}).  Es posible que los tipos de par\u00E1metro no sean convertibles por la invocaci\u00F3n del m\u00E9todo.
42X76=Al menos una columna, ''{0}'', en la clave primaria que se va a a\u00F1adir acepta nulos. Todas las columnas de una clave primaria no deben aceptar nulos.
42X77=La posici\u00F3n de la columna ''{0}'' est\u00E1 fuera del rango de la expresi\u00F3n de consulta.
42X78=La columna ''{0}'' no est\u00E1 en el resultado de la expresi\u00F3n de consulta.
42X79=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en el resultado de la expresi\u00F3n de consulta.
42X80=La cl\u00E1usula VALUES debe contener al menos un elemento. Los elementos vac\u00EDos no est\u00E1n permitidos. 
42X82=La cl\u00E1usula USING ha devuelto m\u00E1s de una fila. \u00DAnicamente se permiten filas individuales ResultSets.
42X83=Las restricciones sobre la columna ''{0}'' requieren que acepte nulos y que no los acepte.
42X84=El \u00EDndice ''{0}'' se ha creado para imponer la restricci\u00F3n ''{1}''.  S\u00F3lo puede eliminarse eliminando la restricci\u00F3n.
42X85=Es necesario que la restricci\u00F3n ''{0}'' est\u00E9 en el mismo esquema que la tabla ''{1}''.
42X86=Error de ALTER TABLE. No existe restricci\u00F3n ''{0}'' en la tabla ''{1}''. 
42X87=Al menos una expresi\u00F3n de resultado (THEN o ELSE) de la expresi\u00F3n ''{0}'' no debe ser un ''?''. 
42X88=Un condicional tiene un operando no booleano. El operando de un condicional debe dar como resultado TRUE, FALSE o UNKNOWN.  
42X89=Los tipos ''{0}'' y ''{1}'' no son compatibles. Ning\u00FAn tipo es asignable al otro tipo.  
42X90=Se ha especificado m\u00E1s de una restricci\u00F3n de clave primaria para la tabla ''{0}''.
42X91=El nombre de restricci\u00F3n ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE TABLE. 
42X92=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en una lista de columnas de la restricci\u00F3n.
42X93=La tabla ''{0}'' contiene una definici\u00F3n de restricci\u00F3n con la columna ''{1}'' que no est\u00E1 en la tabla.
42X94={0} ''{1}'' no existe.
42X96=La v\u00EDa de acceso de clase (classpath) de la base de datos contiene un archivo jar ''{0}'' desconocido.
42X98=No est\u00E1n permitidos par\u00E1metros en una definici\u00F3n VIEW.
42X99=No se permiten par\u00E1metros en una definici\u00F3n de TABLE.
42Y00=La clase ''{0}'' no implementa org.apache.derby.iapi.db.AggregateDefinition y por tanto no puede utilizarse como una expresi\u00F3n de agregaci\u00F3n.
42Y01=La restricci\u00F3n ''{0}'' no es v\u00E1lida.
42Y03=''{0}'' no se reconoce como una funci\u00F3n o procedimiento.
42Y04=No se puede crear un procedimiento o funci\u00F3n con EXTERNAL NAME ''{0}'' porque no es una lista separada por puntos. El formato esperado es <v\u00EDa de acceso java completa>.<nombre de m\u00E9todo>.
42Y05=No existe una clave for\u00E1nea llamada ''{0}''.
42Y07=El esquema ''{0}'' no existe.
42Y08=Las restricciones de clave for\u00E1nea no est\u00E1n permitidas en tablas del sistema.
42Y09=Los m\u00E9todos void s\u00F3lo est\u00E1n permitidos dentro de una sentencia CALL.
42Y10=Un constructor de tabla que no est\u00E1 en una sentencia INSERT tiene todos los par\u00E1metros ? en una de sus columnas.  En cada columna, al menos una de las filas debe tener un no-par\u00E1metro.
42Y11=Se necesita una especificaci\u00F3n de uni\u00F3n con la cl\u00E1usula ''{0}''.
42Y12=La cl\u00E1usula ON de JOIN es una expresi\u00F3n ''{0}''.  Debe ser una expresi\u00F3n BOOLEAN.
42Y13=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE VIEW.
42Y16=No se ha encontrado ning\u00FAn m\u00E9todo est\u00E1tico p\u00FAblico ''{0}'' en la clase ''{1}''. Es posible que el m\u00E9todo exista, pero no es p\u00FAblico, o bien no es est\u00E1tico. 
42Y22=La agregaci\u00F3n {0} no puede operar sobre el tipo {1}.
42Y23=Se ha devuelto una informaci\u00F3n de tipo JDBC incorrecta para la columna {0}.
42Y24=La vista ''{0}'' no es actualizable. (Actualmente las vistas no son actualizables). 
42Y25=''{0}'' es una tabla del sistema.  Los usuarios no tienen permitido modificar el contenido de esta tabla.
42Y26=No se permiten agregados en la lista GROUP BY.
42Y27=No est\u00E1n permitidos par\u00E1metros en la acci\u00F3n del desencadenante.
42Y29=La lista SELECT de una consulta no agrupada contiene al menos una expresi\u00F3n no v\u00E1lida. Cuando la lista SELECT contiene al menos una agregaci\u00F3n entonces todas las entradas deben ser expresiones de agregaci\u00F3n v\u00E1lidas.
42Y30=La lista SELECT de una consulta agrupada contiene al menos una expresi\u00F3n no v\u00E1lida. Si una lista SELECT tiene un GROUP BY, la lista s\u00F3lo puede contener expresiones de agrupaci\u00F3n v\u00E1lidas y expresiones de agregaci\u00F3n v\u00E1lidas.  
42Y32=La clase de agregador ''{0}'' para la agregaci\u00F3n ''{1}'' en el tipo {2} no implementa com.ibm.db2j.aggregates.Aggregator. 
42Y33=El agregado {0} contiene uno o m\u00E1s agregados.
42Y34=El nombre de columna ''{0}'' coincide con m\u00E1s de una columna de resultado de la tabla ''{1}''.
42Y35=La referencia de columna ''{0}'' no es v\u00E1lida. Cuando la lista SELECT contiene al menos una agregaci\u00F3n entonces todas las entradas deben ser expresiones de agregaci\u00F3n v\u00E1lidas.  
42Y36=La referencia de columna ''{0}'' no es v\u00E1lida. Para una lista SELECT con un GROUP BY, la lista s\u00F3lo puede contener expresiones de agrupaci\u00F3n y expresiones de agregaci\u00F3n v\u00E1lidas.  
42Y37=''{0}'' es un primitivo Java y no puede utilizarse con este operador.
42Y38=insertMode \= replace no est\u00E1 permitido en una inserci\u00F3n donde se hace referencia a la tabla destino, ''{0}'', en SELECT.
42Y39=''{0}'' puede no aparecer en una definici\u00F3n CHECK CONSTRAINT porque puede devolver resultados no determinantes.
42Y40=''{0}'' aparece varias veces en la lista de columnas UPDATE OF para el desencadenante ''{1}''.
42Y41=''{0}'' no puede invocarse directamente mediante EXECUTE STATEMENT porque es parte de un desencadenante.
42Y42=La escala ''{1}'' no es una escala v\u00E1lida para un ''{0}''.
42Y43=La escala ''{0}'' no es una escala v\u00E1lida con precisi\u00F3n de ''{1}''.
42Y44=Se ha especificado una clave ''{0}'' no v\u00E1lida en la lista Properties de una lista FROM. Las claves sensibles a may\u00FAsculas/min\u00FAsculas que se soportan actualmente son ''{1}''. 
42Y45=No se puede vincular la VTI ''{0}'' porque es una VTI de desencadenante especial y esta sentencia no forma parte de una acci\u00F3n de desencadenante o cl\u00E1usula WHEN.
42Y46=Lista Properties no v\u00E1lida en lista FROM.  No existe ning\u00FAn \u00EDndice ''{0}'' en la tabla ''{1}''.
42Y48=Lista Properties no v\u00E1lida en lista FROM.  No hay restricci\u00F3n con nombre ''{0}'' sobre la tabla ''{1}'' o la restricci\u00F3n no tiene un \u00EDndice de respaldo.
42Y49=Se han especificado varios valores para la clave de propiedad ''{0}''. 
42Y50=La lista Properties de la tabla ''{0}'' puede contener valores de \u00EDndice o de restricci\u00F3n pero no ambos.
42Y55=No se puede realizar ''{0}'' sobre ''{1}'' porque no existe.
42Y56=Se ha especificado una estrategia de uni\u00F3n ''{0}'' en la lista Properties de la tabla ''{1}''. Los valores actualmente soportados para una estrategia de uni\u00F3n son\: ''hash'' y ''nestedloop''.
42Y58=Se ha producido una excepci\u00F3n NumberFormatException al convertir el valor ''{0}'' para el modificador del optimizador ''{1}''.
42Y59=Valor no v\u00E1lido, ''{0}'', especificado para el modificador de hashInitialCapacity. El valor debe ser mayor que 0.
42Y60=Valor no v\u00E1lido, ''{0}'', especificado para el modificador de hashLoadFactor. El valor debe ser mayor que 0.0 y menor o igual a 1.0.
42Y61=Valor no v\u00E1lido, ''{0}'', especificado para el modificador de hashMaxCapacity. El valor debe ser mayor que 0.
42Y62=''{0}'' no est\u00E1 permitido sobre ''{1}'' porque es una vista.
42Y63=La uni\u00F3n hash requiere un predicado equijoin optimizable sobre una columna del \u00EDndice o heap seleccionado.  No existe un predicado equijoin optimizable sobre ninguna columna de la tabla o \u00EDndice ''{0}''. Utilice el modificador del optimizador ''index'' para especificar dicho \u00EDndice o heap sobre la tabla ''{1}''.
42Y64=El valor de bulkFetch de ''{0}'' no es v\u00E1lido. El valor m\u00EDnimo para bulkFetch es 1.
42Y65=bulkFetch no se permite en uniones ''{0}''.
42Y66=bulkFetch no se permite en cursores actualizables. 
42Y67=El esquema ''{0}'' no se puede eliminar.
42Y69=No se ha encontrado un plan de ejecuci\u00F3n v\u00E1lido para esta sentencia. Puede deberse a una de estas dos causas\: ha especificado una estrategia de uni\u00F3n hash cuando la uni\u00F3n hash no est\u00E1 permitida (equijoin no optimizable) o est\u00E1 intentando unir dos tablas virtuales externas, que se referencian entre ellas, y por tanto no se puede evaluar la sentencia.  
42Y70=El usuario ha especificado una orden de uni\u00F3n no v\u00E1lida. Esto podr\u00EDa estar causado porque se est\u00E1 pasando como par\u00E1metro una columna de uni\u00F3n desde una tabla interior a una tabla virtual externa.
42Y71=La funci\u00F3n del sistema o el procedimiento ''{0}'' no se puede eliminar.
42Y82=La sentencia preparada almacenada generada por el sistema ''{0}'' no se puede eliminar mediante DROP STATEMENT. Es parte de un desencadenante. 
42Y83=No se permite un nulo sin tipo como argumento del agregado {0}.  Convierta el nulo a un tipo adecuado.
42Y84=''{0}'' no puede aparecer en una definici\u00F3n DEFAULT.
42Y85=La palabra clave DEFAULT s\u00F3lo est\u00E1 permitida en una cl\u00E1usula VALUES cuando la cl\u00E1usula VALUES aparece dentro de una sentencia INSERT.
42Y90=No se permite FOR UPDATE en este tipo de sentencia.  
42Y91=La cl\u00E1usula USING no se permite en EXECUTE STATEMENT de una acci\u00F3n de desencadenante.
42Y92=Los desencadenantes {0} s\u00F3lo pueden hacer referencia a variables/tablas de transici\u00F3n {1}.
42Y93=Cl\u00E1usula REFERENCING no permitida\: s\u00F3lo se permite un nombre para cada tipo de variable/tabla de transici\u00F3n.
42Y94=Un AND u OR tienen un operando no booleano. Los operandos de AND y OR deben dar como resultado TRUE, FALSE o UNKNOWN.  
42Y95=El operador ''{0}'' con un tipo de operando izquierdo de ''{1}'' y un tipo de operando derecho de ''{2}'' no est\u00E1 soportado.
42Y96.U=DESCONOCIDO
42Y97=Car\u00E1cter de escape en la l\u00EDnea ''{0}'', columna ''{1}''.
42Y98.U=Se ha encontrado ''{0}'' en la l\u00EDnea {1}, columna {2}
42Y99.U=Error l\u00E9xico en la l\u00EDnea {0}, columna {1}. Encontrado\: {2}
42Z00.U=Llamada de m\u00E9todo Java o referencia de campo
42Z01.U=SIN TIPO
42Z02=En este momento no se soportan agregados DISTINCT m\u00FAltiples.
42Z07=No se permiten agregados en la cl\u00E1usula ON.
42Z08=La sustituci\u00F3n mediante inserci\u00F3n general no est\u00E1 permitida en ''{0}'' porque tiene un desencadenante habilitado ({1}).
42Z09.U=COLUMN DEFAULT para
42Z11.U=corriente
42Z15=Se ha especificado un tipo no v\u00E1lido para la columna ''{0}''. No se puede cambiar el tipo de una columna.  
42Z16=S\u00F3lo puede alterarse la longitud de las columnas VARCHAR. 
42Z17=Se ha especificado una longitud no v\u00E1lida para la columna ''{0}''. La longitud debe ser mayor que la longitud de columna actual.
42Z18=La columna ''{0}'' forma parte de una restricci\u00F3n de clave for\u00E1nea ''{1}''. Para alterar la longitud de esta columna, primero debe eliminar la restricci\u00F3n, realizar ALTER TABLE y despu\u00E9s volver a crear la restricci\u00F3n.
42Z19=La columna ''{0}'' est\u00E1 referenciada por al menos una restricci\u00F3n de clave for\u00E1nea ''{1}''. Para alterar la longitud de esta columna, debe eliminar las restricciones de referencia, realizar ALTER TABLE y despu\u00E9s volver a crear las restricciones. 
42Z20=La columna ''{0}'' no puede aceptar nulos. Forma parte de una clave primaria o restricci\u00F3n \u00FAnica, que no puede tener columnas con valores nulos.
42Z21=Se ha especificado un incremento no v\u00E1lido para la identidad de la columna ''{0}''. El incremento no puede ser cero.  
42Z22=Se ha especificado un tipo no v\u00E1lido para la columna de identidad ''{0}''. Los \u00FAnicos tipos v\u00E1lidos para columnas de identidad son BIGINT, INT y SMALLINT.
42Z23=Se ha intentado modificar una columna de identidad ''{0}''. 
42Z24=Se ha producido un desbordamiento en el valor de identidad de la columna ''{1}'' de la tabla ''{0}''.
42Z25=ERROR INTERNO de contador de identidad. Se ha llamado a la actualizaci\u00F3n sin argumentos con el valor actual \= NULL.
42Z26=Una columna, ''{0}'', con un valor por omisi\u00F3n de identidad no puede aceptar nulos.
42Z27=Una columna que acepta nulos, ''{0}'', no puede modificarse para que tenga un valor por omisi\u00F3n de identidad.
42Z30.U=tiempo transcurrido en este ResultSet \=
42Z31.U=tiempo transcurrido en este ResultSet y posteriormente \=
42Z32.U=tiempo total de ruptura\: 
42Z33.U=tiempo del constructor (milisegundos) \=
42Z34.U=tiempo de apertura (milisegundos) \=
42Z35.U=tiempo de siguiente (milisegundos) \=
42Z36.U=tiempo de cierre (milisegundos) \=
42Z37.U=Ninguno
42Z38.U=Informaci\u00F3n de posicionamiento no disponible porque este ResultSet nunca se ha abierto.
42Z39.U=Excepci\u00F3n inesperada {0} obteniendo posicionador.
42Z40.U={0} en primera(s) {1} columna(s).
42Z41.U=Sem\u00E1ntica de nulos ordenados en las siguientes columnas\: 
42Z42.U=ID de columna
42Z43.U=Operador
42Z44.U=Nulos ordenados
42Z45.U=Valor devuelto desconocido
42Z46.U=Invalidar resultado de comparaci\u00F3n
42Z47.U=Obtener un plan de consulta como String no est\u00E1 soportado actualmente para {0}
42Z48.U=ID de columna[{0}][{1}]
42Z50=ERROR INTERNO\: imposible generar c\u00F3digo para {0}.
42Z53=ERROR INTERNO\: se desconoce el tipo de activaci\u00F3n a generar para la elecci\u00F3n del nodo {0}.
42Z54.U=Esta excepci\u00F3n detiene la sentencia despu\u00E9s de analizar; no se necesitan m\u00E1s procesos.
42Z55.U=Ejecuci\u00F3n detenida despu\u00E9s de analizar mediante el distintivo de depuraci\u00F3n StopAfterParsing.
42Z56.U=Ejecuci\u00F3n detenida despu\u00E9s de enlazar mediante el distintivo de depuraci\u00F3n StopAfterBinding.
42Z57.U=Ejecuci\u00F3n detenida despu\u00E9s de optimizar mediante el distintivo de depuraci\u00F3n StopAfterOptimizing.
42Z58.U=Ejecuci\u00F3n detenida despu\u00E9s de generar mediante el distintivo de depuraci\u00F3n StopAfterGenerating.
42Z60={0} no se permite a menos que la propiedad de base de datos {1} tenga el valor ''{2}''.
42Z70=La vinculaci\u00F3n directa a un valor XML no est\u00E1 permitida; intente utilizar XMLPARSE.
42Z71=Los valores XML no est\u00E1n permitidos en conjuntos de resultados de nivel superior; intente utilizar XMLSERIALIZE.
42Z72=Falta(n) palabra(s) clave de SQL/XML ''{0}'' en la l\u00EDnea {1}, columna {2}.
42Z73=Tipo de destino no v\u00E1lido para XMLSERIALIZE\: ''{0}''.
42Z74=Funci\u00F3n XML no soportada\: ''{0}''.
42Z75=La expresi\u00F3n de consulta XML debe ser un literal de tipo serie.
42Z76=No se permiten m\u00FAltiples elementos de contexto XML.
42Z77=El elemento de contexto debe ser de tipo ''XML''; ''{0}'' no se permite.
42Z79=No se puede determinar el tipo de par\u00E1metro para XMLPARSE; intente utilizar CAST.
42Z80.U=serializable
42Z81.U=lectura comprometida
42Z82.U=exclusivo
42Z83.U=compartici\u00F3n instant\u00E1nea
42Z84.U=compartir
42Z85.U=tabla
42Z86.U=fila
42Z87.U=compartir tabla
42Z88.U=compartir fila
42Z90=La clase ''{0}'' no devuelve un ResultSet actualizable.
42Z91=subconsulta
42Z92=lectura repetible
42Z93=Las restricciones ''{0}'' y ''{1}'' tiene el mismo conjunto de columnas, lo cual no est\u00E1 permitido. 
42Z97=La columna restante ''{0}'' originar\u00E1 que la restricci\u00F3n de comprobaci\u00F3n ''{1}'' se interrumpa.
42Z99=El literal String o Hex no puede superar 64K.
42Z9A=lectura no comprometida
42Z9B=La interfaz de tabla virtual externa no da soporte a columnas BLOB o CLOB. ''{0}'' columna ''{1}''. 
42Z9D.S.1=Los procedimientos que modifican datos SQL no se permiten en desencadenantes BEFORE.
42Z9D=Las sentencias ''{0}'' no est\u00E1n permitidas en desencadenantes ''{1}''.
42Z9E=La restricci\u00F3n ''{0}'' no es una restricci\u00F3n ''{1}''.
42Z9F=Demasiados \u00EDndices ({0}) en la tabla {1}. El l\u00EDmite es {2}.  
42ZA0=La sentencia es demasiado compleja. Intente escribir de nuevo la consulta para eliminar la complejidad. La eliminaci\u00F3n de muchas expresiones duplicadas o la divisi\u00F3n de la consulta y el almacenamiento de los resultados temporales en una tabla temporal a menudo puede ayudar a resolver este error.
42ZA1=SQL no v\u00E1lido en el proceso por lotes\: ''{0}''.
42ZA2=El operando del predicado LIKE con tipo {0} y ordenaci\u00F3n {1} no es compatible con el patr\u00F3n del operando de LIKE con el tipo {2} y la ordenaci\u00F3n {3}.
42ZA3=La tabla tendr\u00E1 el tipo de ordenaci\u00F3n {0}, que es distinta de la del esquema {1}, dado que no se admite esta operaci\u00F3n.
42ZB1=El estilo de par\u00E1metro DERBY_JDBC_RESULT_SET s\u00F3lo es v\u00E1lido para funciones de tabla.
42ZB2=Las funciones de tabla s\u00F3lo pueden tener el estilo de par\u00E1metro DERBY_JDBC_RESULT_SET.
42ZB3=XML no se permite como tipo de datos de una columna devuelta por una funci\u00F3n de tabla.
42ZB4=''{0}''.{1}'' no identifica una funci\u00F3n de tabla.
42ZB5=La clase ''{0}'' implementa VTICosting pero no proporciona un constructor sin argumentos p\u00FAblico.
43X00.U=Conectado a
43X01.U=Inicio de subconsulta n\u00FAmero
43X02.U=Cualquier ResultSet
43X03.U=N\u00FAmero de aperturas
43X04.U=Filas vistas
43X05.U=Juego de resultados origen
43X06.U=Fin de subconsulta n\u00FAmero
43X07.U=n\u00FAmero de filas estimado por el optimizador
43X08.U=coste estimado por el optimizador
43X09.U=segundos
43X10.U=Total
43X11.U=Nodo
43X12.U={0} no se ha implementado actualmente para {1}
43X13.U=Suprimir ResultSet mediante
43X14.U=bloqueo de tabla
43X15.U=bloqueo de fila
43X16.U=diferido
43X17.U=Filas suprimidas
43X18.U=\u00CDndices actualizados
43X19.U=Suprimir
43X20.U=ResultSet de agregado escalar distinct
43X21.U=Filas introducidas
43X22.U=Agregado escalar distinct
43X23.U=ResultSet de exploraci\u00F3n distinct para {0} mediante {1} {2}
43X24.U=restricci\u00F3n
43X25.U=\u00EDndice
43X26.U=ResultSet de exploraci\u00F3n distinct para {0}
43X27.U=a nivel de aislamiento {0} mediante bloqueo {1}
43X28.U=informaci\u00F3n de exploraci\u00F3n
43X29.U=Columna distinct es el n\u00FAmero de columna
43X30.U=Columnas distinct son los n\u00FAmeros de columna
43X31.U=Tama\u00F1o de tabla hash
43X32.U=Filas filtradas
43X33.U=tiempo de siguiente en milisegundos/fila
43X34.U=posici\u00F3n de inicio
43X35.U=posici\u00F3n de parada
43X36.U=calificadores de exploraci\u00F3n
43X37.U=calificadores next
43X38.U=sobre {0} mediante {1}
43X39.U=Exploraci\u00F3n distinct
43X40.U=Informaci\u00F3n de ordenaci\u00F3n
43X41.U=ResultSet de agregado agrupado
43X42.U=Tiene agregado distinct
43X43.U=Clasificado
43X44.U=Agregado agrupado
43X45.U=Uni\u00F3n EXISTS hash
43X46.U=ResultSet de uni\u00F3n EXISTS hash
43X47.U=Uni\u00F3n hash
43X48.U=ResultSet de uni\u00F3n hash
43X49.U=Uni\u00F3n externa izquierda hash
43X50.U=ResultSet de uni\u00F3n externa izquierda hash
43X51.U=ResultSet de exploraci\u00F3n hash para {0} mediante {1} {2}
43X52.U=ResultSet de exploraci\u00F3n hash para {0}
43X53.U=Clave hash es el n\u00FAmero de columna
43X54.U=Claves hash son los n\u00FAmero de columna
43X55.U=Exploraci\u00F3n hash
43X56.U=Subconsultas conectadas
43X57.U=ResultSet de tabla hash
43X58.U=Tabla hash
43X59.U=todo
43X60.U=Fila \u00EDndice para ResultSet de fila base para {0}
43X61.U=Columnas accedidas desde heap
43X62.U=para {0}
43X63.U=Fila \u00EDndice para fila base
43X64.U=modalidad de inserci\u00F3n\: inserci\u00F3n general
43X65.U=modalidad de inserci\u00F3n\: normal (imposible realizar inserci\u00F3n general debido a que la tabla no est\u00E1 vac\u00EDa)
43X66.U=modalidad de inserci\u00F3n\: normal
43X67.U=Insertar ResultSet mediante
43X68.U=Filas insertadas
43X69.U=Insertar
43X70.U=Unir
43X71.U=ResultSet de exploraci\u00F3n en \u00EDndice de \u00FAltima clave para {0} mediante \u00EDndice {1}
43X72.U=a nivel de aislamiento {0} mediante bloqueo {1} elegido por el optimizador
43X73.U=Exploraci\u00F3n de tabla
43X74.U=Exploraci\u00F3n de \u00EDndice
43X75.U=sobre {0}
43X76.U=ResultSet materializado
43X77.U=tiempo de creaci\u00F3n de conglomerado temporal (milisegundos)
43X78.U=tiempo de extracci\u00F3n de conglomerado temporal (milisegundos)
43X79.U=Filas vistas desde la izquierda
43X80.U=Filas vistas desde la derecha
43X81.U=Filas devueltas
43X82.U=Juego de resultados izquierdo
43X83.U=Juego de resultados derecho
43X84.U=Uni\u00F3n EXISTS de bucle anidado
43X85.U=ResultSet de uni\u00F3n EXISTS de bucle anidado
43X86.U=Uni\u00F3n de bucle anidado
43X87.U=ResultSet de uni\u00F3n de bucle anidado
43X88.U=Filas derechas devueltas vac\u00EDas
43X89.U=Uni\u00F3n externa izquierda de bucle anidado
43X90.U=ResultSet de uni\u00F3n externa izquierda de bucle anidado
43X91.U=Normalizar ResultSet
43X92.U=ResultSet una vez
43X93.U=ResultSet de proyecci\u00F3n-restricci\u00F3n
43X94.U=restricci\u00F3n
43X95.U=proyecci\u00F3n
43X96.U=tiempo de restricci\u00F3n (milisegundos)
43X97.U=tiempo de proyecci\u00F3n (milisegundos)
43X98.U=Proyecto restricci\u00F3n
43X99.U=ResultSet de fila
43Y00.U=ResultSet de agregado escalar
43Y01.U=Optimizaci\u00F3n de clave de \u00EDndice
43Y02.U=Agregado escalar
43Y03.U=ResultSet insensible a desplazamiento
43Y04.U=N\u00FAmero de lecturas de la tabla hash
43Y05.U=N\u00FAmero de grabaciones en la tabla hash
43Y06.U=Ordenar ResultSet
43Y07.U=Eliminar duplicados
43Y08.U=Ordenar
43Y09.U=ResultSet de exploraci\u00F3n de \u00EDndice para {0} mediante {1} {2}
43Y10.U=ResultSet de exploraci\u00F3n de tabla para {0}
43Y11.U=Bloqueo real utilizado\: nivel de bloqueo de tabla.
43Y12.U=Tama\u00F1o de extracci\u00F3n
43Y13.U=calificadores
43Y14.U=ResultSet de uni\u00F3n
43Y15.U=Uni\u00F3n
43Y16.U=ResultSet de actualizaci\u00F3n mediante bloqueo {0}
43Y17.U=filas actualizadas
43Y18.U=Actualizar
43Y19.U=ResultSet de VTI para {0}
43Y20.U=VTI
43Y21.U=Subconsultas materializadas
43Y22.U=Nombre de sentencia
43Y23.U=Texto de sentencia
43Y24.U=Tiempo de an\u00E1lisis
43Y25.U=Tiempo de enlace
43Y26.U=Tiempo de optimizaci\u00F3n
43Y27.U=Tiempo de generaci\u00F3n
43Y28.U=Tiempo de compilaci\u00F3n
43Y29.U=Tiempo de ejecuci\u00F3n
43Y30.U=Indicaci\u00F3n de la hora de inicio de compilaci\u00F3n
43Y31.U=Indicaci\u00F3n de la hora de fin de compilaci\u00F3n
43Y32.U=Indicaci\u00F3n de la hora de inicio de ejecuci\u00F3n
43Y33.U=Indicaci\u00F3n de la hora de fin de ejecuci\u00F3n
43Y44.U=Texto del plan de ejecuci\u00F3n de sentencia
43Y45.U=Tiempo de ejecuci\u00F3n 100%, {0} segundos
43Y46.U=Insertar ResultSet de VTI
43Y47.U=Suprimir ResultSet de VTI
43Y49.U=Insertar VTI
43Y50.U=Suprimir VTI
43Y51.U=Suprimir Cascade ResultSet
43Y52.U=Suprimir utilizaci\u00F3n de Cascade ResultSet
43Y53.U=Acciones de referencia en tablas dependientes
43Y54.U=Iniciar acci\u00F3n de referencia en n\u00FAmero de tabla dependiente
43Y55.U=Finalizar acci\u00F3n de referencia en n\u00FAmero de tabla dependiente
43Y56.U=Los modificadores de optimizador proporcionados por el usuario en {0} son {1}
43Y57.U=Los modificadores de optimizador proporcionados por el usuario para uni\u00F3n son {0}
43Y58.U=Intersect ResultSet
43Y59.U=Intersect
43Y60.U=Except ResultSet
43Y61.U=Except
44X00.U=Nombre de tipo SQL
44X05.U=error siguiente
46001=Excepci\u00F3n al acceder al archivo jar mediante el URL ''{0}''.
46J01=La signatura del m\u00E9todo Java tiene un formato no v\u00E1lido.
46J02=La signatura del m\u00E9todo Java contiene un n\u00FAmero incorrecto ({0}) de par\u00E1metros, se esperaba {1}.
54002=Una constante de serie que comienza por ''{0}'' es demasiado larga.
54004=La sentencia SELECT tiene demasiados elementos en GROUP BY, ORDER BY o lista de selecci\u00F3n.
54006=La longitud resultante de la operaci\u00F3n {0} es mayor que {1}.
54008=La sentencia CREATE INDEX especifica demasiadas columnas (16 es el n\u00FAmero m\u00E1ximo).
54011=Se han especificado demasiadas columnas ({0}) para la tabla o vista {1}. El l\u00EDmite es {2}.
54023=Se ha excedido el l\u00EDmite del n\u00FAmero de par\u00E1metros para un procedimiento. El l\u00EDmite es {0} y el n\u00FAmero de par\u00E1metros del procedimiento {1} es {2}.
54038=Se ha excedido la profundidad m\u00E1xima de desencadenantes anidados.
57017.C=No existe ninguna conversi\u00F3n disponible para la p\u00E1gina de c\u00F3digos de origen, {0}, a la p\u00E1gina de c\u00F3digos de destino, {1}.  La conexi\u00F3n se ha finalizado.
58009.C.10=Excepci\u00F3n de protocolo de red\: s\u00F3lo una longitud de VCM o VCS puede ser mayor que 0.  La conexi\u00F3n se ha finalizado.
58009.C.11=La conexi\u00F3n se ha finalizado porque la codificaci\u00F3n no est\u00E1 soportada.
58009.C.12=Excepci\u00F3n de protocolo de red\: el punto de c\u00F3digo real, {0}, no coincide con el punto de c\u00F3digo esperado, {1}.  La conexi\u00F3n se ha finalizado.
58009.C.13=Excepci\u00F3n de protocolo de red\: la colecci\u00F3n DDM contiene menos de 4 bytes de datos.  La conexi\u00F3n se ha finalizado.
58009.C.14=Excepci\u00F3n de protocolo de red\: la pila de la colecci\u00F3n no est\u00E1 vac\u00EDa al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
58009.C.15=Excepci\u00F3n de protocolo de red\: la longitud de DSS no es 0 al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
58009.C.16=Excepci\u00F3n de protocolo de red\: DSS encadenado con el mismo id al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
58009.C.17=Excepci\u00F3n de protocolo de red\: se ha alcanzado de forma prematura el final de la corriente al leer InputStream, par\u00E1metro \#{0}.  La conexi\u00F3n se ha finalizado.
58009.C.18=Excepci\u00F3n de protocolo de red\: FDOCA LID no v\u00E1lido.  La conexi\u00F3n se ha finalizado.
58009.C.19=Excepci\u00F3n de protocolo de red\: no se ha devuelto SECTKN.  La conexi\u00F3n se ha finalizado.
58009.C.20=Excepci\u00F3n de protocolo de red\: s\u00F3lo uno de NVCM o NVCS puede ser no nulo.  La conexi\u00F3n se ha finalizado.
58009.C.21=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBNAM.  La conexi\u00F3n se ha finalizado.
58009.C.7=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBCOLID.  La conexi\u00F3n se ha finalizado.
58009.C.8=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para PKGID.  La conexi\u00F3n se ha finalizado.
58009.C.9=Excepci\u00F3n de protocolo de red\: la longitud PKGNAMCSN, {0}, no es v\u00E1lida en SQLAM {1}.  La conexi\u00F3n se ha finalizado.
58010.C=Se ha encontrado un error de protocolo de red.  No se ha podido establecer una conexi\u00F3n debido a que el gestor {0} en el nivel {1} no est\u00E1 soportado en el servidor. 
58014.C=El mandato de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
58015.C=El objeto de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
58016.C=El par\u00E1metro de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
58017.C=El valor del par\u00E1metro de DDM 0x{0} no est\u00E1 soportado.  Es posible que una variable de lenguaje principal de entrada no est\u00E9 dentro del rango que soporta el servidor.  La conexi\u00F3n se ha finalizado.
A001=MUY GRAVE\: no existe servicio de autenticaci\u00F3n para el sistema
A002=MUY GRAVE\: no existe servicio de autenticaci\u00F3n para la base de datos
A011=AVISO\: no se ha mencionado ning\u00FAn nombre de servidor/sistema principal LDAP en la propiedad {0}; se asume localhost\:389
A020=Autenticaci\u00F3n no v\u00E1lida.
C000=Se ha grabado la clase {0} en el archivo {1}. Proporcione a soporte el archivo y la informaci\u00F3n de excepci\u00F3n siguiente\: {2}
C001=La clase {0} tiene un tipo de certificado desconocido en el jar {1}, se esperaba un certificado X509.
C002=Se ha generado una excepci\u00F3n de seguridad al acceder a la clase {0} del jar {1} \: {2}
C003=Excepci\u00F3n al cargar el jar de base de datos {0} - {1}
C004=Cargador de clases obsoleto para la clase {0}
C005=Cargador de clases de base de datos iniciado - derby.database.classpath\=''{0}''
C006=Se ha cargado {0} desde el jar de base de datos {1}
C007=Excepci\u00F3n al cargar la clase {0} desde el jar {1} - {2}
D001=\:\n Arrancando Derby versi\u00F3n {0}\: instancia {1}\nen el directorio de base de datos {2} {3} \n
D002=\:\nConcluyendo instancia {0}
D004=Copia de seguridad iniciada para la base de datos situada en {0} a {1}.
D005=se ha movido la copia de seguridad antigua de {0} a {1}
D006=Se ha completado la copia de seguridad del segmento de datos a {0}. 
D007=se ha editado service.properties de la base de datos para utilizar el dispositivo de anotaci\u00F3n cronol\u00F3gica por omisi\u00F3n
D008=error editando service.properties de la base de datos, copia de seguridad terminada anormalmente\: {0}
D009=se ha copiado el directorio de anotaci\u00F3n cronol\u00F3gica de {0} a {1}
D010=Copia de seguridad terminada anormalmente debido a un error
D011=se ha eliminado la copia de seguridad antigua de {0}
D012=Copia de seguridad completada, instancia de anotaci\u00F3n cronol\u00F3gica en {0} \n
D013=AVISO\: La base de datos se ha arrancado mediante {0}\={1}. En esta modalidad, es posible que la base de datos no se pueda recuperar, las transacciones comprometidas se podr\u00EDan perder, y la base de datos podr\u00EDa estar en un estado no coherente. Por favor, utilice esta modalidad \u00FAnicamente cuando estas consecuencias sean aceptables. \n
D014=en modalidad S\u00D3LO LECTURA
I015=org.apache.derby.jdbc.EmbeddedDriver no se ha registrado con el gestor de controladores JDBC
I024=Base de datos no disponible
I025=Controlador JDBC no disponible
I026=El registro de controlador JDBC con java.sql.DriverManager ha fallado\: {0}
J004=identidad de base de datos
J005=concluir Derby
J007=crear base de datos
J008=sin detalles
J010=cifrar base de datos en disco
J013=actualizar base de datos
J016=suministrador de servicio criptogr\u00E1fico
J017=algoritmo criptogr\u00E1fico
J018=longitud de clave de cifrado
J019=clave de cifrado externa
J020=clave de cifrado secreta
J021=territorio de la base de datos
J022=nombre usuario
J023=contrase\u00F1a de usuario
J025=v\u00EDa de acceso del directorio de anotaci\u00F3n cronol\u00F3gica
J028=v\u00EDa de acceso de seguridad para la recuperaci\u00F3n en avance
J031=ordenaci\u00F3n para tipos de datos de caracteres
J100=No se puede encontrar la clase del servidor de red, {0}. La v\u00EDa de acceso a la clase deber\u00EDa contener derbynet.jar.
J101=No se puede cargar la clase del servidor de red, {0}. {1}  Compruebe la integridad del archivo derbynet.jar.
J102=Se ha generado una excepci\u00F3n al iniciar el servidor de red. {0}
J103=Se ha generado una excepci\u00F3n al cerrar el servidor de red. {0}
J104=El objeto ya est\u00E1 cerrado.
J105=\u00A1La precisi\u00F3n excede de 31 d\u00EDgitos\!
J106=a causa de la excepci\u00F3n
J107=Error para el elemento del proceso por lotes \#
J108=El gestor de seguridad no permite acceder a la propiedad del sistema {0}.
J109=Se ha detectado una configuraci\u00F3n de cliente TCP/IP incorrecto.  No se puede determinar la direcci\u00F3n IP del sistema principal local\: ''{0}''.  Aseg\u00FArese de que la m\u00E1quina cliente tenga configurada correctamente la direcci\u00F3n IP.
J110=mecanismo de seguridad no soportado
J111=falta contrase\u00F1a
J112=falta id de usuario
J113=id de usuario o contrase\u00F1a no v\u00E1lidos
J114=id de usuario revocado
J115=contrase\u00F1a nueva no v\u00E1lida
J116=error no reintentable del servicio de seguridad local
J117=falta SECTKN en ACCSEC cuando es necesario o no es v\u00E1lido
J118=contrase\u00F1a caducada
J120=no se ha especificado
J121=el usuario no tiene autorizaci\u00F3n para acceder a la base de datos
J122=se ha emitido un mandato que solicita servicios de la base de datos antes del mandato que solicita acceso a la base de datos (ACCRDB)
J123=el mandato solicitado ha encontrado una condici\u00F3n espec\u00EDfica de la implementaci\u00F3n y sin arquitectura para la cual no existe ning\u00FAn mensaje con arquitectura
J124=el mandato de acceso a base de datos relacional (ACCRDB) no se puede emitir porque ya se ha accedido actualmente a la base de datos
J125=se ha detectado un error de discrepancia de descriptor de datos.
J126=se ha detectado un error de protocolo de conversaci\u00F3n.  Raz\u00F3n\: 0x{0}.
J127=parseSQLDIAGGRP todav\u00EDa no se ha implementado
J128=el cursor no est\u00E1 abierto
J129=se ha emitido un mandato Open Query (Abrir consulta) para una consulta que ya estaba abierta
J130=Se ha detectado un error de descripci\u00F3n de FDOCA no v\u00E1lido de PROTOCOL
J131=Se ha detectado un error de sintaxis de la secuencia de datos del protocolo.  Raz\u00F3n\: 0x{0}. \u00BFSe ha intentado establecer una conexi\u00F3n no cifrada con un servidor SSL?
J132=El nombre de usuario para la conexi\u00F3n
J133=La contrase\u00F1a de usuario para la conexi\u00F3n
J134=No se permiten valores negativos para la propiedad maxStatements\: {0}
L001=------------  PRINCIPIO DE MENSAJE DE ERROR -------------\n
L002=------------  FIN DE MENSAJE DE ERROR -------------\n
L003=\n-------  COMENZANDO PILA DE ERROR DE CONCLUSI\u00D3N ----\n
L004=\n------------  FIN DE PILA DE ERROR DE CONCLUSI\u00D3N ----\n
L005=\n------------  PRINCIPIO DE PILA DE ERRORES -------------\n
L006=\n------------  FIN DE PILA DE ERRORES -------------\n
L007=AVISO\: archivo de anotaciones cronol\u00F3gicas no encontrado, creando uno nuevo. Posible inconsistencia en la base de datos
L008=Suprimiendo Logfile antiguo incompatible {0}
L009=Suprimiendo Logfile antiguo {0}
L010=Se ha detectado un registro de anotaci\u00F3n cronol\u00F3gica incompleto en el archivo {0}, borrando el archivo de anotaciones cronol\u00F3gicas desde la posici\u00F3n {1} hasta el fin de archivo en {2}.
L011=El daemon de punto de control ha capturado una excepci\u00F3n est\u00E1ndar
L012=El registro de anotaci\u00F3n cronol\u00F3gica no es el primero pero la transacci\u00F3n no est\u00E1 en una tabla de transacci\u00F3n\: {0}
L013=El registro de anotaci\u00F3n cronol\u00F3gica es el primero pero la transacci\u00F3n ya est\u00E1 en la tabla de transacci\u00F3n\: {0}
L014=Instante de inicio incorrecto
L015=existe un nuevo archivo de anotaciones cronol\u00F3gicas y no puede suprimirse {0}
L016=no se puede crear un nuevo archivo de anotaciones cronol\u00F3gicas {0}
L017=no se puede crear un nuevo archivo de anotaciones cronol\u00F3gicas {0} debido a {1}
L018=El sistema puede estar en un estado inconsistente, falta el archivo {0}
L020=AVISO\: La base de datos se ha arrancado al menos una vez mediante {0}\={1}. Como resultado de esta modalidad utilizada, es posible que la base de datos no se pueda recuperar, las transacciones comprometidas se podr\u00EDan perder, y la base de datos podr\u00EDa estar en un estado no coherente. Esto podr\u00EDa originar errores inesperados.\n
L021=AVISO\: La base de datos se ha arrancado previamente o actualmente mediante {0} establecido en {1}. Tenga en cuenta que esta modalidad {0}\={1} no garantiza la recuperabilidad, y es probablemente lo que podr\u00EDa haber originado este error de arranque.\n
M001=\n\# ********************************************************************\n\# ***                   NO edite este archivo.                 ***\n\# ***   SI CAMBIA SU CONTENIDO PODR\u00CDA CAUSAR DA\u00D1OS EN LOS DATOS. ***\n\# ********************************************************************
R001=----  INICIO DE MENSAJE DE ERROR DE REPETICI\u00D3N ({0}) ----
R002=--------------------  FIN DE MENSAJE DE ERROR DE REPETICI\u00D3N ---------------------
R003=Se ha iniciado la funci\u00F3n de repetici\u00F3n secundaria para la base de datos ''{0}''.
R004=Se ha detenido la funci\u00F3n de repetici\u00F3n secundaria para la base de datos ''{0}''.
R005=La repetici\u00F3n secundaria ha generado un error grave para la base de datos ''{0}''. Se detendr\u00E1 la repetici\u00F3n.
R006=Se ha perdido la conexi\u00F3n con la repetici\u00F3n principal de la base de datos ''{0}''.
R007=Se ha iniciado la funci\u00F3n de repetici\u00F3n principal para la base de datos ''{0}''.
R008=Se ha detenido la funci\u00F3n de repetici\u00F3n principal para la base de datos ''{0}''.
R009=Ha habido una excepci\u00F3n durante el env\u00EDo de registros.
R010=La repetici\u00F3n principal intenta volver a conectarse con la secundaria para la base de datos ''{0}''.
R011=La base de datos de repeticiones secundarias ''{0}'' escucha las conexiones de la principal en ''{1}\:{2}''.
R012=Control de conexi\u00F3n de repeticiones no v\u00E1lido.
R013=Mensaje de repetici\u00F3n ({0})\: {1}
R020=Conmutaci\u00F3n por error efectuada correctamente para la base de datos ''{0}''.
S0022=Columna ''{0}'' no encontrada.
X0A00.S=La lista de selecci\u00F3n menciona la columna ''{0}'' dos veces. Esto no se permite en consultas con las cl\u00E1usulas GROUP BY o HAVING. Intente crear un alias de una de las columnas en conflicto que sea un nombre exclusivo.
X0X02.S=La tabla ''{0}'' no se puede bloquear en modalidad ''{1}''.
X0X03.S=Estado de transacci\u00F3n no v\u00E1lido - el cursor retenido necesita el mismo nivel de aislamiento
X0X05.S=La tabla/vista ''{0}'' no existe.
X0X07.S=No se puede eliminar el archivo jar ''{0}'' porque est\u00E1 en derby.database.classpath ''{0}''.
X0X0D.S=Longitud de matriz de columna no v\u00E1lida ''{0}''. Para devolver claves generadas, la matriz de columna debe ser de longitud 1 y contener la columna de identidad.
X0X0E.S=La tabla ''{1}'' no contiene ninguna columna generada autom\u00E1ticamente en la posici\u00F3n de columna ''{0}''.
X0X0F.S=La tabla ''{1}'' no contiene ninguna columna generada autom\u00E1ticamente que se llame ''{0}''.
X0X10.S=La cl\u00E1usula USING ha devuelto m\u00E1s de una fila; solamente se permiten ResultSets de una sola fila.
X0X11.S=La cl\u00E1usula USING no ha devuelto ning\u00FAn resultado, por tanto no se pueden establecer par\u00E1metros. 
X0X13.S=El archivo jar ''{0}'' no existe en el esquema ''{1}''.
X0X57.S=Se ha realizado un intento de situar un valor Java de tipo ''{0}'' en un valor SQL, pero no existe el tipo SQL correspondiente.  El valor Java es probablemente el resultado de una llamada de m\u00E9todo o acceso de campo.
X0X60.S=Ya existe un cursor con el nombre ''{0}''.
X0X61.S=Los valores para la columna ''{4}'' del \u00EDndice ''{0}'' y la tabla ''{1}.{2}'' no coinciden con la ubicaci\u00F3n de fila {3}.  El valor del \u00EDndice es ''{5}'', mientras que el valor de la tabla base es ''{6}''.  La clave de \u00EDndice completa, incluida la ubicaci\u00F3n de la fila, es ''{7}''.  La acci\u00F3n correctiva sugerida es volver a crear el \u00EDndice.
X0X62.S=Se ha encontrado una incoherencia entre la tabla ''{0}'' y el \u00EDndice ''{1}''.  Error al intentar recuperar la ubicaci\u00F3n de la fila ''{2}'' de la tabla.  La clave de \u00EDndice completa, incluida la ubicaci\u00F3n de la fila, es ''{3}''. La acci\u00F3n correctiva sugerida es volver a crear el \u00EDndice.
X0X63.S=Se ha obtenido una excepci\u00F3n de E/S (IOException) ''{0}''.
X0X67.S=Las columnas de tipo ''{0}'' no se pueden utilizar en sentencias CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT o DISTINCT, porque no se soportan las comparaciones de ese tipo.
X0X81.S={0} ''{1}'' no existe.
X0X85.S=No se ha creado el \u00EDndice ''{0}'' porque ''{1}'' no es un tipo de \u00EDndice v\u00E1lido.
X0X86.S=0 es un valor de par\u00E1metro no v\u00E1lido para ResultSet.absolute(int row).
X0X87.S=No se puede llamar a ResultSet.relative(int row) si el cursor no est\u00E1 situado sobre una fila.
X0X95.S=No se puede realizar la operaci\u00F3n ''{0}'' sobre el objeto ''{1}'' porque existe un ResultSet abierto que depende de ese objeto.
X0X99.S=El \u00EDndice ''{0}'' no existe.
X0Y16.S=''{0}'' no es una vista.  Si es una tabla utilice en su lugar DROP TABLE.
X0Y23.S=No se puede realizar la operaci\u00F3n ''{0}'' sobre el objeto ''{1}'' porque VIEW ''{2}'' depende de ese objeto.
X0Y24.S=No se puede realizar la operaci\u00F3n ''{0}'' sobre el objeto ''{1}'' porque STATEMENT ''{2}'' depende de se objeto.
X0Y25.S=No se puede realizar la operaci\u00F3n ''{0}'' sobre el objeto ''{1}'' porque {2} ''{3}'' depende de ese objeto.
X0Y26.S=Es necesario que el \u00EDndice ''{0}'' est\u00E9 en el mismo esquema que la tabla ''{1}''.
X0Y28.S=No se puede crear el \u00EDndice ''{0}'' en la tabla del sistema ''{1}''.  Los usuarios no pueden crear \u00EDndices en tablas del sistema.
X0Y32.S={0} ''{1}'' ya existe en {2} ''{3}''.
X0Y38.S=No se puede crear el \u00EDndice ''{0}'' porque la tabla ''{1}'' no existe.
X0Y41.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida porque la tabla referenciada {1} no tiene una clave primaria.  A\u00F1ada una clave primaria a {1} o especifique expl\u00EDcitamente las columnas de una restricci\u00F3n \u00FAnica a las que haga referencia esta clave for\u00E1nea. 
X0Y42.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida\: los tipos de las columnas de la clave for\u00E1nea no coinciden con los tipos de las columnas referenciadas.
X0Y43.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida\: el n\u00FAmero de columnas de {0}({1}) no coincide con el n\u00FAmero de columnas de la clave referenciada ({2}).
X0Y44.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida\: no existe una restricci\u00F3n de clave \u00FAnica o primaria sobre la tabla ''{1}'' que coincida con el n\u00FAmero y tipos de las columnas de la clave primaria.
X0Y45.S=La restricci\u00F3n de clave for\u00E1nea ''{0}'' no se puede a\u00F1adir o habilitar sobre la tabla {1} porque una o m\u00E1s claves for\u00E1neas no tienen claves referenciadas coincidentes.  
X0Y46.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida\: la tabla referenciada {1} no existe.
X0Y54.S=El esquema ''{0}'' no se puede eliminar porque no est\u00E1 vac\u00EDo.
X0Y55.S=El n\u00FAmero de filas de la tabla base no coincide con el n\u00FAmero de filas de al menos 1 de los \u00EDndices de la tabla. El \u00EDndice ''{0}'' de la tabla ''{1}.{2}'' tiene {3} filas, pero la tabla base tiene {4} filas.  La acci\u00F3n correctiva sugerida es volver a crear el \u00EDndice.
X0Y56.S=''{0}'' no se permite en la tabla del sistema ''{1}''.
X0Y57.S=No se puede a\u00F1adir una columna que no acepta nulos a la tabla ''{0}'' porque la tabla contiene al menos una fila. Las columnas que no aceptan nulos s\u00F3lo pueden a\u00F1adirse en tablas vac\u00EDas.
X0Y58.S=Se ha intentado a\u00F1adir una restricci\u00F3n de clave primaria en la tabla ''{0}'' y no se ha podido porque la tabla ya tiene una restricci\u00F3n de ese tipo.  Una tabla puede tener una sola restricci\u00F3n de clave primaria.
X0Y59.S=Se ha intentado a\u00F1adir o habilitar la(s) restricci\u00F3n(es) sobre la tabla ''{1}'' y no se ha podido porque la tabla contiene {2} fila(s) que infringe(n) la(s) restricci\u00F3n(es) de comprobaci\u00F3n siguiente(s)\: {0}.
X0Y63.S=El mandato de la tabla ''{0}'' no ha sido satisfactorio porque se han encontrado datos nulos en la(s) columna(s) de clave primaria o restricci\u00F3n/\u00EDndice \u00FAnico. Todas las columnas de una clave primaria o de \u00EDndice \u00FAnico deben ser no nulas.  
X0Y66.S=No se puede emitir comprometer en una conexi\u00F3n anidada si existe una operaci\u00F3n pendiente en la conexi\u00F3n padre.
X0Y67.S=No se puede emitir retrotraer en una conexi\u00F3n anidada si existe una operaci\u00F3n pendiente en la conexi\u00F3n padre.
X0Y68.S={0} ''{1}'' ya existe.
X0Y69.S={1} no se admite en el desencadenante {0}.
X0Y70.S=No se permite INSERT, UPDATE y DELETE sobre la tabla {1} porque el desencadenante {0} est\u00E1 activo.
X0Y71.S=No se permite la manipulaci\u00F3n de transacciones como SET ISOLATION porque el desencadenante {0} est\u00E1 activo.
X0Y72.S=La sustituci\u00F3n mediante inserci\u00F3n general no est\u00E1 permitida en ''{0}'' porque tiene un desencadenante habilitado ({1}).
X0Y77.S=No se puede emitir establecer el nivel de aislamiento de la transacci\u00F3n sobre una transacci\u00F3n global que est\u00E9 en proceso porque podr\u00EDa haber comprometido impl\u00EDcitamente la transacci\u00F3n global.
X0Y78.S.1=No se puede llamar {0}.executeQuery() porque se han devuelto m\u00FAltiples conjuntos de resultados.  Utilice {1}.execute() para obtener m\u00FAltiples resultados.
X0Y78.S.2=Se ha llamado a {0}.executeQuery() pero no se ha devuelto ning\u00FAn conjunto de resultados. Utilice {1}.executeUpdate() si no se trata de consultas.
X0Y78.S=No se puede llamar Statement.executeQuery() con una sentencia que devuelve una cuenta de columnas.
X0Y79.S=No se puede llamar Statement.executeUpdate() con una sentencia que devuelve un ResultSet.
X0Y80.S=Error de ALTER tabla ''{0}''. Se han encontrado datos nulos en la columna ''{1}''.
X0Y83.S=AVISO\: al suprimir una fila de la tabla no se ha encontrado la fila de \u00EDndice de la fila de la tabla base {0} en el \u00EDndice con el id de conglomerado {1}.  Este problema se ha corregido autom\u00E1ticamente como parte de la operaci\u00F3n de supresi\u00F3n.
XBCA0.S=No se puede crear un nuevo objeto con la clave {1} en antememoria {0}. El objeto ya existe en la antememoria. 
XBCM1.S=Error de enlace Java generado durante la carga de la clase generada {0}.
XBCM2.S=No se puede crear una instancia de la clase generada {0}.
XBCM3.S=El m\u00E9todo {1}() no existe en la clase generada {0}.
XBCM4.S=Se ha excedido el l\u00EDmite o los l\u00EDmites de formato de clase Java\: {1} en la clase generada {0}.
XBCX0.S=Excepci\u00F3n del suministrador de cifrado. Consulte la excepci\u00F3n siguiente para obtener detalles.
XBCX1.S=Inicializando cifrado con modalidad no permitida, debe ser ENCRYPT o DECRYPT.
XBCX2.S=Inicializando cifrado con una contrase\u00F1a de arranque demasiado corta. La contrase\u00F1a debe tener al menos {0} caracteres de longitud.    
XBCX5.S=No se puede cambiar la contrase\u00F1a de arranque a nulo.
XBCX6.S=No se puede cambiar la contrase\u00F1a de arranque a un tipo serializable distinto de serie.
XBCX7.S=Formato incorrecto para cambiar la contrase\u00F1a de arranque.  El formato debe ser\: contrase\u00F1a_arranque_anterior, contrase\u00F1a_arranque_nueva.
XBCX8.S=No se puede cambiar la contrase\u00F1a de arranque de una base de datos no cifrada.
XBCX9.S=No se puede cambiar la contrase\u00F1a de arranque de una base de datos de solo lectura.  
XBCXA.S=Contrase\u00F1a de arranque incorrecta.
XBCXB.S=Relleno de cifrado ''{0}'' incorrecto o no se ha especificado relleno. Se debe utilizar ''NoPadding''.
XBCXC.S=El algoritmo de cifrado ''{0}'' no existe. Compruebe que el suministrador ''{1}'' elegido ofrezca soporte para este algoritmo.
XBCXD.S=El algoritmo de cifrado no se puede cambiar despu\u00E9s de crear la base de datos.
XBCXE.S=El suministrador de cifrado no se puede cambiar despu\u00E9s de crear la base de datos.
XBCXF.S=No se puede encontrar la clase ''{0}'' que representa el suministrador de cifrado.
XBCXG.S=El suministrador de cifrado ''{0}'' no existe.
XBCXH.S=El algoritmo de cifrado ''{0}'' no est\u00E1 en el formato correcto. El formato correcto es algoritmo/modalidadRetroalimentaci\u00F3n/NoPadding.
XBCXI.S=La modalidad de retroalimentaci\u00F3n ''{0}'' no est\u00E1 soportada. Las modalidades de retroalimentaci\u00F3n soportadas son CBC, CFB, OFB y ECB.
XBCXJ.S=La aplicaci\u00F3n est\u00E1 utilizando una versi\u00F3n de JCE (Java Cryptography Extension) anterior a la 1.2.1.  Actualice a JCE 1.2.1 e intente de nuevo la operaci\u00F3n.    
XBCXK.S=La clave de cifrado proporcionada no coincide con la clave de cifrado utilizada al crear la base de datos. Aseg\u00FArese de utilizar la clave de cifrado correcta e int\u00E9ntelo de nuevo. 
XBCXL.S=El proceso de verificaci\u00F3n para la clave de cifrado no ha sido satisfactorio. Esto puede haber estado causado por un error al acceder al archivo apropiado para llevar a cabo el proceso de verificaci\u00F3n.  Consulte la excepci\u00F3n siguiente para obtener detalles.  
XBCXM.S=La longitud de la clave de cifrado externa debe ser un n\u00FAmero par.
XBCXN.S=La clave de cifrado externa contiene uno o m\u00E1s caracteres no permitidos. Los caracteres permitidos para un n\u00FAmero hexadecimal son 0-9, a-f y A-F.
XBCXO.S=No se puede cifrar la base de datos cuando existe una transacci\u00F3n global en estado de preparada.
XBCXP.S=No se puede volver a cifrar la base de datos con una nueva contrase\u00F1a de arranque o una clave de cifrado externa cuando existe una transacci\u00F3n global en estado de preparada.
XBCXQ.S=No se puede configurar una base de datos de s\u00F3lo lectura para cifrado.
XBCXR.S=No se puede volver a cifrar una base de datos de s\u00F3lo lectura con una nueva contrase\u00F1a de arranque o una clave de de cifrado externa.
XBCXS.S=No se puede configurar una base de datos para cifrado cuando la base de datos est\u00E1 en modalidad de registro de archivado.
XBCXT.S=No se puede volver a cifrar una base de datos con una nueva contrase\u00F1a de arranque o una clave de cifrado externa cuando la base de datos est\u00E1 en modalidad de registro de archivado.
XBCXU.S=El cifrado de una base de datos no cifrada ha sido err\u00F3neo\: {0}
XBCXV.S=El cifrado de una base de datos cifrada con una nueva clave o una nueva contrase\u00F1a ha sido err\u00F3neo\: {0}
XBM01.D=Error de arranque debido a una excepci\u00F3n. Consulte la excepci\u00F3n siguiente para obtener detalles. 
XBM02.D=Error de arranque debido a una falta de funcionalidad para {0}. Aseg\u00FArese de que la classpath incluya el software Derby correcto.
XBM03.D=El valor ''{0}'' suministrado como sistema de ordenaci\u00F3n no es v\u00E1lido. Se esperaba UCS_BASIC o TERRITORY_BASED.
XBM04.D=Admisi\u00F3n de intercalaci\u00F3n no disponible de JVM para la configuraci\u00F3n regional de la base de datos ''{0}''.
XBM05.D=Error de arranque debido a la falta de informaci\u00F3n sobre la versi\u00F3n del producto para {0}.
XBM06.D=Error de arranque. No se puede acceder a una base de datos cifrada sin la contrase\u00F1a de arranque correcta.  
XBM07.D=Error de arranque. La contrase\u00F1a de arranque debe tener al menos 8 bytes de longitud.
XBM08.D=No se ha podido generar la instancia de la clase StorageFactory {1} de {0}.
XBM0G.D=No se ha podido iniciar el motor de cifrado. Aseg\u00FArese de que est\u00E1 ejecutando Java 2 y que ha bajado un suministrador de cifrado como jce y lo ha situado en la v\u00EDa de acceso de clase. 
XBM0H.D=No se puede crear el directorio {0}.
XBM0I.D=No se puede eliminar el directorio {0}.
XBM0J.D=El directorio {0} ya existe.
XBM0K.D=Subprotocolo desconocido para el nombre de base de datos {0}.
XBM0L.D=La clase de esquema de autenticaci\u00F3n especificada {0} implementa la interfaz de autenticaci\u00F3n {1}.
XBM0M.D=Error al crear la instancia de la clase de esquema de autenticaci\u00F3n {0}.
XBM0N.D=No se ha podido registrar el controlador JDBC con java.sql.DriverManager. Consulte la excepci\u00F3n siguiente para obtener detalles. 
XBM0P.D=El suministrador de servicio es de s\u00F3lo lectura. Operaci\u00F3n no permitida. 
XBM0Q.D=No se encontr\u00F3 el archivo {0}. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrompida.
XBM0R.D=No se pudo eliminar el archivo {0}.  
XBM0S.D=No es posible renombrar el archivo ''{0}'' como ''{1}''
XBM0T.D=Subprotocolo ambiguo para el nombre de base de datos {0}.   
XBM0U.S=No se han registrado clases para el identificador {0}.
XBM0V.S=Se ha generado una excepci\u00F3n al cargar la clase {1} registrada para el identificador {0}.
XBM0W.S=Se ha generado una excepci\u00F3n al crear una instancia de la clase {1} registrada para el identificador {0}.
XBM0X.D=La descripci\u00F3n de territorio suministrada ''{0}'' no es v\u00E1lida, se esperaba ln[_CO[_variante]]\nln\=c\u00F3digo de idioma ISO-639 de dos letras en min\u00FAsculas, CO\=c\u00F3digo de pa\u00EDs ISO-3166 de dos letras en may\u00FAsculas, consulte java.util.Locale.
XBM0Y.D=No se encontr\u00F3 el directorio de copia de seguridad de base de datos {0}. Aseg\u00FArese de que la v\u00EDa de acceso para las copias de seguridad que se ha especificado sea la correcta.
XBM0Z.D=No es posible copiar el archivo ''{0}'' como ''{1}''. Aseg\u00FArese de que haya suficiente espacio y que los permisos sean los adecuados. 
XCL01.S=El conjunto de resultados no devuelve filas. Operaci\u00F3n {0} no permitida. 
XCL05.S=Activaci\u00F3n cerrada, operaci\u00F3n {0} no permitida.
XCL07.S=El cursor ''{0}'' est\u00E1 cerrado. Verifique que AutoCommit sea OFF.
XCL08.S=El cursor ''{0}'' no est\u00E1 sobre una fila.
XCL09.S=Se ha pasado una activaci\u00F3n al m\u00E9todo ''{0}'' que no coincide con el PreparedStatement.
XCL10.S=Se ha recompilado un PreparedStatement y los par\u00E1metros han cambiado. Si utiliza JDBC debe preparar la sentencia de nuevo.  
XCL12.S=Se ha intentado colocar un valor de datos de tipo ''{0}'' en un valor de datos de tipo ''{1}''.
XCL13.S=La posici\u00F3n del par\u00E1metro ''{0}'' est\u00E1 fuera de rango.  El n\u00FAmero de par\u00E1metros de esta sentencia preparada es ''{1}''.
XCL14.S=La posici\u00F3n de la columna ''{0}'' est\u00E1 fuera de rango.  El n\u00FAmero de columnas de esta sentencia ResultSet es ''{1}''.
XCL15.S=Se ha producido una ClassCastException al llamar al m\u00E9todo compareTo() sobre un objeto ''{0}''.  El par\u00E1metro para compareTo() es de clase ''{1}''.
XCL16.S.0=ResultSet no abierto. Operaci\u00F3n ''{0}'' no permitida. Verifique que AutoCommit sea OFF.
XCL16.S.1=ResultSet no abierto.  Verifique que AutoCommit sea OFF.
XCL17.S=Sentencia no permitida en esta base de datos.
XCL18.S=La corriente del valor de columna del resultado no se puede recuperar dos veces
XCL19.S=Falta fila en la tabla ''{0}'' para la clave ''{1}''.
XCL20.S=Los cat\u00E1logos del nivel de versi\u00F3n ''{0}'' no pueden actualizarse al nivel de versi\u00F3n ''{1}''.
XCL21.S=Est\u00E1 intentando ejecutar una sentencia de definici\u00F3n de datos (CREATE, DROP o ALTER) mientras prepara una sentencia diferente. No est\u00E1 permitido. Puede suceder si ejecuta una sentencia de definici\u00F3n de datos desde un inicializador est\u00E1tico de una clase Java que se est\u00E1 utilizando desde una sentencia SQL.
XCL22.S=No es posible registrar el par\u00E1metro ''{0}'' como un par\u00E1metro OUT puesto que es un par\u00E1metro IN. 
XCL23.S=El n\u00FAmero de tipo SQL ''{0}'' no es un tipo soportado por registerOutParameter().
XCL24.S=El par\u00E1metro {0} parece ser un par\u00E1metro de salida, pero no ha sido designado de esa forma por registerOutParameter().  Si no es un par\u00E1metro de salida, entonces debe establecerse como del tipo {1}.
XCL25.S=El par\u00E1metro {0} no puede registrarse como del tipo {1} porque se correlaciona con el tipo {2} y son incompatibles.
XCL26.S=El par\u00E1metro {0} no es un par\u00E1metro de salida.
XCL27.S=No se puede establecer devolver par\u00E1metros de salida.
XCL30.S=Se ha generado una excepci\u00F3n de E/S al leer ''{0}'' de una InputStream.
XCL31.S=Sentencia cerrada.
XCL33.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de normas de supresi\u00F3n. (La relaci\u00F3n es de autoreferencia y ya existe una relaci\u00F3n de autoreferencia con la norma de supresi\u00F3n SET NULL). 
XCL34.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de normas de supresi\u00F3n. (La relaci\u00F3n forma un ciclo de dos o m\u00E1s tablas que hacen que la tabla est\u00E9 conectada para suprimirse a s\u00ED misma (todas las otras normas de supresi\u00F3n en el ciclo deber\u00EDan ser CASCADE)).  
XCL35.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de normas de supresi\u00F3n. (La relaci\u00F3n hace que la tabla sea conectada para suprimir con la tabla indicada a trav\u00E9s de varias relaciones y la norma de supresi\u00F3n de la relaci\u00F3n existente es  SET NULL.).  
XCL36.S=La norma de supresi\u00F3n de la clave for\u00E1nea debe ser {0}. (La restricci\u00F3n de referencia es de autoreferencia y una restricci\u00F3n de autoreferencia tiene la norma de supresi\u00F3n indicada (NO ACTION, RESTRICT o CASCADE)).
XCL37.S=La norma de supresi\u00F3n de la clave for\u00E1nea debe ser {0}. (La restricci\u00F3n de referencia es de autoreferencia y la tabla es dependiente en una relaci\u00F3n con una norma de supresi\u00F3n de CASCADE).
XCL38.S=La norma de supresi\u00F3n de la clave for\u00E1nea debe ser {0}. (La relaci\u00F3n har\u00EDa que la tabla estuviera conectada para supresi\u00F3n a la misma tabla a trav\u00E9s de distintas relaciones y dichas relaciones deben tener la misma norma de supresi\u00F3n (NO ACTION, RESTRICT o CASCADE)). 
XCL39.S=La norma de supresi\u00F3n de la clave for\u00E1nea no puede ser CASCADE. (Existe una restricci\u00F3n de autoreferencia con una norma de supresi\u00F3n de SET NULL, NO ACTION o RESTRICT). 
XCL40.S=La norma de supresi\u00F3n de la clave for\u00E1nea no puede ser CASCADE. (La relaci\u00F3n formar\u00EDa un ciclo que har\u00EDa que una tabla pudiera estar conectada para supresi\u00F3n consigo misma. Una de las normas de supresi\u00F3n existentes en el ciclo no es CASCADE, de forma que se puede definir esta relaci\u00F3n si la norma de supresi\u00F3n no es CASCADE). 
XCL41.S=La norma de supresi\u00F3n de la clave for\u00E1nea no puede ser CASCADE. (La relaci\u00F3n har\u00EDa que otra tabla estuviera conectada para suprimir con la misma tabla a trav\u00E9s de distintas v\u00EDas con distintas normas de supresi\u00F3n o con normas de supresi\u00F3n iguales a SET NULL). 
XCL42.S=CASCADE
XCL43.S=SET NULL
XCL44.S=RESTRICT
XCL45.S=NO ACTION
XCL46.S=SET DEFAULT
XCL47.S=La utilizaci\u00F3n de ''{0}'' requiere que se actualice la base de datos desde la versi\u00F3n {1} a la versi\u00F3n {2} o posterior.
XCL48.S=No se permite TRUNCATE TABLE en ''{0}'' porque las restricciones de clave for\u00E1neas de otras tablas hacen referencia a las restricciones de clave primaria/\u00FAnica de esta tabla. 
XCL49.S=No se permite TRUNCATE TABLE en ''{0}'' porque tiene habilitado un desencadenante DELETE ({1}).
XCL50.S=No se ha soporte a una actualizaci\u00F3n de base de datos de una versi\u00F3n anterior.  La base de datos a la que se accede est\u00E1 al nivel de versi\u00F3n ''{0}'', este software est\u00E1 al nivel de versi\u00F3n ''{1}''.    
XCL51.S=La funci\u00F3n solicitada no puede hacer referencia a tablas en el esquema SESSION.
XCL52.S=La sentencia se ha cancelado o ha excedido el tiempo de espera.
XCL53=La secuencia se ha cerrado.
XCW00.D=Actualizaci\u00F3n no soportada de ''{0}'' a ''{1}''.
XCXA0.S=Identificador no v\u00E1lido.
XCXB0.S=Classpath de base de datos no v\u00E1lida\: ''{0}''.
XCXC0.S=Lista de id no v\u00E1lida.
XCXE0.S=Est\u00E1 intentando realizar una operaci\u00F3n que utiliza el territorio de la base de datos, pero la base de datos no dispone de un territorio.
XCY00.S=Valor no v\u00E1lido para la propiedad ''{0}''\=''{1}''.
XCY02.S=El cambio de propiedad solicitado no est\u00E1 soportado ''{0}''\=''{1}''.
XCY03.S=La propiedad necesaria ''{0}'' no se ha establecido.
XCY04.S=Sintaxis no v\u00E1lida para los modificadores de optimizador. La sintaxis debe ser -- DERBY-PROPERTIES propertyName \= valor [, propertyName \= valor]*
XCZ00.S=Permiso ''{0}'' desconocido.
XCZ01.S=Usuario ''{0}'' desconocido.
XCZ02.S=Par\u00E1metro ''{0}''\=''{1}'' no v\u00E1lido.
XD003.S=Imposible restaurar dependencia del disco. DependableFinder \= ''{0}''. M\u00E1s informaci\u00F3n\: ''{1}''.
XD004.S=Imposible almacenar dependencias.
XIE01.S=Conexi\u00F3n nula.
XIE03.S=Se han encontrado datos en la l\u00EDnea {0} de la columna {1} despu\u00E9s del delimitador de parada.  
XIE04.S=Archivo de datos no encontrado\: {0}
XIE05.S=El archivo de datos no puede ser nulo. 
XIE06.S=Nombre de entidad nulo.
XIE07.S=Los separadores de campo y registro no pueden ser una subserie uno de otro. 
XIE08.S=No existe una columna denominada\: {0}.  
XIE09.S=El n\u00FAmero total de columnas en la fila es\: {0}.  
XIE0B.S=La columna {0} de la tabla de tipo {1}, no est\u00E1 soportada por la funci\u00F3n import/export.   
XIE0D.S=No se puede encontrar el separador de registro en la l\u00EDnea {0}.
XIE0E.S=Se ha le\u00EDdo un fin de archivo en un lugar inesperado de la l\u00EDnea {0}.
XIE0I.S=Se ha producido una excepci\u00F3n de E/S al grabar datos en el archivo.
XIE0J.S=Un delimitador no es v\u00E1lido o se ha utilizado m\u00E1s de una vez.
XIE0K.S=El punto se ha especificado como un delimitador de serie de caracteres.
XIE0M.S=La tabla ''{0}'' no existe.  
XIE0N.S=Se ha detectado una cadena hexadecimal no v\u00E1lida, ''{0}'', en el archivo de importaci\u00F3n.
XIE0P.S=No se ha encontrado el archivo de datos LOB {0} al que se hace referencia en el archivo de importaci\u00F3n.
XIE0Q.S=El nombre del archivo de datos LOB no puede se nulo. 
XIE0R.S=Error de importaci\u00F3n en la l\u00EDnea {0} del archivo {1}\: {2} 
XIE0S.S=No se ha realizado la operaci\u00F3n de exportaci\u00F3n porque ya existe el archivo de salida especificado ({0}). Como medida de seguridad, y para evitar posibles da\u00F1os a los archivos, el proceso de exportaci\u00F3n no sustituir\u00E1 ninguno de los archivos existentes aunque tenga permiso para escribir en ellos. Por favor, cambie el nombre del archivo de salida en los argumentos del procedimiento de exportaci\u00F3n para indicar un archivo que no exista, o bien borre el archivo existente y vuelva a intentar la operaci\u00F3n de exportaci\u00F3n.
XIE0T.S=No se ha realizado la operaci\u00F3n de exportaci\u00F3n porque ya existe el archivo auxiliar de objetos grandes especificado ({0}). Como medida de seguridad, y para posibles da\u00F1os a los archivos, el proceso de exportaci\u00F3n no sustituir\u00E1 ninguno de los archivos existentes aunque tenga permiso para escribir en ellos. Por favor, cambie el nombre del archivo auxiliar de objetos grandes en los argumentos del procedimiento de exportaci\u00F3n para indicar un archivo que no exista, o bien borre el archivo existente y vuelva a intentar la operaci\u00F3n de exportaci\u00F3n.
XJ001.U=Excepci\u00F3n de Java\: ''{1}\: {0}''.
XJ004.C=Base de datos ''{0}'' no encontrada.
XJ008.S=No se puede retrotraer o liberar un SAVEPOINT en modalidad AutoCommit.
XJ009.S=Es necesario utilizar CallableStatement con llamadas de procedimientos almacenados o utilizar par\u00E1metros de salida\: {0}
XJ010.S=No se puede emitir un SAVEPOINT cuando autoCommit est\u00E1 activado.
XJ011.S=No se puede pasar un valor nulo como nombre de SAVEPOINT.
XJ012.S=''{0}'' ya est\u00E1 cerrado.
XJ013.S=No hay ID para SAVEPOINT con nombre.
XJ014.S=No hay nombre para SAVEPOINT sin nombre.
XJ015.M=Conclusi\u00F3n del sistema Derby.
XJ016.S=El m\u00E9todo ''{0}'' no est\u00E1 permitido en una sentencia preparada.
XJ017.S=No se permite el mandato SAVEPOINT dentro de un c\u00F3digo de desencadenantes.
XJ018.S=El nombre de columna no puede ser nulo.
XJ020.S=El tipo de objeto no es convertible a TYPE ''{0}'', valor java.sql.Types no v\u00E1lido o el objeto es nulo.
XJ021.S=El tipo no est\u00E1 soportado.
XJ022.S=No es posible establecer la corriente\: ''{0}''.
XJ023.S=La corriente de entrada no conten\u00EDa la cantidad exacta de datos que la longitud solicitada.
XJ025.S=La corriente de entrada no puede tener una longitud negativa.
XJ028.C=El URL ''{0}'' no est\u00E1 formado correctamente.
XJ030.S=No se puede establecer AUTOCOMMIT ON si est\u00E1 en una conexi\u00F3n anidada.
XJ040.C=No se ha podido iniciar la base de datos ''{0}'', consulte la excepci\u00F3n siguiente para obtener detalles.
XJ041.C=No se ha podido crear la base de datos ''{0}'', consulte la excepci\u00F3n siguiente para obtener detalles.
XJ042.S=''{0}'' no es un valor v\u00E1lido para la propiedad ''{1}''.
XJ044.S=''{0}'' no es una escala v\u00E1lida.
XJ045.S=Se ha pasador un nivel de aislamiento no v\u00E1lido o no soportado (actualmente), ''{0}'', a Connection.setTransactionIsolation(). Los valores a los que actualmente se da soporte son java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED y java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
XJ049.C=Se han especificado atributos de creaci\u00F3n que entran en conflicto.
XJ04B.S=El proceso por lotes no puede contener un mandatos que intente devolver un juego de resultados.
XJ04C.S=El proceso por lotes CallableStatement no puede contener par\u00E1metros de salida.
XJ050.U=La base de datos necesita actualizarse desde la versi\u00F3n {0}, establezca el atributo ''upgrade\=true'' en el URL de conexi\u00F3n JDBC para permitir la actualizaci\u00F3n a la versi\u00F3n {1}.
XJ056.S=No se puede establecer AUTOCOMMIT ON si est\u00E1 en una conexi\u00F3n XA.
XJ057.S=No se puede comprometer una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de comprometer debe ir a trav\u00E9s de la interfaz XAResource.
XJ058.S=No se puede retrotraer una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de comprometer debe ir a trav\u00E9s de la interfaz XAResource.
XJ059.S=No se puede cerrar una conexi\u00F3n mientras siga activa una transacci\u00F3n global.
XJ05B.C=El atributo de JDBC ''{0}'' tiene un valor ''{1}'' no v\u00E1lido, los valores v\u00E1lidos son ''{2}''.
XJ05C.S=No se puede establecer la constante de retenci\u00F3n ResultSet.HOLD_CURSORS_OVER_COMMIT para una transacci\u00F3n global.
XJ061.S=El m\u00E9todo ''{0}'' s\u00F3lo est\u00E1 permitido sobre cursores de desplazamiento.
XJ062.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para ResultSet.setFetchSize(int rows).
XJ063.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxRows(int maxRows).  El valor del par\u00E1metro debe ser >\= 0.
XJ064.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para setFetchDirection(int direction).
XJ065.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setFetchSize(int rows).
XJ066.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxFieldSize(int max).
XJ067.S=El puntero de texto SQL es nulo.
XJ068.S=S\u00F3lo est\u00E1n permitidos executeBatch y clearBatch en mitad de un proceso por lotes.
XJ069.S=No se permiten m\u00E9todos SetXXX en el caso de USING execute statement.
XJ070.S=Se ha pasado un argumento de posici\u00F3n negativo o cero ''{0}'' en un m\u00E9todo Blob o Clob.
XJ071.S=Se ha pasado un argumento de longitud negativo ''{0}'' en un m\u00E9todo BLOB o CLOB.
XJ072.S=Se ha pasado un patr\u00F3n o searchStr nulo a un m\u00E9todo de posici\u00F3n BLOB o CLOB.
XJ073.S=Los datos de este BLOB o CLOB ya no est\u00E1n disponibles.  La transacci\u00F3n de BLOB/CLOB podr\u00EDa estar comprometida o su conexi\u00F3n se ha cerrado.
XJ074.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setQueryTimeout(int segundos).
XJ076.S=El argumento de posici\u00F3n ''{0}'' supera el tama\u00F1o del BLOB/CLOB.
XJ077.S=Se ha obtenido una excepci\u00F3n al intentar leer el primer byte/car\u00E1cter del patr\u00F3n BLOB/CLOB mediante getBytes/getSubString.
XJ078.S=El desplazamiento ''{0}'' es inferior a cero o es demasiado grande para el BLOB/CLOB actual.
XJ079.S=La longitud ''{0}'' especificada supera el tama\u00F1o del BLOB/BLOB.
XJ080.S=USING execute statement ha pasado {0} par\u00E1metros en lugar de {1}.
XJ081.C=Se han especificado atributos de creaci\u00F3n/restauraci\u00F3n/recuperaci\u00F3n que entran en conflicto.
XJ081.S=Se ha pasado el valor ''{0}'' no v\u00E1lido como par\u00E1metro ''{1}'' al m\u00E9todo ''{2}''
XJ082.U=No se permiten los valores BLOB/CLOB como receptor o par\u00E1metros de m\u00E9todo.
XJ083.U=''{0}'' no permitido porque el ResultSet no es un ResultSet actualizable. 
XJ084.U=La columna no corresponde a una columna de la tabla base. No se puede emitir ''{0}'' en esta columna.
XJ085.S=La corriente ya se ha le\u00EDdo, se ha alcanzado el fin de archivo y no se puede volver a utilizar.
XJ086.S=Este m\u00E9todo no se puede invocar mientras el cursor no est\u00E1 en la fila de inserci\u00F3n o si la concurrencia de este objeto ResultSet es CONCUR_READ_ONLY.
XJ087.S=La suma de la posici\u00F3n (''{0}'') y la longitud (''{1}'') es mayor que el tama\u00F1o del LOB.
XJ088.S=Operaci\u00F3n no v\u00E1lida\: se ha llamado a wasNull() sin datos recuperados.
XJ090.S=Par\u00E1metro no v\u00E1lido\: el calendario es nulo.
XJ091.S=Argumento no v\u00E1lido\: el \u00EDndice de par\u00E1metro {0} no es un par\u00E1metro OUT o INOUT.
XJ093.S=La longitud de BLOB/CLOB, {0}, es demasiado grande.  La longitud no puede exceder de {1}.
XJ094.S=Este objeto ya est\u00E1 cerrado.
XJ095.S=Ha fallado un intento de ejecutar una acci\u00F3n privilegiada.
XJ096.S=No se ha encontrado un paquete de recursos en el paquete {0} para {1}
XJ097.S=No se puede retrotraer o liberar un SAVEPOINT que no haya sido creado por esta conexi\u00F3n.
XJ098.S=El valor de claves generadas autom\u00E1ticamente {0} no es v\u00E1lido
XJ099.S=El objeto Reader/Stream (Lector/Corriente) no contiene caracteres de longitud
XJ100.S=La escala proporcionada por el m\u00E9todo registerOutParameter no coincide con el m\u00E9todo setter. \u00A1Posible p\u00E9rdida de precisi\u00F3n\!
XJ102.S=No se puede realizar una inserci\u00F3n en la posici\u00F3n actual.
XJ103.S=El nombre de tabla no puede ser nulo
XJ104.S=La longitud de clave compartida no es v\u00E1lida\: {0}.
XJ105.S=La clave DES tiene una longitud incorrecta; longitud esperada {0}, longitud obtenida {1}.
XJ106.S=No existe dicho relleno 
XJ107.S=Relleno incorrecto
XJ108.S=Tama\u00F1o de bloque no permitido
XJ110.S=El nombre de tabla primaria no puede ser nulo
XJ111.S=El nombre de tabla for\u00E1nea no puede ser nulo
XJ112.S=Se ha encontrado una excepci\u00F3n de seguridad, consulte la excepci\u00F3n siguiente para obtener detalles.
XJ113.S=No se puede abrir el archivo {0} \: {1}
XJ114.S=Nombre de cursor no v\u00E1lido ''{0}''
XJ115.S=No se puede abrir resultSet con la capacidad de retenci\u00F3n solicitada {0}.
XJ116.S=No se puede a\u00F1adir m\u00E1s de {0} mandatos a un \u00FAnico proceso por lotes.
XJ117.S=El proceso por lotes de consultas no est\u00E1 permitido por conformidad a J2EE.
XJ118.S=Se ha solicitado un proceso por lotes de consulta en una sentencia que no referente a una consulta.
XJ121.S=Operaci\u00F3n no v\u00E1lida en la posici\u00F3n actual del cursor.
XJ122.S=No se han llamado m\u00E9todos updateXXX en esta fila.
XJ123.S=Este m\u00E9todo debe llamarse para actualizar los valores de la fila actual o de la fila de inserci\u00F3n.
XJ124.S=Columna no actualizable.
XJ125.S=Este m\u00E9todo s\u00F3lo debe llamarse en objetos ResultSet que sean desplazables (tipo TYPE_SCROLL_INSENSITIVE).
XJ126.S=Este m\u00E9todo no debe llamarse en cursores din\u00E1micos sensibles.
XJ128.S=No se ha podido deshacer el recorte para ''{0}''
XJ200.S=Se ha excedido el n\u00FAmero m\u00E1ximo de secciones {0}
XJ202.S=Nombre de cursor no v\u00E1lido ''{0}''.
XJ203.S=El nombre de cursor ''{0}'' ya se utiliza
XJ204.S=No se puede abrir el conjunto de resultados con la capacidad de retenci\u00F3n solicitada {0}.
XJ206.S=El texto SQL ''{0}'' no contiene se\u00F1ales.
XJ207.S=No se puede utilizar el m\u00E9todo executeQuery para la actualizaci\u00F3n.
XJ208.S=Anomal\u00EDa de proceso por lotes no at\u00F3mico.  Se ha sometido el proceso por lotes, pero se ha producido como m\u00EDnimo una excepci\u00F3n en un miembro individual del proceso por lotes. Utilice getNextException() para recuperar las excepciones para elementos procesados por lotes espec\u00EDficos.
XJ209.S=El proceso almacenado necesario no est\u00E1 instalado en el servidor.
XJ210.S=No se ha encontrado el nombre del m\u00F3dulo de carga para el procedimiento almacenado en el servidor.
XJ211.S=Se ha producido una excepci\u00F3n de ruptura de cadena no recuperable durante el proceso por lotes. El proceso por lotes finaliza de manera no at\u00F3mica.
XJ212.S=Sintaxis de atributo no v\u00E1lida\: {0}
XJ213.C=La propiedad de conexi\u00F3n traceLevel no tiene un formato v\u00E1lido para un n\u00FAmero.
XJ214.S=Se ha producido un error de E/S al llamar a free() en un CLOB o BLOB.
XJ215.S=No puede llamar a otro m\u00E9todo java.sql.Clob o java.sql.Blob despu\u00E9s de haber llamado al m\u00E9todo free() ni despu\u00E9s de haber finalizado (COMMIT) o cancelado (ROLLBACK) la transacci\u00F3n de Blob/Clob.
XJ216.S=La longitud de este BLOB/CLOB a\u00FAn no est\u00E1 disponible. Cuando se accede a BLOB o CLOB como una secuencia de datos, la longitud no est\u00E1 disponible hasta que se ha procesado la secuencia completa.
XJ217.S=El localizador suministrado para este CLOB/LOB no es v\u00E1lido.
XK000.S=No se ha podido volver a cargar la directiva de seguridad\: {0}
XML00=No se ha podido localizar la API ''{0}'' o las clases de implementaci\u00F3n.  No se permiten operaciones XML a menos que estas clases est\u00E9n en classpath.
XML01=Se ha encontrado un error no esperado al procesar XML\: {0}
XN001.S=No se permite un restablecimiento de la conexi\u00F3n dentro de una unidad de trabajo.
XN002.U=No se ha devuelto SECTKN.
XN008.S=El proceso de la consulta se ha finalizado debido a un error en el servidor.
XN009.S=Error al obtener la longitud del objeto BLOB/CLOB, a continuaci\u00F3n se obtiene una excepci\u00F3n.
XN010.S=El nombre del procedimiento no puede ser nulo.
XN011.S=La longitud del nombre de procedimiento {0} no est\u00E1 dentro del rango v\u00E1lido entre 1 y {1}.
XN012.S=En plataformas {0}, XA soporta la versi\u00F3n {1} y superiores, \u00E9sta es la versi\u00F3n {2}
XN013.S=Orientaci\u00F3n de desplazamiento no v\u00E1lida.
XN014.S=Error de protocolo de red\: se ha encontrado una excepci\u00F3n de E/S (IOException), par\u00E1metro \#{0}.  Los datos restantes se han rellenado con 0x0. Mensaje\: {1}.
XN015.S=Error de protocolo de red\: el tama\u00F1o especificado de InputStream, par\u00E1metro \#{0}, es inferior a la longitud real de InputStream.
XN016.S=Error de protocolo de red\: se ha encontrado un error en la verificaci\u00F3n de longitud de corriente, par\u00E1metro \#{0}.  Mensaje\: {1}.
XN017.S=Error de protocolo de red\: se ha alcanzado de forma prematura el final de la corriente, par\u00E1metro \#{0}.  Los datos restantes se han rellenado con 0x0.
XN018.S=Error de protocolo de red\: el tama\u00F1o especificado de Reader (Lector), par\u00E1metro \#{0}, es inferior a la longitud real de InputStream.
XN019.S=Error al ejecutar {0}, el servidor ha devuelto {1}.
XRE00=Este m\u00F3dulo LogFactory no soporta replicatiosn.
XRE01=El registro recibido del principal est\u00E1 da\u00F1ado.
XRE02=Principal y secundaria en versiones distintas. No se puede continuar con la repetici\u00F3n.
XRE03=Error inesperado de repetici\u00F3n. Consulte derby.log para ver los detalles.
XRE04.U.1=No se ha podido establecer una conexi\u00F3n con el interlocutor de la base de datos repetida ''{0}'' en la direcci\u00F3n ''{1}\:{2}''.
XRE04.U.2=Se ha perdido la conexi\u00F3n de la base de datos repetida ''{0}''.
XRE05=Los archivos de registro de principal y secundario no est\u00E1n sincronizados para la base de datos repetida ''{0}''. La instant\u00E1nea del registro principal es {1}\:{2}, mientras que la instant\u00E1nea del registro secundario es {3}\:{4}. Es GRAVE para la repetici\u00F3n\: se detendr\u00E1 la repetici\u00F3n.
XRE06=Los intentos de conexi\u00F3n con la repetici\u00F3n secundaria de la base de datos {0} han excedido el tiempo de espera configurado.
XRE07=La operaci\u00F3n no ha podido efectuarse porque la base de datos no est\u00E1 en modo de repetici\u00F3n principal.
XRE08=El modo de repetici\u00F3n secundaria se ha iniciado correctamente para la base de datos ''{0}''. Se ha rechazado la conexi\u00F3n porque la base de datos est\u00E1 en modo de repetici\u00F3n secundaria. 
XRE09=No se ha podido iniciar la repetici\u00F3n secundaria para la base de datos ''{0}''. La base de datos ya se ha iniciado. 
XRE10=Se han especificado atributos que entran en conflicto. Consulte el manual de referencia para obtener informaci\u00F3n sobre los atributos permitidos en  combinaci\u00F3n con el atributo de repetici\u00F3n ''{0}''.
XRE11=No se ha podido efectuar la operaci\u00F3n ''{0}'' porque la base de datos ''{1}'' no se ha iniciado.
XRE12=Error de protocolo de red de repetici\u00F3n para la base de datos ''{0}''. Se esperaba el tipo de mensaje ''{1}'', pero se ha recibido ''{2}''.
XRE20.D=Conmutaci\u00F3n por error ejecutada correctamente para la base de datos ''{0}'', la base de datos se ha apagado.
XRE21=Error al efectuar la conmutaci\u00F3n por error para la base de datos ''{0}'', se ha cancelado el intento de conmutaci\u00F3n por error.
XRE22=La repetici\u00F3n principal ya se ha iniciado para la base de datos ''{0}''
XRE23=No se ha podido iniciar la repetici\u00F3n principal porque hay en curso operaciones sin registrar. Desbloquee para permitir que las operaciones no registradas se completen y reinicie la repetici\u00F3n.
XRE40=La operaci\u00F3n no ha podido efectuarse porque la base de datos no est\u00E1 en modo de repetici\u00F3n secundaria.
XRE41=Se ha rechazado la operaci\u00F3n de repetici\u00F3n ''failover'' o ''stopSlave'' en la base de datos secundaria porque est\u00E1 en funcionamiento la conexi\u00F3n con la principal. En lugar de ello, emita la operaci\u00F3n ''failover'' o ''stopMaster'' en la base de datos principal.
XRE42=Se apaga la base de datos repetida ''{0}''.
XRE43=Error inesperado al intentar detener el modo de repetici\u00F3n secundaria. Para detener el modo de repetici\u00F3n secundaria, utilice la operaci\u00F3n ''stopSlave'' o ''failover''.
XSAI2.S=El conglomerado ({0}) solicitado no existe.
XSAI3.S=Caracter\u00EDstica no implementada.
XSAJ0.U=Tipo de exploraci\u00F3n
XSAJ1.U=N\u00FAmero de p\u00E1ginas visitadas
XSAJ2.U=N\u00FAmero de filas visitadas
XSAJ3.U=N\u00FAmero de filas suprimidas visitadas
XSAJ4.U=N\u00FAmero de filas calificadas
XSAJ5.U=N\u00FAmero de columnas extra\u00EDdas
XSAJ6.U=Bit establecido de columnas extra\u00EDdas
XSAJ7.U=Altura del \u00E1rbol
XSAJ8.U=Tipo de ordenaci\u00F3n
XSAJA.U=N\u00FAmero de filas de entrada
XSAJB.U=N\u00FAmero de filas de salida
XSAJC.U=N\u00FAmero de fusiones realizadas
XSAJD.U=Tama\u00F1o de fusiones realizadas
XSAJE.U=Todo
XSAJF.U=btree
XSAJG.U=heap
XSAJH.U=sort
XSAJI.U=externa
XSAJJ.U=interna
XSAM0.S=Se he encontrado una excepci\u00F3n al intentar arrancar el m\u00F3dulo de ''{0}''.
XSAM2.S=No existe un \u00EDndice o conglomerado con id de conglomerado ''{0}'' para eliminar.
XSAM3.S=No existe un \u00EDndice o conglomerado con id de conglomerado ''{0}''.
XSAM4.S=No existe una clasificaci\u00F3n llamada ''{0}''.
XSAM5.S=La exploraci\u00F3n debe abrirse y colocarse llamando a next() antes de realizar otras llamadas.
XSAM6.S=Registro {2} de la p\u00E1gina {1} del contenedor {0} no encontrado.
XSAS0.S=Se ha llamado a un m\u00E9todo de interfaz de controlador de exploraci\u00F3n que no es apropiado para una exploraci\u00F3n sobre una clasificaci\u00F3n.
XSAS1.S=Se ha intentado extraer una fila antes de iniciar la clasificaci\u00F3n o despu\u00E9s de finalizarla.
XSAS3.S=El tipo de fila insertada en la clasificaci\u00F3n no coincide con la plantilla de clasificaci\u00F3n.
XSAS6.S=No se han podido adquirir los recursos para la clasificaci\u00F3n.
XSAX0.S=Violaci\u00F3n de protocolo XA.
XSAX1.S=Se ha intentado iniciar una transacci\u00F3n global con un Xid de una transacci\u00F3n global existente.
XSCB0.S=No se ha podido crear el contenedor.
XSCB1.S=Contenedor {0} no encontrado.
XSCB2.S=No se ha encontrado la propiedad necesaria {0} en la lista de propiedades dada para createConglomerate() de un \u00EDndice secundario btree.
XSCB3.S=Caracter\u00EDstica no implementada.
XSCB4.S=Se ha llamado a un m\u00E9todo de una exploraci\u00F3n abierta btree antes de posicionar la exploraci\u00F3n en la primera fila (esto es, no se ha realizado a\u00FAn una llamada next()).  El estado actual de la exploraci\u00F3n es ({0}).
XSCB5.S=No se ha podido encontrar la fila en el \u00E1rbol durante una operaci\u00F3n deshacer l\u00F3gica de una inserci\u00F3n o supresi\u00F3n de btree.
XSCB6.S=Limitaci\u00F3n\: no se puede actualizar o insertar el registro de un \u00EDndice secundario btree debido a la falta de espacio en la p\u00E1gina.  Utilice los par\u00E1metros derby.storage.pageSize y/o derby.storage.pageReservedSpace para solucionar esta limitaci\u00F3n.
XSCB7.S=Se ha producido un error interno durante una exploraci\u00F3n btree - current_rh es nulo \= {0}, clave de posici\u00F3n es nula \= {1}.
XSCB8.S=El conglomerado btree {0} est\u00E1 cerrado.
XSCB9.S=Reservado para pruebas.
XSCG0.S=No se ha podido crear una plantilla.
XSCH0.S=No se ha podido crear el contenedor.
XSCH1.S=Contenedor {0} no encontrado.
XSCH4.S=No se puede crear el conglomerado.
XSCH5.S=Existe una discrepancia en la tabla base entre el n\u00FAmero de columna solicitado {0} y el n\u00FAmero m\u00E1ximo de columnas {1}.
XSCH6.S=El contenedor heap con id de contenedor {0} est\u00E1 cerrado.
XSCH7.S=La exploraci\u00F3n no est\u00E1 posicionada.
XSCH8.S=La caracter\u00EDstica no est\u00E1 implementada.
XSDA1.S=Se ha intentado acceder a una ranura fuera de rango de una p\u00E1gina
XSDA2.S=Se ha intentado actualizar un registro suprimido
XSDA3.S=Limitaci\u00F3n\: no se puede actualizar o insertar el registro debido a la falta de espacio en la p\u00E1gina. Utilice los par\u00E1metros derby.storage.pageSize y/o derby.storage.pageReservedSpace para solucionar esta limitaci\u00F3n.
XSDA4.S=Se ha generado una excepci\u00F3n inesperada
XSDA5.S=Se ha intentado recuperar un registro que no ha sido suprimido
XSDA6.S=La columna {0} de la fila es nula, debe asignarse un valor para que apunte a un objeto.
XSDA7.S=La restauraci\u00F3n de un objeto serializable o SQLData de clase {0} ha intentado leer m\u00E1s datos que los almacenados originalmente
XSDA8.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto serializable o SQLData de clase {0}
XSDA9.S=Clase no encontrada durante la restauraci\u00F3n de un objeto serializable o SQLData de clase {0}
XSDAA.S=Indicaci\u00F3n de la hora {0} no permitida, bien procede de una p\u00E1gina diferente o de una implementaci\u00F3n incompatible
XSDAB.S=no se puede establecer una indicaci\u00F3n de la hora nula
XSDAC.S=Se intentan mover p\u00E1ginas o filas de un contenedor a otro.
XSDAD.S=Se intentan mover cero filas de una p\u00E1gina a otra.
XSDAE.S=S\u00F3lo se puede crear un descriptor de contexto de registro para un id de descriptor de contexto de registro especial.
XSDAF.S=Utilizando un descriptor de contexto de registro especial como si fuese uno normal.
XSDAG.S=La transacci\u00F3n superior anidada de asignaci\u00F3n no puede abrir el contenedor.
XSDAI.S=La p\u00E1gina {0} que se est\u00E1 eliminando ya ha sido bloqueada para suprimir su asignaci\u00F3n.
XSDAJ.S=Excepci\u00F3n durante la grabaci\u00F3n de un objeto serializable o SQLData
XSDAK.S=Se ha obtenido una p\u00E1gina incorrecta para el descriptor de contexto de registro {0}.
XSDAL.S=El descriptor de contexto de registro {0} se\u00F1ala inesperadamente a una p\u00E1gina de desbordamiento.
XSDAM.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto SQLData de clase {0}. No se puede crear una instancia de la clase especificada.
XSDAN.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto SQLData de clase {0}. La clase especificada ha encontrado una excepci\u00F3n de acceso no permitida.
XSDB0.D=Excepci\u00F3n inesperada en la p\u00E1gina en memoria {0}
XSDB1.D=Formato de p\u00E1gina desconocido en la p\u00E1gina {0}
XSDB2.D=Formato de contenedor desconocido en el contenedor {0} \: {1}
XSDB3.D=La informaci\u00F3n del contenedor no se puede cambiar una vez grabada\: era {0}, ahora {1}
XSDB4.D=La p\u00E1gina {0} es de la versi\u00F3n {1}, el archivo de anotaciones cronol\u00F3gicas contiene un cambio versi\u00F3n {2}, o faltan registros de anotaci\u00F3n cronol\u00F3gica de esta p\u00E1gina o esta p\u00E1gina no se ha grabado correctamente en el disco.
XSDB5.D=Las anotaciones cronol\u00F3gicas tienen un registro de cambio en la p\u00E1gina {0} que est\u00E1 m\u00E1s all\u00E1 del final del contenedor.
XSDB6.D=Es posible que otra instancia de Derby haya iniciado ya la base de datos {0}.
XSDB7.D=AVISO\: Derby (instancia {0}) est\u00E1 intentando arrancar la base datos {1} a pesar de que Derby (instancia {2}) pueda seguir activo.  S\u00F3lo una instancia de Derby debe arrancar una base de datos al mismo tiempo. Pueden producirse da\u00F1os graves y no recuperables aunque podr\u00EDan haberse producido ya.
XSDB8.D=AVISO\: Derby (instancia {0}) est\u00E1 intentando arrancar la base datos {1} a pesar de que Derby (instancia {2}) pueda seguir activo.  S\u00F3lo una instancia de Derby debe arrancar una base de datos al mismo tiempo. Pueden producirse da\u00F1os graves y no recuperables si 2 instancias de Derby se arrancan en la misma base de datos al mismo tiempo.  Se ha establecido la propiedad db2j.database.forceDatabaseLock\=true para que no arranque la base de datos mientras est\u00E9 presente db.lck.  Normalmente este archivo se elimina cuando termina la primera instancia de Derby que se arranca en la base de datos, pero puede dejarse a veces al concluir.  En este caso ser\u00E1 necesario eliminar el archivo a mano.  Es importante comprobar que no hay ninguna otra VM accediendo a la base de datos antes de suprimir el archivo db.lck a mano.
XSDB9.D=El contenedor de corriente {0} est\u00E1 da\u00F1ado.
XSDBA.D=Anomal\u00EDa al intentar asignar el objeto {0}.
XSDF0.S=No se ha podido crear el archivo {0} porque ya existe.
XSDF1.S=Excepci\u00F3n durante la creaci\u00F3n del archivo {0} del contenedor
XSDF2.S=Excepci\u00F3n durante la creaci\u00F3n del archivo {0} del contenedor, no se pudo eliminar el archivo.  Excepci\u00F3n\: {1}.
XSDF3.S=No se puede crear el segmento {0}.
XSDF4.S=Excepci\u00F3n durante la eliminaci\u00F3n del archivo {0} del contenedor eliminado, no se ha podido eliminar el archivo {1}.
XSDF6.S=No se puede encontrar la p\u00E1gina de asignaci\u00F3n {0}.
XSDF7.S=No se ha podido enclavar la p\u00E1gina que  se acaba de crear {0}
XSDF8.S=No se puede encontrar la p\u00E1gina {0} para reutilizar.
XSDFB.S=Operaci\u00F3n no soportada por una base de datos de s\u00F3lo lectura
XSDFD.S=Se ha le\u00EDdo una imagen de p\u00E1gina diferente en 2 E/S de la p\u00E1gina {0}, la primera imagen tiene una suma de comprobaci\u00F3n incorrecta, la segunda imagen tiene una suma de comprobaci\u00F3n correcta. Im\u00E1genes de p\u00E1gina\: {1} {2}
XSDFF.S=Anomal\u00EDa en la operaci\u00F3n solicitada debido a una excepci\u00F3n inesperada.
XSDFH.S=No se puede realizar una copia de seguridad de la base de datos, se ha producido una Excepci\u00F3n de E/S al grabar en el archivo contenedor de copia de seguridad {0}.
XSDFI.S=Se ha producido un error al intentar grabar datos en el disco durante la recuperaci\u00F3n de la base de datos.  Compruebe que el disco de la base de datos no est\u00E9 lleno. Si est\u00E1 lleno, suprima los archivos innecesarios y vuelva a intentar conectarse a la base de datos.  Tambi\u00E9n es posible que el sistema de archivos sea de s\u00F3lo lectura, que el disco haya fallado o que se haya producido alg\u00FAn otro problema en el soporte.  El sistema ha encontrado un error mientras procesaba la p\u00E1gina {0}.
XSDG0.D=No se ha podido leer la p\u00E1gina {0} del disco.
XSDG1.D=No se ha podido grabar la p\u00E1gina {0} en el disco, compruebe si el disco est\u00E1 lleno.
XSDG2.D=Suma de comprobaci\u00F3n no v\u00E1lida en la p\u00E1gina {0}, se esperaba {1}, versi\u00F3n en disco {2}, vuelco de p\u00E1gina\: {3}
XSDG3.D=No se ha podido acceder a los metadatos del contenedor {0}
XSDG5.D=La base de datos no estaba en modalidad de creaci\u00F3n cuando se ha llamado a createFinished.
XSDG6.D=No se encontr\u00F3 el directorio de segmentos de datos al restaurar la copia de seguridad {0}. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrompida.
XSDG7.D=No ha sido posible eliminar el directorio {0} durante la restauraci\u00F3n. Aseg\u00FArese de que los permisos son los adecuados.
XSDG8.D=No es posible copiar el directorio ''{0}'' en ''{1}'' durante la restauraci\u00F3n. Aseg\u00FArese de que haya suficiente espacio y que los permisos sean los adecuados. 
XSLA0.D=No se puede enviar el archivo de anotaciones cronol\u00F3gicas al disco {0}.
XSLA1.D=Se ha enviado el registro de anotaciones cronol\u00F3gicas a la corriente, pero no puede aplicarse al almac\u00E9n (Objeto {0}).  Esto tambi\u00E9n puede producir problemas de recuperaci\u00F3n.
XSLA2.D=Se concluir\u00E1 el sistema, se obtuvo una excepci\u00F3n de E/S al acceder al archivo de anotaciones cronol\u00F3gicas.
XSLA3.D=Anotaciones cronol\u00F3gicas da\u00F1adas, datos no v\u00E1lidos en la corriente de anotaciones.
XSLA4.D=No se puede grabar en las anotaciones cronol\u00F3gicas, puede que est\u00E9n llenas.  Suprima archivos innecesarios.  Tambi\u00E9n es posible que el sistema de archivos sea de s\u00F3lo lectura, que el disco tenga error o alg\u00FAn otro problema con el soporte.  
XSLA5.D=No se puede leer la corriente de datos para las anotaciones cronol\u00F3gicas por alguna raz\u00F3n para retrotraer la transacci\u00F3n {0}.
XSLA6.D=No se puede recuperar la base de datos.
XSLA7.D=No se puede rehacer la operaci\u00F3n {0} en el archivo de anotaciones cronol\u00F3gicas.
XSLA8.D=No se puede retrotraer la transacci\u00F3n {0}, intentando compensar la operaci\u00F3n {1} con {2}
XSLAA.D=Una excepci\u00F3n anterior ha marcado el almac\u00E9n para concluirlo.
XSLAB.D=No se puede encontrar el archivo de anotaciones cronol\u00F3gicas {0}, aseg\u00FArese de que la propiedad logDevice se ha establecido con el separador de v\u00EDa de acceso correcto para la plataforma.
XSLAC.D=La base de datos en {0} tiene un formato incompatible con la versi\u00F3n actual del software, puede haber sido creada o actualizada por una versi\u00F3n posterior.
XSLAD.D=Registro de anotaci\u00F3n cronol\u00F3gica en instante {2} en archivo de anotaciones cronol\u00F3gicas {3} da\u00F1ado. Se esperaba una longitud de registro de anotaci\u00F3n cronol\u00F3gica de {0}, longitud real {1}.
XSLAE.D=El archivo de control en {0} no se puede grabar o actualizar.
XSLAF.D=Se ha creado una base de datos de s\u00F3lo lectura con almacenamientos intermedios de datos dirty.
XSLAH.D=Se va a actualizar una base de datos de s\u00F3lo lectura.
XSLAI.D=No se puede anotar el registro de anotaci\u00F3n cronol\u00F3gica de punto de control
XSLAJ.D=Se ha se\u00F1alado al sistema de anotaciones para que concluya debido a un problema anterior y que no permitir\u00E1 m\u00E1s operaciones hasta que concluya y vuelva iniciar el sistema.
XSLAK.D=La base de datos ha superado el n\u00FAmero de archivo de anotaciones cronol\u00F3gicas m\u00E1s grande {0}.
XSLAL.D=El tama\u00F1o del registro de anotaci\u00F3n cronol\u00F3gica {2} supera el tama\u00F1o m\u00E1ximo del archivo de anotaciones cronol\u00F3gicas permitido {3}. Se ha encontrado un error en el archivo de anotaciones cronol\u00F3gicas {0}, posici\u00F3n {1}.
XSLAM.D=No se puede verificar el formato de la base de datos en {1} debido a una excepci\u00F3n de E/S.
XSLAN.D=La base de datos en {0} tiene un formato incompatible con la versi\u00F3n actual del software.  La base de datos se ha creado o actualizado con la versi\u00F3n {1}.
XSLAO.D=Error de recuperaci\u00F3n, problema inesperado {0}.
XSLAP.D=La base de datos {0} est\u00E1 en la versi\u00F3n {1}. No es posible actualizar bases de datos Beta,
XSLAQ.D=No se puede crear una archivo de anotaciones cronol\u00F3gicas en el directorio {0}.
XSLAR.D=No es posible copiar el archivo ''{0}'' como ''{1}'' durante la restauraci\u00F3n. Aseg\u00FArese de que haya suficiente espacio y que los permisos sean los adecuados. 
XSLAS.D=No se encontr\u00F3 el directorio de anotaciones cronol\u00F3gicas {0} al restaurar la copia de seguridad. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrompida.
XSLAT.D=El directorio de anotaciones cronol\u00F3gicas ''{0}'' ya existe. El directorio puede pertenecer a otra base de datos. Compruebe que la ubicaci\u00F3n especificada para el atributo logDevice sea correcta.
XSLB1.S=La operaci\u00F3n de anotaci\u00F3n cronol\u00F3gica {0} ha encontrado un error al grabarse en la corriente de anotaciones, que podr\u00EDa deberse a una operaci\u00F3n de anotaci\u00F3n errante o al llenado del almacenamiento intermedio interno para anotaciones debido a un exceso de operaciones de anotaci\u00F3n de gran tama\u00F1o.
XSLB2.S=La operaci\u00F3n de anotaci\u00F3n cronol\u00F3gica {0} est\u00E1 registrando demasiados datos, ha llenado el almacenamiento intermedio interno para anotaciones.
XSLB4.S=No se puede encontrar truncationLWM {0}.
XSLB5.S=Instante de truncationLWM {1} no permitido para el punto de truncamiento {0}. El rango permitido es de {2} a {3}.
XSLB6.S=Intentado anotar un 0 o registro de anotaci\u00F3n cronol\u00F3gica de longitud -ve.
XSLB8.S=Intentando restablecer la exploraci\u00F3n en {0}, m\u00E1s all\u00E1 de su l\u00EDmite de {1}.
XSLB9.S=No se pueden emitir m\u00E1s cambios, la f\u00E1brica de anotaci\u00F3n cronol\u00F3gica se ha detenido.
XSRS0.S=No se puede inmovilizar la base de datos despu\u00E9s de que ya ha sido inmovilizada.
XSRS1.S=No se puede realizar copia de seguridad de la base de datos en {0}, ya que no es un directorio.
XSRS4.S=Error al renombrar el archivo (durante la copia de seguridad) de {0} en {1}.
XSRS5.S=Error al copiar el archivo (durante la copia de seguridad) de {0} en {1}.
XSRS6.S=No se puede crear el directorio de copia de seguridad {0}.
XSRS7.S=Se ha producido una excepci\u00F3n inesperada durante la copia de seguridad.
XSRS8.S=El dispositivo de anotaci\u00F3n cronol\u00F3gica s\u00F3lo puede establecerse en el momento de creaci\u00F3n de la base de datos y no puede cambiarse sobre la marcha.
XSRS9.S=El registro {0} ya no existe
XSRSA.S=No se puede realizar una copia de seguridad de la base de datos cuando existen operaciones sin registrar no comprometidas. Comprometa las transacciones con operaciones de bloqueo de copia de seguridad. 
XSRSB.S=La copia de seguridad no se puede realizar en una transacci\u00F3n con operaciones no registradas sin comprometer.
XSRSC.S=No se puede realizar la copia de seguridad de la base de datos en {0}, es un directorio de base de datos.
XSTA2.S=Ya estaba activa una transacci\u00F3n cuando se intent\u00F3 activar otra transacci\u00F3n.
XSTB0.M=Se ha generado una excepci\u00F3n al terminar anormalmente la transacci\u00F3n.
XSTB2.M=No se pueden anotar los cambios de transacci\u00F3n, es posible que est\u00E9 intentando grabar en una base de datos de s\u00F3lo lectura.
XSTB3.M=No se puede terminar anormalmente la transacci\u00F3n porque el gesto de anotaciones cronol\u00F3gicas es nulo, probablemente debido a un error anterior.
XSTB5.M=Se ha encontrado un problema inesperado al crear la base de datos con la anotaci\u00F3n cronol\u00F3gica inhabilitada.
XSTB6.M=No se puede sustituir una tabla de transacci\u00F3n por otra mientras una est\u00E9 en uso.
XXXXX.C.6=Cierre de sesi\u00F3n de base de datos normal.
