
###############################################################################
#
# Text for exceptions
#
###############################################################################

# Monitor
XBM01.D=Error de arranque debido a una excepci\u00f3n, consulte la excepci\u00f3n siguiente para obtener detalles.
XBM02.D=Error de arranque debido a una falta de funcionalidad para {0}. Aseg\u00farese de que la classpath incluya el software Derby correcto.
XBM05.D=Error de arranque debido a la falta de informaci\u00f3n sobre la versi\u00f3n del producto para {0}.
XBM06.D=Error de arranque, no se puede acceder a una base de datos cifrada sin la contrase\u00f1a de arranque correcta.
XBM07.D=Error de arranque, la contrase\u00f1a de arranque debe tener al menos 8 bytes de longitud.
XBM08.D=No se ha podido instanciar la clase StorageFactory {1} de {0}.

XBM0G.D=No se ha podido iniciar el motor de cifrado. Aseg\u00farese de que est\u00e1 ejecutando Java 2 y que ha bajado un suministrador de cifrado como jce y lo ha situado en la classpath.
XBM0H.D=No se puede crear el directorio {0}.
XBM0I.D=No se puede eliminar el directorio {0}.
XBM0J.D=El directorio {0} ya existe.
XBM0K.D=Subprotocolo desconocido para el nombre de base de datos {0}.
XBM0L.D=La clase de esquema de autenticaci\u00f3n especificada {0} implementa la interfaz de autenticaci\u00f3n {1}.
XBM0M.D=Error al crear la instancia de la clase de esquema de autenticaci\u00f3n {0}.
XBM0N.D=No se ha podido registrar el controlador JDBC con java.sql.DriverManager, consulte la excepci\u00f3n siguiente para obtener detalles.
XBM0P.D=El suministrador de servicio es de s\u00f3lo lectura, operaci\u00f3n no permitida.
XBM0S.D=No se puede renombrar el archivo ''{0}'' como ''{1}''
XBM0T.D=Subprotocolo ambiguo para el nombre de base de datos {0}.
XBM0U.S=No se han registrado clases para el identificador {0}
XBM0V.S=Se ha generado una excepci\u00f3n al cargar la clase {1} registrada para el identificador {0}
XBM0W.S=Se ha generado una excepci\u00f3n al crear una instancia de la clase {1} registrada para el identificador {0}
XBM0X.D=La descripci\u00f3n de territorio suministrada ''{0}'' no es v\u00e1lida, se esperaba ln[_CO[_variante]]\nln=c\u00f3digo de idioma ISO-639 de dos letras en min\u00fasculas, CO=c\u00f3digo de pa\u00eds ISO-3166 de dos letras en may\u00fasculas, consulte java.util.Locale.
XBM0Y.D=No se encontr\u00f3 el directorio de copia de seguridad de base de datos {0}. Aseg\u00farese de que la v\u00eda de acceso para las copias de seguridad que se ha especificado sea la correcta.
XBM0Z.D=No se puede copiar el archivo ''{0}'' en ''{1}''. Aseg\u00farese de que haya suficiente espacio y que los permisos sean los adecuados. 
XBM0Q.D=No se encontr\u00f3 el archivo {0}. Aseg\u00farese de que la copia de seguridad es la correcta y que no est\u00e1 corrompida.
XBM0R.D=No se pudo eliminar el archivo {0}.

# Upgrade
XCW00.D=Actualizaci\u00f3n no soportada de ''{0}'' a ''{1}''.

# Feature not supported


# COntext service
08000=Conexi\u00f3n cerrada por una interrupci\u00f3n desconocida.

#../java/com/ibm/db2j/protocol/BasicServices/LockManager/messages.properties
40001=No se ha podido obtener un bloqueo debido a un punto muerto, el ciclo de bloqueos y esperas es:\n{0}La v\u00edctima seleccionada es XID : {1}

40XL1=No se ha podido obtener un bloqueo dentro del tiempo solicitado
40XL2=No se ha podido obtener un bloqueo dentro del tiempo solicitado.  El vuelco de lockTable es: {0}

# ClassManager
XBCM1.S=Error de enlace Java generado durante la carga de la clase generada {0}.
XBCM2.S=No se puede crear una instancia de la clase generada {0}.
XBCM3.S=El m\u00e9todo {1}() no existe en la clase generada {0}.

# Properties

XCY00.S=Valor no v\u00e1lido para la propiedad ''{0}''=''{1}''.
XCY02.S=El cambio de propiedad solicitado no est\u00e1 soportado ''{0}''=''{1}''.
XCY03.S=La propiedad necesaria ''{0}'' no se ha establecido.

# Cryptography
XBCX0.S=Excepci\u00f3n del suministrador de cifrado, consulte la excepci\u00f3n siguiente para obtener detalles.
XBCX1.S=Inicializando cifrado con modalidad no permitida, debe ser ENCRYPT o DECRYPT.
XBCX2.S=Inicializando cifrado con una contrase\u00f1a de arranque demasiado corta, debe tener al menos {0} caracteres de longitud
XBCX5.S=No se puede cambiar la contrase\u00f1a de arranque a nulo.
XBCX6.S=No se puede cambiar la contrase\u00f1a de arranque a un tipo serializable distinto de serie.
XBCX7.S=Formato incorrecto para cambiar la contrase\u00f1a de arranque.  El formato debe ser: contrase\u00f1a_arranque_anterior, contrase\u00f1a_arranque_nueva.
XBCX8.S=No se puede cambiar la contrase\u00f1a de arranque de una base de datos no cifrada.
XBCX9.S=No se puede cambiar la contrase\u00f1a de arranque de una base de datos de s\u00f3lo lectura.
XBCXA.S=Contrase\u00f1a de arranque incorrecta.
XBCXB.S=Relleno de cifrado ''{0}'' incorrecto o no se ha especificado relleno. Debe utilizar ''NoPadding''.
XBCXC.S=El algoritmo de cifrado ''{0}'' no existe. Compruebe que el suministrador ''{1}'' seleccionado ofrece soporte de este algoritmo.
XBCXD.S=El algoritmo de cifrado no se puede cambiar despu\u00e9s de crear la base de datos.
XBCXE.S=El suministrador de cifrado no se puede cambiar despu\u00e9s de crear la base de datos.
XBCXF.S=No se puede encontrar la clase ''{0}'' que representa el suministrador de cifrado.
XBCXG.S=El suministrador de cifrado ''{0}'' no existe.
XBCXH.S=El algoritmo de cifrado ''{0}'' no est\u00e1 en el formato correcto. El formato correcto es algoritmo/modalidadRetroalimentaci\u00f3n/NoPadding.
XBCXI.S=La modalidad de retroalimentaci\u00f3n ''{0}'' no est\u00e1 soportada. Las modalidades de retroalimentaci\u00f3n soportadas son CBC, CFB, OFB y ECB.
XBCXJ.S=La aplicaci\u00f3n est\u00e1 utilizando una versi\u00f3n de JCE (Java Cryptography Extension) anterior a la 1.2.1.  Actualice a JCE 1.2.1 y reintente la operaci\u00f3n.
XBCXK.S=La clave de cifrado proporcionada no coincide con la clave de cifrado utilizada al crear la base de datos. Aseg\u00farese de utilizar la clave de cifrado correcta y vuelva a intentarlo. 
XBCXL.S=El proceso de verificaci\u00f3n para la clave de cifrado no ha sido satisfactorio. Consulte la siguiente excepci\u00f3n para obtener m\u00e1s detalles. Las causas posibles pueden ser un error al acceder al archivo apropiado para llevar a cabo el proceso de verificaci\u00f3n.

#../java/com/ibm/db2j/impl/BasicServices/CacheService/Generic/messages.properties

# CacheStatementException messages
# sqlstate range: XBCA0 to XBCAZ

XBCA0.S=No se puede crear un nuevo objeto con la clave {1} en antememoria {0}, ya existe en antememoria.


# java/com/ibm/db2j/protocol/Database/Storage/Access/Interface.
# sqlstate range: XSAI0 to XSAIZ
XSAI2.S=El conglomerado ({0}) solicitado no existe.
XSAI3.S=Caracter\u00edstica no implementada.

# java/com/ibm/db2j/protocol/Database/Storage/Access/Interface
# RunTimeStatistics properties messages.
# sqlstate range: XSAJ0 to XSAJZ
XSAJ0.U=Tipo de exploraci\u00f3n
XSAJ1.U=N\u00famero de p\u00e1ginas visitadas
XSAJ2.U=N\u00famero de filas visitadas
XSAJ3.U=N\u00famero de filas suprimidas visitadas
XSAJ4.U=N\u00famero de filas cualificadas
XSAJ5.U=N\u00famero de columnas extra\u00eddas
XSAJ6.U=Bit establecido de columnas extra\u00eddas
XSAJ7.U=Altura del \u00e1rbol
XSAJ8.U=Tipo de ordenaci\u00f3n
XSAJA.U=N\u00famero de filas de entrada
XSAJB.U=N\u00famero de filas de salida
XSAJC.U=N\u00famero de fusiones realizadas
XSAJD.U=Tama\u00f1o de fusiones realizadas
XSAJE.U=Todo

#NOTE: The next three messages are the names of types of scans.
XSAJF.U=btree
XSAJG.U=heap
XSAJH.U=sort

#NOTE: The next two messages are types of sorts
XSAJI.U=externa
XSAJJ.U=interna

# java/com/ibm/db2j/protocol/Database/Storage/Access/XA.
# sqlstate range: XSAX0 to XSAXZ
XSAX0.S=Violaci\u00f3n de protocolo XA.
XSAX1.S=Se ha intentado iniciar una transacci\u00f3n global con un Xid de una transacci\u00f3n global existente.

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/AccessManager/Generic
# sqlstate range: XSAM0 to XSAMZ
XSAM0.S=Se he encontrado una excepci\u00f3n al intentar arrancar el m\u00f3dulo de ''{0}''.
XSAM2.S=No existe un \u00edndice o conglomerado con id de conglomerado ''{0}'' para eliminar.
XSAM3.S=No existe un \u00edndice o conglomerado con id de conglomerado ''{0}''.
XSAM4.S=No existe una clasificaci\u00f3n llamada ''{0}''.
XSAM5.S=La exploraci\u00f3n debe abrirse y colocarse llamando a next() antes de realizar otras llamadas.
XSAM6.S=Registro {2} de la p\u00e1gina {1} del contenedor {0} no encontrado.


#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/Generic
# sqlstate range: XSCG0 to XSCGZ
XSCG0.S=No se ha podido crear una plantilla.

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/Heap
# sqlstate range: XSCH0 to XSCHZ

XSCH8.S=La caracter\u00edstica no est\u00e1 implementada.
XSCH7.S=La exploraci\u00f3n no est\u00e1 posicionada.
XSCH6.S=El contenedor heap con id de contenedor {0} est\u00e1 cerrado.
XSCH5.S=Existe una discrepancia en la tabla base entre el n\u00famero de columna solicitado {0} y el n\u00famero m\u00e1ximo de columnas {1}.
XSCH4.S=No se puede crear el conglomerado.
XSCH1.S=Contenedor {0} no encontrado.
XSCH0.S=No se ha podido crear el contenedor.

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/BTree/Generic
# sqlstate range: XSCB0 to XSCBZ
XSCB9.S=Reservado para pruebas.
XSCB8.S=El conglomerado btree {0} est\u00e1 cerrado.
XSCB7.S=Se ha producido un error interno durante una exploraci\u00f3n btree - current_rh es nulo = {0}, clave de posici\u00f3n es nula = {1}.
XSCB6.S=Limitaci\u00f3n: no se puede actualizar o insertar el registro de un \u00edndice secundario btree debido a la falta de espacio en la p\u00e1gina. Utilice los par\u00e1metros derby.storage.pageSize y/o derby.storage.pageReservedSpace para solucionar esta limitaci\u00f3n.
XSCB5.S=No se ha podido encontrar la fila en el \u00e1rbol durante una operaci\u00f3n deshacer l\u00f3gica de una inserci\u00f3n o supresi\u00f3n de btree.
XSCB4.S=Se ha llamado a un m\u00e9todo de una exploraci\u00f3n abierta btree antes de posicionar la exploraci\u00f3n en la primera fila (esto es, no se realizado a\u00fan una llamada next()).  El estado actual de la exploraci\u00f3n es ({0}).
XSCB3.S=Caracter\u00edstica no implementada.
XSCB2.S=No se ha encontrado la propiedad necesaria {0} en la lista de propiedades dada para createConglomerate() de un \u00edndice secundario btree.
XSCB1.S=Contenedor {0} no encontrado.
XSCB0.S=No se ha podido crear el contenedor.

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Sort/External
# sqlstate range: XSAS0 to XSASZ

XSAS6.S=No se han podido adquirir los recursos para la clasificaci\u00f3n.
XSAS3.S=El tipo de fila insertada en la clasificaci\u00f3n no coincide con la plantilla de clasificaci\u00f3n.
XSAS1.S=Se ha intentado extraer una fila antes de iniciar la clasificaci\u00f3n o despu\u00e9s de finalizarla.
XSAS0.S=Se ha llamado a un m\u00e9todo de interfaz de controlador de exploraci\u00f3n que no es apropiado para una exploraci\u00f3n sobre una clasificaci\u00f3n.

# java/com/ibm/db2j/protocol/Database/Storage/RawStore/Interface.
# statement errors.
# sqlstate range: XSRS0 to XSRSZ
XSRS0.S=No se puede inmovilizar la base de datos despu\u00e9s de que ya ha sido inmovilizada.
XSRS1.S=No se puede realizar copia de seguridad de la base de datos en {0}, ya que no es un directorio.
XSRS4.S=Error al renombrar el archivo (durante la copia de seguridad) de {0} en {1}.
XSRS5.S=Error al copiar el archivo (durante la copia de seguridad) de {0} en {1}.
XSRS6.S=No se puede crear el directorio de copia de seguridad {0}.
XSRS7.S=Se ha producido una excepci\u00f3n inesperada durante la copia de seguridad.
XSRS8.S=El dispositivo de anotaci\u00f3n cronol\u00f3gica s\u00f3lo puede establecerse en el momento de creaci\u00f3n de la base de datos y no puede cambiarse sobre la marcha.
XSRS9.S=El registro {0} ya no existe


# java/com/ibm/db2j/impl/Database/Storage/RawStore/Log/Generic
# statement errors.
# sqlstate range: XSLB0 to XSLBZ
XSLB9.S=No se pueden emitir m\u00e1s cambios, la f\u00e1brica de anotaci\u00f3n cronol\u00f3gica se ha detenido.
XSLB8.S=Intentando restablecer la exploraci\u00f3n en {0}, m\u00e1s all\u00e1 de su l\u00edmite de {1}.
XSLB6.S=Intentado anotar un 0 o registro de anotaci\u00f3n cronol\u00f3gica de longitud -ve.
XSLB5.S=Instante de truncationLWM {1} no permitido para el punto de truncamiento {0}. El rango permitido es de {2} a {3}.
XSLB4.S=No se puede encontrar truncationLWM {0}.
XSLB2.S=La operaci\u00f3n de anotaci\u00f3n cronol\u00f3gica {0} est\u00e1 registrando demasiados datos, ha llenado el almacenamiento intermedio interno para anotaciones.
XSLB1.S=La operaci\u00f3n de anotaci\u00f3n cronol\u00f3gica {0} ha encontrado un error al grabarse en la corriente de anotaciones, que podr\u00eda deberse a una operaci\u00f3n de anotaci\u00f3n errante o al llenado del almacenamiento intermedio interno para anotaciones debido a un exceso de operaciones de anotaci\u00f3n de gran tama\u00f1o.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Log/Generic
# database errors.
# sqlstate range: XSLA0 to XSLAZ
XSLAT.D=Existe el directorio de anotaciones cronol\u00f3gicas {0}. Aseg\u00farese de que la ubicaci\u00f3n logDevice especificada sea la correcta.  
XSLAS.D=No se encontr\u00f3 el directorio de anotaciones cronol\u00f3gicas {0} al restaurar la copia de seguridad. Aseg\u00farese de que la copia de seguridad es la correcta y que no est\u00e1 corrompida.
XSLAR.D=No se pudo copiar el archivo de anotaciones cronol\u00f3gicas ''{0}'' en ''{1}'' al realizar la restauraci\u00f3n. Aseg\u00farese de que haya suficiente espacio y que los permisos sean los adecuados. 
XSLAQ.D=No se puede crear una archivo de anotaciones cronol\u00f3gicas en el directorio {0}.
XSLAP.D=La base de datos {0} est\u00e1 en la versi\u00f3n {1}. No es posible actualizar bases de datos Beta,
XSLAO.D=Error de recuperaci\u00f3n, problema inesperado {0}.
XSLAN.D=La base de datos en {0} tiene un formato incompatible con la versi\u00f3n actual del software.  La base de datos se ha creado o actualizado con la versi\u00f3n {1}.
XSLAM.D=No se puede verificar el formato de la base de datos en {1} debido a una excepci\u00f3n de E/S.
XSLAL.D=El tama\u00f1o del registro de anotaci\u00f3n cronol\u00f3gica {2} supera el tama\u00f1o m\u00e1ximo del archivo de anotaciones cronol\u00f3gicas permitido {3}. Se ha encontrado un error en el archivo de anotaciones cronol\u00f3gicas {0}, posici\u00f3n {1}
XSLAK.D=La base de datos ha superado el n\u00famero de archivo de anotaciones cronol\u00f3gicas m\u00e1s grande {0}.
XSLAJ.D=Se ha se\u00f1alado al sistema de anotaciones para que concluya debido a un problema anterior y que no permitir\u00e1 m\u00e1s operaciones hasta que concluya y vuelva iniciar el sistema.
XSLAI.D=No se puede anotar el registro de anotaci\u00f3n cronol\u00f3gica de punto de control
XSLAH.D=Se va a actualizar una base de datos de s\u00f3lo lectura.
XSLAF.D=Se ha creado una base de datos de s\u00f3lo lectura con almacenamientos intermedios de datos dirty.
XSLAE.D=El archivo de control en {0} no se puede grabar o actualizar.
XSLAD.D=Registro de anotaci\u00f3n cronol\u00f3gica en instante {2} en archivo de anotaciones cronol\u00f3gicas {3} da\u00f1ado. Se esperaba una longitud de registro de anotaci\u00f3n cronol\u00f3gica de {0}, longitud real {1}.
XSLAC.D=La base de datos en {0} tiene un formato incompatible con la versi\u00f3n actual del software, puede haber sido creada o actualizada por una versi\u00f3n posterior.
XSLAB.D=No se puede encontrar el archivo de anotaciones cronol\u00f3gicas {0}, aseg\u00farese de que la propiedad logDevice se ha establecido con el separador de v\u00eda de acceso correcto para la plataforma.
XSLAA.D=Una excepci\u00f3n anterior ha marcado el almac\u00e9n para concluirlo.
XSLA8.D=No se puede retrotraer la transacci\u00f3n {0}, intentando compensar la operaci\u00f3n {1} con {2}
XSLA7.D=No se puede rehacer la operaci\u00f3n {0} en el archivo de anotaciones cronol\u00f3gicas.
XSLA6.D=No se puede recuperar la base de datos.
XSLA5.D=No se puede leer la corriente de datos para las anotaciones cronol\u00f3gicas por alguna raz\u00f3n para retrotraer la transacci\u00f3n {0}.
XSLA4.D=No se puede grabar en las anotaciones cronol\u00f3gicas, puede que est\u00e9n llenas.  Suprima archivos innecesarios.  Tambi\u00e9n es posible que el sistema de archivos sea de s\u00f3lo lectura, que el disco tenga error o alg\u00fan otro problema con el soporte.
XSLA3.D=Anotaciones cronol\u00f3gicas da\u00f1adas, datos no v\u00e1lidos en la corriente de anotaciones.
XSLA2.D=Se concluir\u00e1 el sistema, se obtuvo una excepci\u00f3n de E/S al acceder al archivo de anotaciones cronol\u00f3gicas.
XSLA1.D=Se ha enviado el registro de anotaciones cronol\u00f3gicas a la corriente, pero no puede aplicarse al almac\u00e9n (Objeto {0}).  Esto tambi\u00e9n puede producir problemas de recuperaci\u00f3n.
XSLA0.D=No se puede enviar el archivo de anotaciones cronol\u00f3gicas al disco {0}.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# statement errors.
# sqlstate range: XSTA0 to XSTAZ
# changed XSTA0 and XSTA1 to match DB2 sqlstates - bug 4466
3B501.S=Ya existe un SAVEPOINT con el nombre que se ha pasado en la transacci\u00f3n actual.
3B502.S=Se ha especificado RELEASE o ROLLBACK TO SAVEPOINT, pero no existe ning\u00fan SAVEPOINT.
3B001.S=SAVEPOINT, {0} no existe o no est\u00e1 activo en la transacci\u00f3n actual.
3B002.S=Se alcanz\u00f3 el n\u00famero m\u00e1ximo de SAVEPOINT. 
XSTA2.S=Ya estaba activa una transacci\u00f3n cuando se intent\u00f3 activar otra transacci\u00f3n.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# transaction errors.
# sqlstate range: 40XT0 to 40XTZ
40XT0=El m\u00f3dulo RawSotre ha identificado un error interno.
40XT1=Se ha generado una excepci\u00f3n al comprometer la transacci\u00f3n.
40XT2=Se ha generado una excepci\u00f3n al retrotraer un SAVEPOINT.
40XT4=Se ha intentado cerrar una transacci\u00f3n que segu\u00eda activa, la transacci\u00f3n ha terminado anormalmente.
40XT5=Se he generado una excepci\u00f3n durante una transacci\u00f3n interna.
40XT6=La base de datos est\u00e1 en estado de reposo, no se puede activar la transacci\u00f3n.  Espere un momento a que salga del estado de reposo.
40XT7=La operaci\u00f3n no est\u00e1 soportada en una transacci\u00f3n interna.

#
#java/com/ibm/db2j/internalUtil
#	Id Parse Errors       			XCXA0-XCXAZ
#  	Db Class Path Parse Errors 	 	XCXB0-XCXBZ
# 	Id List Parse Errors			XCXC0-XCXCZ
#  	IO Errors						XCXD0-XCXDZ
#	LocaleFinder Errors				XCXE0-XCXEZ
XCXA0.S=Identificador no v\u00e1lido.
XCXB0.S=Classpath de base de datos no v\u00e1lida: ''{0}''.
XCXC0.S=Lista de id no v\u00e1lida.
XCXE0.S=Est\u00e1 intentando realizar una operaci\u00f3n que utiliza el territorio de la base de datos, pero la base de datos no dispone de un territorio.
# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# system errors.
# sqlstate range: XSTB0 to XSTBZ
XSTB0.M=Se ha generado una excepci\u00f3n al terminar anormalmente la transacci\u00f3n.
XSTB2.M=No se pueden anotar los cambios de transacci\u00f3n, es posible que est\u00e9 intentando grabar en una base de datos de s\u00f3lo lectura.
XSTB3.M=No se puede terminar anormalmente la transacci\u00f3n porque el gesto de anotaciones cronol\u00f3gicas es nulo, probablemente debido a un error anterior.
XSTB5.M=Se ha encontrado un problema inesperado al crear la base de datos con la anotaci\u00f3n cronol\u00f3gica inhabilitada.
XSTB6.M=No se puede sustituir una tabla de transacci\u00f3n por otra mientras una est\u00e9 en uso.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# transaction errors.
# sqlstate range: 40XD0 to 40XDZ
40XD0=Se ha cerrado el contenedor
40XD1=El contenedor se ha abierto en modalidad de s\u00f3lo lectura
40XD2=No se puede abrir el contenedor {0}, o ha sido eliminado o no existe


# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# statement errors.
# sqlstate range: XSDA0 to XSDAZ
XSDA1.S=Se ha intentado acceder a una ranura fuera de rango de una p\u00e1gina
XSDA2.S=Se ha intentado actualizar un registro suprimido
XSDA3.S=Limitaci\u00f3n: no se puede actualizar o insertar el registro debido a la falta de espacio en la p\u00e1gina. Utilice los par\u00e1metros derby.storage.pageSize y/o derby.storage.pageReservedSpace para solucionar esta limitaci\u00f3n.
XSDA4.S=Se ha generado una excepci\u00f3n inesperada
XSDA5.S=Se ha intentado recuperar un registro que no ha sido suprimido
XSDA6.S=La columna {0} de la fila es nula, debe asignarse un valor para que apunte a un objeto.
XSDA7.S=La restauraci\u00f3n de un objeto serializable o SQLData de clase {0} ha intentado leer m\u00e1s datos que los almacenados originalmente
XSDA8.S=Excepci\u00f3n durante la restauraci\u00f3n de un objeto serializable o SQLData de clase {0}
XSDA9.S=Clase no encontrada durante la restauraci\u00f3n de un objeto serializable o SQLData de clase {0}
XSDAA.S=Indicaci\u00f3n de la hora {0} no permitida, bien procede de una p\u00e1gina diferente o de una implementaci\u00f3n incompatible
XSDAB.S=no se puede establecer una indicaci\u00f3n de la hora nula
XSDAC.S=Se intentan mover p\u00e1ginas o filas de un contenedor a otro.
XSDAD.S=Se intentan mover cero filas de una p\u00e1gina a otra.
XSDAE.S=S\u00f3lo se puede crear un descriptor de contexto de registro para un id de descriptor de contexto de registro especial.
XSDAF.S=Utilizando un descriptor de contexto de registro especial como si fuese uno normal.
XSDAG.S=La transacci\u00f3n superior anidada de asignaci\u00f3n no puede abrir el contenedor.
XSDAI.S=La p\u00e1gina {0} que se est\u00e1 eliminando ya ha sido bloqueada para suprimir su asignaci\u00f3n.
XSDAJ.S=Excepci\u00f3n durante la grabaci\u00f3n de un objeto serializable o SQLData
XSDAK.S=Se ha obtenido una p\u00e1gina incorrecta para el descriptor de contexto de registro {0}.
XSDAL.S=El descriptor de contexto de registro {0} se\u00f1ala inesperadamente a una p\u00e1gina de desbordamiento.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# database errors.
# sqlstate range: XSDB0 to XSDBZ
XSDB0.D=Excepci\u00f3n inesperada en la p\u00e1gina en memoria {0}
XSDB1.D=Formato de p\u00e1gina desconocido en la p\u00e1gina {0}
XSDB2.D=Formato de contenedor desconocido en el contenedor {0} : {1}
XSDB3.D=La informaci\u00f3n del contenedor no se puede cambiar una vez grabada: era {0}, ahora {1}
XSDB4.D=La p\u00e1gina {0} es de la versi\u00f3n {1}, el archivo de anotaciones cronol\u00f3gicas contiene un cambio versi\u00f3n {2}, o faltan registros de anotaci\u00f3n cronol\u00f3gica de esta p\u00e1gina o esta p\u00e1gina no se ha grabado correctamente en el disco.
XSDB5.D=Las anotaciones cronol\u00f3gicas tienen un registro de cambio en la p\u00e1gina {0} que est\u00e1 m\u00e1s all\u00e1 del final del contenedor.
XSDB6.D=Es posible que otra instancia de Derby haya iniciado ya la base de datos {0}.
XSDB7.D=AVISO: Derby (instancia {0}) est\u00e1 intentando arrancar la base datos {1} a pesar de que Derby (instancia {2}) pueda seguir activo. S\u00f3lo una instancia de Derby debe arrancar una base de datos al mismo tiempo. Pueden producirse da\u00f1os graves y no recuperables aunque podr\u00edan haberse producido ya.
XSDB8.D=AVISO: Derby (instancia {0}) est\u00e1 intentando arrancar la base datos {1} a pesar de que Derby (instancia {2}) pueda seguir activo. S\u00f3lo una instancia de Derby debe arrancar una base de datos al mismo tiempo. Pueden producirse da\u00f1os graves y no recuperables si 2 instancias de Derby se arrancan en la misma base de datos al mismo tiempo. Se ha establecido la propiedad db2j.database.forceDatabaseLock=true para que no arranque la base de datos mientras est\u00e9 presente db.lck. Normalmente este archivo se elimina cuando termina la primera instancia de Derby que se arranca en la base de datos, pero puede dejarse a veces al concluir. En este caso ser\u00e1 necesario eliminar el archivo a mano.  Es importante comprobar que no hay ninguna otra VM accediendo a la base de datos antes de suprimir el archivo db.lck a mano.
XSDB9.D=El contenedor de corriente {0} est\u00e1 da\u00f1ado.
XSDBA.D=Anomal\u00eda al intentar asignar el objeto {0}.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/FileSystem
# statment errors.
# sqlstate range: XSDF0 to XSDFZ
XSDF0.S=No se ha podido crear el archivo {0} porque ya existe.
XSDF1.S=Excepci\u00f3n durante la creaci\u00f3n del archivo {0} del contenedor
XSDF2.S=Excepci\u00f3n durante la creaci\u00f3n del archivo {0} del contenedor, no se pudo eliminar el archivo.  Excepci\u00f3n: {1}.
XSDF3.S=No se puede crear el segmento {0}.
XSDF4.S=Excepci\u00f3n durante la eliminaci\u00f3n del archivo {0} del contenedor eliminado, no se ha podido eliminar el archivo {1}.
XSDF6.S=No se puede encontrar la p\u00e1gina de asignaci\u00f3n {0}.
XSDF7.S=No se ha podido enclavar la p\u00e1gina que  se acaba de crear {0}
XSDF8.S=No se puede encontrar la p\u00e1gina {0} para reutilizar.
XSDFB.S=Operaci\u00f3n no soportada por una base de datos de s\u00f3lo lectura
XSDFD.S=Se ha le\u00eddo una imagen de p\u00e1gina diferente en 2 E/S de la p\u00e1gina {0}, la primera imagen tiene una suma de comprobaci\u00f3n incorrecta, la segunda imagen tiene una suma de comprobaci\u00f3n correcta. Im\u00e1genes de p\u00e1gina: {1} {2}
XSDFF.S=Anomal\u00eda en la operaci\u00f3n solicitada debido a una excepci\u00f3n inesperada.

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/FileSystem
# database errors.
# sqlstate range: XSDG0 to XSDGZ
XSDG0.D=No se ha podido leer la p\u00e1gina {0} del disco.
XSDG1.D=No se ha podido grabar la p\u00e1gina {0} en el disco, compruebe si el disco est\u00e1 lleno.
XSDG2.D=Suma de comprobaci\u00f3n no v\u00e1lida en la p\u00e1gina {0}, se esperaba {1}, versi\u00f3n en disco {2}, vuelco de p\u00e1gina: {3}
XSDG3.D=No se ha podido acceder a los metadatos del contenedor {0}
XSDG5.D=La base de datos no estaba en modalidad de creaci\u00f3n cuando se ha llamado a createFinished.
XSDG6.D=No se encontr\u00f3 el directorio de segmentos de datos al restaurar la copia de seguridad {0}. Aseg\u00farese de que la copia de seguridad es la correcta y que no est\u00e1 corrompida.
XSDG7.D=No ha sido posible eliminar el directorio {0} durante la restauraci\u00f3n. Aseg\u00farese de que los permisos son los adecuados.
XSDG8.D=No se pudo copiar el directorio ''{0}'' en ''{1}'' al realizar la restauraci\u00f3n. Aseg\u00farese de que haya suficiente espacio y que los permisos sean los adecuados. 

# language
01500=Se ha eliminado la restricci\u00f3n {0} de la tabla {1}.
01501=Se ha eliminado la vista {0}.
01502=Se ha eliminado el desencadenante {0} de la tabla {1}.
01503=Se ha modificado la columna {0} de la tabla {1} a\u00f1adiendo una restricci\u00f3n no nula.
01504=El nuevo \u00edndice es un duplicado de un \u00edndice existente: {0}.
01505=Es posible que el valor {0} est\u00e9 truncado.
01003=Se han eliminado valores nulos del argumento de una funci\u00f3n de columna.
0100E=XX Intent\u00f3 devolver demasiados conjuntos de resultados
02000=No se ha encontrado ninguna fila para FETCH, UPDATE o DELETE; o el resultado de una consulta es una tabla vac\u00eda.
21000=La subconsulta escalar tiene permitido devolver una sola fila.
22001=Se ha producido un error de truncamiento al intentar recortar {0} ''{1}'' a una longitud {2}.
54006=La longitud resultante de la operaci\u00f3n {0} es mayor que {1}.
22003=El valor resultante queda fuera del rango para el tipo de datos {0}.
22005=Se ha intentado obtener un valor de datos de tipo ''{0}'' de un valor de datos de tipo ''{1}''.
22007.S.180=La representaci\u00f3n de serie de un valor de fecha y hora queda fuera de rango.
22007.S.181=La sintaxis de la representaci\u00f3n de serie de un valor de fecha y hora es incorrecta.
22011=El segundo o tercer argumento de la funci\u00f3n SUBSTR queda fuera de rango.
22012=Intento de divisi\u00f3n por cero.
22013=Intento de calcular la ra\u00edz cuadrada de un n\u00famero negativo, ''{0}''.
22014=La posici\u00f3n inicial de LOCATE no es v\u00e1lida; debe ser un entero positivo.  El \u00edndice desde el que comenzar la b\u00fasqueda es ''{2}''.  La serie que se busca es ''{0}''.  La serie en que se busca es ''{1}''. 
22015=La funci\u00f3n ''{0}'' no est\u00e1 permitida en el siguiente conjunto de tipos.  El primer operando es de tipo ''{1}''.  El segundo operando es de tipo ''{2}''.  El tercer operando (posici\u00f3n inicial) es de tipo ''{3}''.
22018=Formato de serie de caracteres no v\u00e1lido para tipo {0}.
22019=Secuencia de escape no v\u00e1lida, ''{0}''. La serie de escape debe contener exactamente un car\u00e1cter. No puede ser nula o contener m\u00e1s de un car\u00e1cter.
22025=El car\u00e1cter de escape debe ir seguido del car\u00e1cter de escape, '_' o '%'. No puede ir seguido de ning\u00fan otro car\u00e1cter o ir al final del patr\u00f3n.
22027=La funci\u00f3n incorporada TRIM() soporta un solo car\u00e1cter de ajuste.  Las funciones incorporadas LTRIM() y RTRIM() soportan varios caracteres de ajuste.
22500=No se pueden utilizar par\u00e1metros ? para el patr\u00f3n LIKE y la cl\u00e1usula ESCAPE.
22501=Una cl\u00e1usula ESCAPE de NULL devuelve resultados no definidos y no est\u00e1 permitida.
23502=La columna ''{0}'' no puede aceptar un valor NULL.
23505=La sentencia ha terminado anormalmente porque habr\u00eda provocado un valor de clave duplicado en una restricci\u00f3n de clave \u00fanica o primaria o en un \u00edndice \u00fanico identificado por ''{0}' definido en ''{1}''.
23503={2} en la tabla ''{1}'' ha causado una violaci\u00f3n de restricci\u00f3n de clave for\u00e1nea ''{0}'' de la clave {3}.  La sentencia se ha retrotra\u00eddo.
23513=La restricci\u00f3n de comprobaci\u00f3n ''{1}'' se ha violado al realizar un INSERT o UPDATE en la tabla ''{0}''.
38000=Se he generado la excepci\u00f3n ''{0}'' al evaluar una expresi\u00f3n.
38001=No se permite a la rutina externa que ejecute sentencias SQL.
38002=La rutina intent\u00f3 modificar datos, cuando \u00e9sta no estaba definida como MODIFIES SQL DATA.
38004=La rutina intent\u00f3 leer datos, cuando \u00e9sta no estaba definida como READS SQL DATA.
39004=No se puede pasar un valor NULL a un m\u00e9todo que toma un par\u00e1metro de tipo primitivo ''{0}''.
40XC0=Sentencia muerta. Esto puede haber sido provocado por un error grave de transacci\u00f3n dentro de esta sentencia.
# this error is retired in 1.3
42000=Error de sintaxis o violaci\u00f3n de norma de acceso; consulte los errores adicionales para obtener detalles.

# DB2 error for max length violation by char, varchar and long varchar. In future, this error message will be used for other purposes too
42601=En una sentencia ALTER, la columna ''{0}'' se ha especificado como NOT NULL y no se ha especificado la cl\u00e1usula DEFAULT o se ha especificado como DEFAULT NULL.
42601.S.372=La sentencia ALTER TABLE no puede a\u00f1adir una columna IDENTITY a una tabla. 
42606=Se ha detectado una constante hexadecimal no v\u00e1lida que comienza por ''{0}''.
54002=Una constante de serie que comienza por ''{0}'' es demasiado larga.
42611=El atributo de longitud, precisi\u00f3n o escala para columna o correlaci\u00f3n de tipo ''{0}'' no es v\u00e1lido.

42605=El n\u00famero de argumentos para la funci\u00f3n ''{0}'' es incorrecto.
42610=Todos los argumentos de la funci\u00f3n COALESC/VALUE no pueden ser par\u00e1metros. Al menos debe haber un argumento que no sea un par\u00e1metro.

42613=Hay una o m\u00e1s palabras claves conflictivas en relaci\u00f3n a la cl\u00e1usula ''{0}''.
42621=Una restricci\u00f3n de comprobaci\u00f3n o columna generada definida con ''{0}'' no es v\u00e1lida.
42734=El nombre ''{0}'' que se especific\u00f3 en el contexto ''{1}'' no es exclusivo.
# DB2 error for invalid set schema
42802=El n\u00famero de valores asignado no coincide con el n\u00famero de columnas especificadas o impl\u00edcitas.
42815.S.713=El valor de sustituci\u00f3n para ''{0}'' no es v\u00e1lido.
42815.S.171=El tipo de datos, longitud o valor de argumentos ''{0}'' y ''{1}'' es incompatible.
42820=El literal de coma flotante ''{0}'' contiene m\u00e1s de 30 caracteres.
42824=Un operando de LIKE no es una serie, o el primer operando no es una columna.
42831=''{0}'' no puede ser una columna de clave primaria o clave \u00fanica porque puede contener valores nulos.
42834=No se puede especificar SET NULL porque FOREIGN KEY ''{0}'' no puede contener valores nulos.  
42884=No se encontr\u00f3 ninguna rutina autorizada con el nombre ''{0}'' del tipo ''{1}'' que tuviese argumentos compatibles.
42886=''{0}'' par\u00e1metro ''{1}'' precisa de un marcador de par\u00e1metros ''?''.
42894=El valor DEFAULT o el valor del atributo IDENTITY no es v\u00e1lido para la columna ''{0}''.
428C1=S\u00f3lo se permite una columna de identidad en una tabla.
42903=Uso no v\u00e1lido de una funci\u00f3n de agregaci\u00f3n.
42908=La sentencia CREATE VIEW no incluye una lista de columnas.
42915=La clave for\u00e1nea ''{0}'' no es v\u00e1lida por la raz\u00f3n siguiente: ''{1}''. 
42972=Una cl\u00e1usula ON asociada a un operador JOIN no es v\u00e1lida.
42X01=Error de sintaxis: {0}.
42X02={0}.
42X03=El nombre de columna ''{0}'' est\u00e1 en m\u00e1s de una tabla de la lista FROM.
42X04=La columna ''{0}'' no est\u00e1 en ninguna tabla de la lista FROM o aparece en una especificaci\u00f3n de uni\u00f3n y est\u00e1 fuera del \u00e1mbito de la especificaci\u00f3n de uni\u00f3n o aparece en una cl\u00e1usula HAVING y no est\u00e1 en la lista GROUP BY.  Si se trata de una sentencia CREATE o ALTER TABLE entonces ''{0}'' no es una columna de la tabla destino.
42X05=La tabla ''{0}'' no existe.
42X06=Se han especificado demasiadas columnas de resultados para la tabla ''{0}''.
42X07=NULL s\u00f3lo est\u00e1 permitido en una cl\u00e1usula VALUES dentro de una sentencia INSERT.
42X08=El constructor de la clase ''{0}'' no se puede utilizar como tabla virtual externa porque la clase no implementa ''{1}''
42X09=La tabla o nombre de alias ''{0}'' se utiliza m\u00e1s de una vez en la lista FROM.
42X10=''{0}'' no es un nombre de tabla expuesto en el \u00e1mbito en que aparece.
42622=El nombre ''{0}'' es demasiado largo. La longitud m\u00e1xima es ''{1}''.
42X12=El nombre de columna ''{0}'' aparece m\u00e1s de una vez en la sentencia de creaci\u00f3n de la tabla.
54011=Se han especificado demasiadas columnas ({0}) para la tabla o vista {1}. El l\u00edmite es {2}.
42Z9F=Demasiados \u00edndices ({0}) en la tabla {1}. El l\u00edmite es {2}.
42X13=El nombre de columna ''{0}'' aparece m\u00e1s de una vez en la lista de columnas de la sentencia de inserci\u00f3n.
42X14=''{0}'' no es una columna en la tabla o VTI ''{1}''.
42X15=El nombre de columna ''{0}'' aparece en una sentencia sin una lista FROM.
42X16=El nombre de columna ''{0}'' aparece varias veces en la cl\u00e1usula SET de una sentencia de actualizaci\u00f3n.
42X17=El valor ''{0}'' no es v\u00e1lido como especificaci\u00f3n joinOrder en la lista Properties de una cl\u00e1usula FROM. S\u00f3lo son v\u00e1lidos los valores FIXED y UNFIXED.
42803=Una expresi\u00f3n que contiene la columna ''{0}'' aparece en la lista SELECT y no forma parte de una cl\u00e1usula GROUP BY.
42818=Las comparaciones entre ''{0}'' y ''{1}'' no est\u00e1n soportadas.
42X19=La cl\u00e1usula WHERE o HAVING o definici\u00f3n CHECK CONSTRAINT es una expresi\u00f3n ''{0}''.  Debe ser una expresi\u00f3n BOOLEAN.
42X23=El cursor {0} no es actualizable.
#42X24=The unary ''-'' operator is not allowed on the ''{0}'' type.
42X25=No se permite la funci\u00f3n ''{0}'' sobre el tipo ''{1}''.
42X26=La clase ''{0}'' de la columna ''{1}'' no existe o es inaccesible. Esto puede ocurrir si la clase no es p\u00fablica.
42X28=La tabla a suprimir ''{0}'' no es destino del cursor ''{1}''.
42X29=La tabla a actualizar ''{0}'' no es destino del cursor ''{1}''.
42X30=Cursor ''{0}'' no encontrado. Verifique que AutoCommit es OFF.
42X31=La columna ''{0}'' no est\u00e1 en la lista FOR UPDATE del cursor ''{1}''.
42X32=El n\u00famero de columnas en la lista de columnas derivadas debe coincidir con el n\u00famero de columnas de la tabla ''{0}''.
42X33=La lista de columnas derivadas contiene un nombre de columna duplicado ''{0}''.
42X34=Hay un par\u00e1metro ? en la lista de selecci\u00f3n.  No est\u00e1 permitido.
42X35=No est\u00e1 permitido que ambos operandos de ''{0}'' sean par\u00e1metros ?.
42X36=No est\u00e1 permitido que el operador ''{0}'' tome un par\u00e1metro ? como operando.
42X37=El operador unitario ''{0}'' no est\u00e1 permitido sobre el tipo ''{1}''.
42X38=''SELECT *'' s\u00f3lo est\u00e1 permitido en subconsultas EXISTS y NOT EXISTS.
42X39=La consulta s\u00f3lo tiene permitido devolver una sola columna.
42X40=Un NOT tiene un operando no booleano. El operando de NOT debe dar como resultado TRUE, FALSE o UNKNOWN.
42X41=La propiedad ''{0}'' no es v\u00e1lida en la cl\u00e1usula Properties de una lista FROM (la propiedad se establec\u00eda como ''{1}'').
42821=Las columnas de tipo ''{0}'' no pueden contener valores de tipo ''{1}''. 
42X43=El ResultSetMetaData devuelto para la clase/objeto ''{0}'' era nulo. El ResultSetMetaData no debe ser nulo para poder utilizar esta clase como tabla virtual externa.
42X44=Longitud ''{0}'' no v\u00e1lida en la especificaci\u00f3n de columna.
# 42X45=
# 42X46=
# 42X47=
42X48=El valor ''{1}'' no es una precisi\u00f3n v\u00e1lida para {0}.
42X49=El valor ''{0}'' no es un literal entero v\u00e1lido.
42X50=No se ha encontrado ning\u00fan m\u00e9todo que pueda coincidir con la llamada de m\u00e9todo {0}.{1}({2}) despu\u00e9s de probar todas las combinaciones de los tipos de objeto y primitivo y todas las conversiones de tipos posibles de todos los par\u00e1metros que pudiera tener la llamada de m\u00e9todo.  Es posible que el m\u00e9todo exista, pero no es p\u00fablico y/o est\u00e1tico, o que los tipos de par\u00e1metro no sean convertibles por la invocaci\u00f3n del m\u00e9todo.
42X51=La clase ''{0}'' no existe o es inaccesible. Esto puede ocurrir si la clase no es p\u00fablica.
42X52=No est\u00e1 permitido que el m\u00e9todo de llamada (''{0}'') utilice un receptor del tipo primitivo Java ''{1}''.
42X53=El predicado LIKE s\u00f3lo puede tener los operandos ''CHAR'' o ''VARCHAR'. El tipo ''{0}'' no est\u00e1 permitido.
42X54=El m\u00e9todo Java ''{0}'' tiene un ? como receptor.  No est\u00e1 permitido.
42X55=El nombre de tabla ''{1}'' debe ser el mismo que ''{0}''.
42X56=El n\u00famero de columnas de la lista de columnas de la vista no coincide con el n\u00famero de columnas de la expresi\u00f3n de consulta subyacente en la definici\u00f3n de la vista para ''{0}''.
42X57=getColumnCount() de la tabla virtual externa ''{0}'' ha devuelto un valor no v\u00e1lido ''{1}''.  Los valores v\u00e1lidos son >= 1.
42X58=El n\u00famero de columnas a la izquierda y derecha de UNION debe ser el mismo.
42X59=El n\u00famero de columnas en cada constructor VALUES debe ser el mismo.
42X60=Se ha especificado un valor no v\u00e1lido ''{0}'' para la propiedad insertMode de la tabla ''{1}''.
42X61=Los tipos ''{0}'' y ''{1}'' no son compatibles con UNION.
42X62=''{0}'' no se permite en el esquema ''{1}''.
42X63=La cl\u00e1usula USING no ha devuelto ning\u00fan resultado, no se pueden establecer par\u00e1metros.
42X64=Se ha especificado un valor no v\u00e1lido ''{0}'' para la propiedad useStatistics en la lista Properties. TRUE o FALSE son los \u00fanicos valores v\u00e1lidos.
42X65=El \u00edndice ''{0}'' no existe.
42X66=El nombre de columna ''{0}'' aparece m\u00e1s de una vez en la sentencia de creaci\u00f3n del \u00edndice.
42X68=No se ha encontrado ning\u00fan campo ''{0}'' que pertenezca a la clase ''{1}''.  Es posible que el campo exista pero que no sea p\u00fablico, o que la clase no exista o no sea p\u00fablica.
42X69=No est\u00e1 permitido hacer referencia a un campo (''{0}'') utilizando una expresi\u00f3n de referencia del tipo primitivo Java ''{1}''.
42X72=No se ha encontrado ning\u00fan campo est\u00e1tico ''{0}'' que pertenezca a la clase ''{1}''.  Es posible que el campo exista pero que no sea p\u00fablico y/o est\u00e1tico, o que la clase no exista o no sea p\u00fablica.
42X73=Resoluci\u00f3n ambigua del m\u00e9todo para la firma {0}.{1}({2}). (No hay un m\u00e9todo espec\u00edfico que sea m\u00e1s importante).
42X74=Sintaxis de la sentencia CALL no v\u00e1lida.
42X75=No se ha encontrado ning\u00fan constructor con la firma {0}({1}).  Es posible que los tipos de par\u00e1metro no sean convertibles por la invocaci\u00f3n del m\u00e9todo.
42X76=Al menos una columna, ''{0}'', en la clave primaria que se va a a\u00f1adir acepta nulos. Todas las columnas de una clave primaria no deben aceptar nulos.
42X77=La posici\u00f3n de la columna ''{0}'' est\u00e1 fuera del rango de la expresi\u00f3n de consulta.
42X78=La columna ''{0}'' no est\u00e1 en el resultado de la expresi\u00f3n de consulta.
42X79=El nombre de columna ''{0}'' aparece m\u00e1s de una vez en el resultad de la expresi\u00f3n de consulta.
42877=No se permite un nombre de columna calificado ''{0}'' en la cl\u00e1usula ORDER BY.
42X80=La cl\u00e1usula VALUES debe contener al menos 1 elemento y todos los elementos no deben estar vac\u00edos.
42X82=La cl\u00e1usula USING ha devuelto m\u00e1s de una fila y s\u00f3lo est\u00e1n permitidos ResultSets de una sola fila.
42X83=Las restricciones sobre la columna ''{0}'' requieren que acepte nulos y que no los acepte.
42X84=Se ha creado el \u00edndice ''{0}'' para imponer la restricci\u00f3n ''{1}''.  S\u00f3lo puede eliminarse eliminando la restricci\u00f3n.
42X85=Es necesario que la restricci\u00f3n ''{0}'' est\u00e9 en el mismo esquema que la tabla '{1}''.
42X86=No se ha podido realizar ALTER en la tabla. No hay restricci\u00f3n ''{0}'' sobre la tabla ''{1}''.
42X87=Al menos una expresi\u00f3n de resultado (then o else) de la expresi\u00f3n ''{0}'' no debe ser un ''?''.
42X88=Un Conditional tiene un operando no booleano. El operando de Conditional debe dar como resultado TRUE, FALSE o UNKNOWN.
42X89=Los tipos ''{0}'' y ''{1}'' no son tipos compatibles. (Ninguno de los tipos es asignable al otro).
42X90=Se ha especificado m\u00e1s de 1 restricci\u00f3n de clave primaria para la tabla ''{0}''.
42X91=El nombre de restricci\u00f3n ''{0}'' aparece m\u00e1s de una vez en la sentencia de creaci\u00f3n de la tabla.
42X92=El nombre de columna ''{0}'' aparece m\u00e1s de una vez en una lista de columnas de restricci\u00f3n.
42X93=La tabla ''{0}'' contiene una definici\u00f3n de restricci\u00f3n con la columna ''{1}'' que no est\u00e1 en la tabla.
42Z93=Las restricciones ''{0}'' y ''{1}'' tiene el mismo conjunto de columnas y no est\u00e1 permitido.
42Z96=No se da soporte a la lectura-grabaci\u00f3n de VTI en los entornos JDK 1.1/JDBC 1.2: ''{0}''
42Z9B=La interfaz de tabla virtual externa no da soporte a columnas blob o clob. ''{0}'' columna ''{1}''.
42Z9D=''{0}'' sentencias no se permiten en ''{1}'' desencadenantes.
42Z9E=La restricci\u00f3n ''{0}'' no es una restricci\u00f3n {1}.
42X94={0} ''{1}'' no existe.
42X96=La classpath de la base de datos contiene un archivo jar desconocido ''{0}''.
42X98=No est\u00e1n permitidos par\u00e1metros en una definici\u00f3n VIEW.
42Y00=La clase ''{0}'' no implementa org.apache.derby.iapi.db.AggregateDefinition y por tanto no puede utilizarse como una expresi\u00f3n de agregado.
42Y01=La restricci\u00f3n ''{0}'' no es v\u00e1lida.
42Y03=''{0}'' no se reconoce como una funci\u00f3n o procedimiento.

# EXTERNAL NAME is SQL keyword - do not translate
42Y04=No se puede crear un procedimiento o funci\u00f3n con EXTERNAL NAME ''{0}'' porque no es una lista separada por puntos. El formato esperado es <v\u00eda de acceso java completa>.<nombre de m\u00e9todo> .

42Y05=No existe una clave for\u00e1nea llamada ''{0}''.
42Y07=El esquema ''{0}'' no existe
42Y08=Las restricciones de clave for\u00e1nea no est\u00e1n permitidas en tablas del sistema.
42Y09=Los m\u00e9todos void s\u00f3lo est\u00e1n permitidos dentro de una sentencia CALL.
42Y10=Un constructor de tabla que no est\u00e1 en una sentencia INSERT tiene todos los par\u00e1metros ? en una de sus columnas. En cada columna, al menos una de las filas debe tener un no-par\u00e1metro.
42Y11=Se necesita una especificaci\u00f3n de uni\u00f3n con la cl\u00e1usula ''{0}''.
42Y12=La cl\u00e1usula ON de JOIN es una expresi\u00f3n ''{0}''. Debe ser una expresi\u00f3n BOOLEAN.
42Y13=El nombre de columna ''{0}'' aparece m\u00e1s de una vez en la sentencia de creaci\u00f3n de la vista.
42Z97=Renombrar la columna ''{0}'' romper\u00e1 la restricci\u00f3n de comprobaci\u00f3n ''{1}''.
42Z99=El literal String o Hex no puede superar 64K.
42Y16=No se ha encontrado ning\u00fan m\u00e9todo est\u00e1tico p\u00fablico ''{0}'' en la clase ''{1}''. Es posible que el m\u00e9todo exista pero que no sea p\u00fablico o est\u00e1tico.
42846=No se pueden convertir los tipos ''{0}'' en ''{1}''.
42Y19=''{0}'' aparece varias veces en la lista GROUP BY. Las columnas de la lista GROUP BY no deben ser ambiguas.
42Y22=El agregado {0} no puede operar sobre el tipo {1}.
42Y23=Se ha devuelto una informaci\u00f3n de tipo JDBC incorrecta para la columna {0}.
42Y24=La vista ''{0}'' no es actualizable.(Actualmente las vistas no son actualizables).
42Y25=''{0}'' es una tabla del sistema. Los usuarios no tienen permitido modificar el contenido de esta tabla.
#42Y26=Parameters are not allowed in the WHEN clause of a trigger.
42Y27=No est\u00e1n permitidos par\u00e1metros en la acci\u00f3n del desencadenante.
42Y29=La lista SELECT de una consulta no agrupada contiene al menos 1 expresi\u00f3n no v\u00e1lida. Cuando la lista SELECT contiene al menos 1 agregado entonces todas las entradas deben ser expresiones de agregado v\u00e1lidas.
42Y30=La lista SELECT de una consulta agrupada contiene al menos 1 expresi\u00f3n no v\u00e1lida. Para SELECT con GROUP BY, la lista SELECT s\u00f3lo puede contener columnas de agrupaci\u00f3n y expresiones de agregado v\u00e1lidas.
42Y32=La clase Aggregator ''{0}'' del agregado ''{1}'' sobre el tipo {2} no implementa com.ibm.db2j.aggregates.Aggregator. 
42Y33=El agregado {0} contiene uno o m\u00e1s agregados.
42Y34=El nombre de columna ''{0}'' coincide con m\u00e1s de una columna de resultado de la tabla ''{1}''.
42Y35=La referencia de columna ''{0}'' no es v\u00e1lida. Cuando la lista SELECT contiene al menos 1 agregado entonces todas las entradas deben ser expresiones de agregado v\u00e1lidas.
42Y36=La referencia de columna ''{0}'' no es v\u00e1lida. Para SELECT con GROUP BY, la lista SELECT s\u00f3lo puede contener columnas de agrupaci\u00f3n y expresiones de agregado v\u00e1lidas.
42Y37=''{0}'' es un primitivo Java y no puede utilizarse con este operador.
42Y38=insertMode = replace no est\u00e1 permitido en una inserci\u00f3n donde se hace referencia a la tabla destino, ''{0}'', en SELECT.
# NOTE: The parameter to this message is a keyword used as a noun phrase.
# Some possible values are "subquery", "CurrentDate", and "?".
42Y39=''{0}'' puede no aparecer en una definici\u00f3n CHECK CONSTRAINT porque puede devolver resultados no determinantes.
42Y40=''{0}'' aparece varias veces en la lista de columnas UPDATE OF para el desencadenante ''{1}''.
42Y41=''{0}'' no puede invocarse directamente mediante EXECUTE STATEMENT porque es parte de un desencadenante.
42Y42=La escala ''{1}'' no es una escala v\u00e1lida para {0}.
42Y43=La escala ''{0}'' no es una escala v\u00e1lida con precisi\u00f3n de ''{1}''.
42Y44=Clave no v\u00e1lida, ''{0}'', especificada en lista Properties en lista FROM. Las claves sensibles a may\u00fasculas y min\u00fasculas soportadas actualmente son ''{1}''.
42Y45=No se puede encontrar la VTI ''{0}'' porque es una VTI de desencadenante especial y esta sentencia no forma parte de una acci\u00f3n de desencadenante o cl\u00e1usula WHEN.
42Y46=Lista Properties no v\u00e1lida en lista FROM.  No hay \u00edndice ''{0}'' sobre la tabla ''{1}''.
42Y48=Lista Properties no v\u00e1lida en lista FROM.  No hay restricci\u00f3n con nombre ''{0}'' sobre la tabla ''{1}'' o la restricci\u00f3n no tiene un \u00edndice de respaldo.
42Y49=Se han especificado varios valores para la clave de propiedad ''{0}''. 
42Y50=La lista Properties de la tabla ''{0}'' puede contener valores de \u00edndice o de restricci\u00f3n pero no ambos.
42Y55=No se puede realizar ''{0}'' sobre ''{1}'' porque no existe.
42Y56=joinStrategy no v\u00e1lida, ''{0}'', especificada en lista Properties de la tabla ''{1}''. Los valores soportados actualmente para joinStrategy son ''hash'', ''nestedloop''.
42Y58=Se ha producido NumberFormatException al convertir el valor ''{0}'' para el modificador del optimizador ''{1}''.
42Y59=Valor no v\u00e1lido, ''{0}'', especificado para el modificador de hashInitialCapacity. El valor debe ser > 0.
42Y60=Valor no v\u00e1lido, ''{0}'', especificado para el modificador de hashLoadFactor. El valor debe ser > 0,0 y <= 1,0.
42Y61=Valor no v\u00e1lido, ''{0}'', especificado para el modificador de hashMaxCapacity. El valor debe ser > 0.
42Y62=''{0}'' no est\u00e1 permitido sobre ''{1}'' porque es una vista.
42Y63=La uni\u00f3n hash requiere un predicado equijoin optimizable sobre una columna del \u00edndice o heap seleccionado.  No existe un predicado equijoin optimizable sobre ninguna columna de la tabla o \u00edndice ''{0}''. Utilice el modificador del optimizador ''index'' para especificar dicho \u00edndice o heap sobre la tabla ''{1}''.
42Y64=El valor de bulkFetch de ''{0}'' no es v\u00e1lido: el valor m\u00ednimo de bulkFetch es 1.
42Y65=bulkFetch no se permite en uniones ''{0}''.
42Y66=bulkFetch no se permite en cursores actualizables.
42Y67=El esquema ''{0}'' no se puede eliminar.
42Y69=No se ha encontrado un plan de ejecuci\u00f3n v\u00e1lido para esta sentencia. Puede deberse a una de estas dos causas: ha especificado una estrategia de uni\u00f3n hash cuando la uni\u00f3n hash no est\u00e1 permitida (equijoin no optimizable) o est\u00e1 intentando unir dos ExternalVirtualTables, que se referencian entre ellas, y por tanto no se puede evaluar la sentencia.
42Y70=El orden de uni\u00f3n especificado por el usuario no es un orden de uni\u00f3n permitido. Puede ocurrir porque se est\u00e1 pasando como par\u00e1metro una columna de uni\u00f3n desde una tabla interior a una tabla virtual externa.
42Y71=La funci\u00f3n del sistema o procedimiento ''{0}'' no se puede eliminar.
42Y82=La sentencia preparada almacenada generada por el sistema ''{0}'' no se puede eliminar mediante DROP STATEMENT.  Es parte de un desencadenante.
42Y83=No se permite un nulo sin tipo como argumento del agregado {0}.  Convierta el nulo a un tipo adecuado.
# NOTE: The parameter to this message is a keyword used as a noun phrase.
# Some possible values are "subquery", "CurrentDate", and "?".
42Y84=''{0}'' no puede aparecer en una definici\u00f3n DEFAULT.
42Y85=La palabra clave DEFAULT s\u00f3lo est\u00e1 permitida en una cl\u00e1usula VALUES cuando la cl\u00e1usula VALUES aparece dentro de una sentencia INSERT.
42Y90=No se permite FOR UPDATE en este tipo de sentencia.
42Y91=La cl\u00e1usula USING no se permite en EXECUTE STATEMENT de una acci\u00f3n de desencadenante.
42Y92=Los desencadenantes {0} s\u00f3lo pueden hacer referencia a variables/tablas de transici\u00f3n {1}.
42Y93=Cl\u00e1usula REFERENCING no permitida: s\u00f3lo se permite un nombre para cada tipo de variable/tabla de transici\u00f3n.
42Y94=Un AND u OR tienen un operando no booleano. Los operandos de AND y OR deben dar como resultado TRUE, FALSE o UNKNOWN.
42Y95=El operador ''{0}'' con un tipo de operando izquierdo de ''{1}'' y un tipo de operando derecho de ''{2}'' no est\u00e1 soportado.
42Y96.U=DESCONOCIDO
42Y97=Car\u00e1cter de escape no v\u00e1lido en la l\u00ednea ''{0}'', columna ''{1}''.
42Y98.U=Se ha encontrado "{0}" en la l\u00ednea {1}, columna {2}
42Y99.U=Error l\u00e9xico en la l\u00ednea {0}, columna {1}.  Encontrado: {2}
42Z00.U=Llamada de m\u00e9todo Java o referencia de campo
# This message is put into message 42X75 when a parameter doesn't have a
# datatype. For example, from the parameterWidening test:
#
# values (java.lang.Integer::toString(?, null));
# ERROR 42X50: No method was found with the signature
# java.lang.Integer.toString(UNTYPED, UNTYPED).  It may be that the method
# exists, but it is not public and/or static, or that the parameter types
# are not method invocation convertible.
42Z01.U=SIN TIPO
42Z02=En este momento no se soportan agregados DISTINCT m\u00faltiples.
42Z07=No se permiten agregados en la cl\u00e1usula ON.
42Z08=La sustituci\u00f3n mediante inserci\u00f3n general no est\u00e1 permitida en ''{0}'' porque tiene un desencadenante habilitado ({1}).
42Z09.U=COLUMN DEFAULT para
#
# The following message is used in error messages where we want to say that
# certain operations on streams are illegal. The word "stream" is not a
# keyword or method name, so it should be translated.
42Z11.U=corriente

# alter table modify column error messages.
#####
42Z15=Se ha especificado un tipo no v\u00e1lido para la columna ''{0}''. No se puede cambiar el tipo de una columna.
42Z16=S\u00f3lo puede alterarse la longitud de las columnas VARCHAR. 
42Z17=Se ha especificado una longitud no v\u00e1lida para la columna ''{0}''. La longitud debe ser mayor que la longitud de columna actual.
42Z18=La columna ''{0}'' forma parte de una restricci\u00f3n de clave for\u00e1nea ''{1}''. Para alterar la longitud de esta columna, primero debe eliminar la restricci\u00f3n, realizar ALTER TABLE y despu\u00e9s volver a crear la restricci\u00f3n.
42Z19=La columna ''{0}'' est\u00e1 siendo referenciada por al menos una restricci\u00f3n de clave for\u00e1nea ''{1}''. Para alterar la longitud de esta columna, debe eliminar las restricciones de referencia, realizar ALTER TABLE y despu\u00e9s volver a crear las restricciones.
42Z20=La columna ''{0}'' no puede aceptar nulos. Forma parte de una clave primaria, que no puede tener columnas con valores nulos.

#####
# end of alter table modify constraints.
# identity error message (from 42Z21-42Z29)
#####
42837=ALTER TABLE ''{0}'' especific\u00f3 atributos para la columna ''{1}'' que no son compatibles con la columna existente.
42Z21=Se ha especificado un incremento no v\u00e1lido para la identidad de la columna ''{0}''. El incremento no debe ser cero.
42Z22=Se ha especificado un tipo no v\u00e1lido para la columna de identidad ''{0}''. Los \u00fanicos tipos v\u00e1lidos para columnas de identidad son BIGINT, INT y SMALLINT.
42Z23=Se ha intentado modificar una columna de identidad ''{0}''. 
42Z24=Se ha producido un desbordamiento en el valor de identidad de la columna ''{1}'' de la tabla ''{0}''.
42Z25=ERROR INTERNO del contador de identidad: se ha solicitado actualizar sin argumentos con el valor actual = NULL.
42Z26=Una columna, ''{0}'', con un valor por omisi\u00f3n de identidad no puede aceptar nulos.
42Z27=Una columna que acepta nulos, ''{0}'', no puede modificarse para que tenga un valor por omisi\u00f3n de identidad.

#####
# end of identity error messages.

42Z30.U=tiempo transcurrido en este ResultSet =
42Z31.U=tiempo transcurrido en este ResultSet y posteriormente =
42Z32.U=tiempo total de ruptura: 
42Z33.U=tiempo del constructor (milisegundos) =
42Z34.U=tiempo de apertura (milisegundos) =
42Z35.U=tiempo de siguiente (milisegundos) =
42Z36.U=tiempo de cierre (milisegundos) =
42Z37.U=Ninguno
42Z38.U=Informaci\u00f3n de posicionamiento no disponible porque este ResultSet nunca se ha abierto.
42Z39.U=Excepci\u00f3n inesperada {0} obteniendo posicionador.
## NOTE: In the following message, {0} will be either >= or >
42Z40.U={0} en primera(s) {1} columna(s).
42Z41.U=Sem\u00e1ntica de nulos ordenados en las siguientes columnas: 
42Z42.U=ID de columna
42Z43.U=Operador
42Z44.U=Nulos ordenados
42Z45.U=Valor devuelto desconocido
42Z46.U=Invalidar resultado de comparaci\u00f3n
42Z47.U=Obtener un plan de consulta como String no est\u00e1 soportado actualmente para {0}
## NOTE: In the following message, {0} and {1} are integer indexes into a 2-d array
42Z48.U=ID de columna[{0}][{1}]

# matches DB2
42939=No se puede crear un objeto con el nombre de esquema ''{0}''.




42Z50=ERROR INTERNO: imposible generar c\u00f3digo para {0}.
42Z53=ERROR INTERNO: se desconoce el tipo de activaci\u00f3n a generar para la elecci\u00f3n del nodo {0}.
42Z54.U=Esta excepci\u00f3n detiene la sentencia despu\u00e9s de analizar; no se necesitan m\u00e1s procesos.
42Z55.U=Ejecuci\u00f3n detenida despu\u00e9s de analizar mediante el distintivo de depuraci\u00f3n StopAfterParsing.
42Z56.U=Ejecuci\u00f3n detenida despu\u00e9s de enlazar mediante el distintivo de depuraci\u00f3n StopAfterBinding.
42Z57.U=Ejecuci\u00f3n detenida despu\u00e9s de optimizar mediante el distintivo de depuraci\u00f3n StopAfterOptimizing.
42Z58.U=Ejecuci\u00f3n detenida despu\u00e9s de generar mediante el distintivo de depuraci\u00f3n StopAfterGenerating.

## More RUNTIMESTATISTICS messages
42Z80.U=serializable
42Z81.U=lectura comprometida
42Z82.U=exclusivo
42Z83.U=compartici\u00f3n instant\u00e1nea
42Z84.U=compartir
42Z85.U=tabla
42Z86.U=fila
42Z87.U=compartir tabla
42Z88.U=compartir fila

# More generic language stuff
42Z90=La clase ''{0}'' no devuelve un ResultSet actualizable.
42Z91=subconsulta
42Z92=lectura repetible
42Z9A=lectura no comprometida

# Declare global temporary table language stuff. Does not match DB2, specific to Derby behavior
XCL478.S=La funci\u00f3n solicitada no puede hacer referencia a tablas en el esquema SESSION.
# Declare global temporary table language stuff. Matches DB2
428EK=El calificador para un nombre de tabla temporal global declarada debe ser SESSION.
42995=La funci\u00f3n solicitada no se aplica a tablas temporales globales.
42962=En las definiciones de procedimientos o tablas temporales globales declaradas no se permite el par\u00e1metro ''{0}'' o columnas del tipo long. 

## org.apache.derby.impl.sql.execute.rts
43X00.U=Conectado a
43X01.U=Inicio de subconsulta n\u00famero
# NOTE: In this case, the name of the type of ResultSet is "Any". ResultSet
# is the name of an interface, so it should not be translated.
43X02.U=Cualquier ResultSet
43X03.U=N\u00famero de aperturas
43X04.U=Filas vistas
43X05.U=Juego de resultados origen
43X06.U=Fin de subconsulta n\u00famero
43X07.U=n\u00famero de filas estimado por el optimizador
43X08.U=coste estimado por el optimizador
43X09.U=segundos
43X10.U=Total
43X11.U=Nodo
43X12.U={0} no se ha implementado actualmente para {1}
# NOTE: In this case, the name of the type of ResultSet is "Any". ResultSet
# is the name of an interface, so it should not be translated.
43X13.U=Suprimir ResultSet mediante
43X14.U=bloqueo de tabla
43X15.U=bloqueo de fila
43X16.U=diferido
43X17.U=Filas suprimidas
43X18.U=\u00cdndices actualizados
43X19.U=Suprimir
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X20.U=ResultSet de agregado escalar distinct
# NOTE: In this message, "input" is being used as a verb
43X21.U=Filas introducidas
43X22.U=Agregado escalar distinct
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X23.U=ResultSet de exploraci\u00f3n distinct para {0} mediante {1} {2}
43X24.U=restricci\u00f3n
43X25.U=\u00edndice
43X26.U=ResultSet de exploraci\u00f3n distinct para {0}
#NOTE: In this message, {0} will be something like "serializable" or "read
# committed", and {1} will be something like "share" or "exclusive".
43X27.U=a nivel de aislamiento {0} mediante bloqueo {1}
43X28.U=informaci\u00f3n de exploraci\u00f3n
43X29.U=Columna distinct es el n\u00famero de columna
43X30.U=Columnas distinct son los n\u00fameros de columna
43X31.U=Tama\u00f1o de tabla hash
43X32.U=Filas filtradas
43X33.U=tiempo de siguiente en milisegundos/fila
43X34.U=posici\u00f3n de inicio
43X35.U=posici\u00f3n de parada
43X36.U=cualificadores de exploraci\u00f3n
#NOTE: The message means the set of qualifiers that filter rows returned
# by the "next" operation, not the set of qualifiers that come next.
43X37.U=cualificadores next
#NOTE: In this message, {0} is a table name and {1} is an index name
43X38.U=sobre {0} mediante {1}
43X39.U=Exploraci\u00f3n distinct
43X40.U=Informaci\u00f3n de ordenaci\u00f3n
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X41.U=ResultSet de agregado agrupado
43X42.U=Tiene agregado distinct
43X43.U=Clasificado
43X44.U=Agregado agrupado
43X45.U=Uni\u00f3n EXISTS hash
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X46.U=ResultSet de uni\u00f3n EXISTS hash
43X47.U=Uni\u00f3n hash
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X48.U=ResultSet de uni\u00f3n hash
43X49.U=Uni\u00f3n externa izquierda hash
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X50.U=ResultSet de uni\u00f3n externa izquierda hash
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {1} is either "constraint" or "index", {0} is a table name, and {2} is a
# constraint or index name.
43X51.U=ResultSet de exploraci\u00f3n hash para {0} mediante {1} {2}
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X52.U=ResultSet de exploraci\u00f3n hash para {0}
43X53.U=Clave hash es el n\u00famero de columna
43X54.U=Claves hash son los n\u00famero de columna
43X55.U=Exploraci\u00f3n hash
43X56.U=Subconsultas conectadas
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X57.U=ResultSet de tabla hash
43X58.U=Tabla hash
43X59.U=todo
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43X60.U=Fila \u00edndice para ResultSet de fila base para {0}
43X61.U=Columnas accedidas desde heap
#NOTE: {0} is a table name
43X62.U=para {0}
43X63.U=Fila \u00edndice para fila base
43X64.U=modalidad de inserci\u00f3n: inserci\u00f3n general
43X65.U=modalidad de inserci\u00f3n: normal (imposible realizar inserci\u00f3n general debido a que la tabla no est\u00e1 vac\u00eda)
43X66.U=modalidad de inserci\u00f3n: normal
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X67.U=Insertar ResultSet mediante
43X68.U=Filas insertadas
43X69.U=Insertar
43X70.U=Unir
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43X71.U=ResultSet de exploraci\u00f3n en \u00edndice de \u00faltima clave para {0} mediante \u00edndice {1}
43X72.U=a nivel de aislamiento {0} mediante bloqueo {1} elegido por el optimizador
43X73.U=Exploraci\u00f3n de tabla
43X74.U=Exploraci\u00f3n de \u00edndice
#NOTE: {0} is a table name or class name
43X75.U=sobre {0}
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X76.U=ResultSet materializado
43X77.U=tiempo de creaci\u00f3n de conglomerado temporal (milisegundos)
43X78.U=tiempo de extracci\u00f3n de conglomerado temporal (milisegundos)
43X79.U=Filas vistas desde la izquierda
43X80.U=Filas vistas desde la derecha
43X81.U=Filas devueltas
43X82.U=Juego de resultados izquierdo
43X83.U=Juego de resultados derecho
43X84.U=Uni\u00f3n EXISTS de bucle anidado
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X85.U=ResultSet de uni\u00f3n EXISTS de bucle anidado
43X86.U=Uni\u00f3n de bucle anidado
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X87.U=ResultSet de uni\u00f3n de bucle anidado
43X88.U=Filas derechas devueltas vac\u00edas
43X89.U=Uni\u00f3n externa izquierda de bucle anidado
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X90.U=ResultSet de uni\u00f3n externa izquierda de bucle anidado
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X91.U=Normalizar ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X92.U=ResultSet una vez
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X93.U=ResultSet de proyecci\u00f3n-restricci\u00f3n
43X94.U=restricci\u00f3n
43X95.U=proyecci\u00f3n
43X96.U=tiempo de restricci\u00f3n (milisegundos)
43X97.U=tiempo de proyecci\u00f3n (milisegundos)
43X98.U=Proyecto restricci\u00f3n
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X99.U=ResultSet de fila
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y00.U=ResultSet de agregado escalar
43Y01.U=Optimizaci\u00f3n de clave de \u00edndice
43Y02.U=Agregado escalar
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y03.U=ResultSet insensible a desplazamiento
43Y04.U=N\u00famero de lecturas de la tabla hash
43Y05.U=N\u00famero de grabaciones en la tabla hash
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y06.U=Ordenar ResultSet
43Y07.U=Eliminar duplicados
43Y08.U=Ordenar
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name, {1} is either "constraint" or "index", {2} is a
# constraint or index name.
43Y09.U=ResultSet de exploraci\u00f3n index para {0} mediante {1} {2}
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43Y10.U=ResultSet de exploraci\u00f3n table para {0}
43Y11.U=Bloqueo real utilizado: nivel de bloqueo de tabla.
43Y12.U=Tama\u00f1o de extracci\u00f3n
43Y13.U=cualificadores
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y14.U=ResultSet de uni\u00f3n
43Y15.U=Uni\u00f3n
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is either "table" or "row"
43Y16.U=ResultSet de actualizaci\u00f3n mediante bloqueo {0}
43Y17.U=filas actualizadas
43Y18.U=Actualizar
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a Java class name.
43Y19.U=ResultSet de VTI para {0}
43Y20.U=VTI
43Y21.U=Subconsultas materializadas
43Y22.U=Nombre de sentencia
43Y23.U=Texto de sentencia
# NOTE: This means the amount of time it takes to parse
43Y24.U=Tiempo de an\u00e1lisis
# NOTE: This means the amount of time it takes to bind
43Y25.U=Tiempo de enlace
# NOTE: This means the amount of time it takes to optimize
43Y26.U=Tiempo de optimizaci\u00f3n
# NOTE: This means the amount of time it takes to generate
43Y27.U=Tiempo de generaci\u00f3n
# NOTE: This means the amount of time it takes to compile
43Y28.U=Tiempo de compilaci\u00f3n
# NOTE: This means the amount of time it takes to execute
43Y29.U=Tiempo de ejecuci\u00f3n
43Y30.U=Indicaci\u00f3n de la hora de inicio de compilaci\u00f3n
43Y31.U=Indicaci\u00f3n de la hora de fin de compilaci\u00f3n
43Y32.U=Indicaci\u00f3n de la hora de inicio de ejecuci\u00f3n
43Y33.U=Indicaci\u00f3n de la hora de fin de ejecuci\u00f3n
43Y44.U=Texto del plan de ejecuci\u00f3n de sentencia
43Y45.U=Tiempo de ejecuci\u00f3n 100%, {0} segundos
43Y46.U=Insertar ResultSet de VTI
43Y47.U=Suprimir ResultSet de VTI
43Y49.U=Insertar VTI
43Y50.U=Suprimir VTI
43Y51.U=Suprimr Cascade ResultSet
43Y52.U=Suprimir Cascade ResultSet using
43Y53.U=Acciones de referencia en tablas dependientes
43Y54.U=Iniciar acci\u00f3n de referencia en n\u00famero de tabla dependiente
43Y55.U=Finalizar acci\u00f3n de referencia en n\u00famero de tabla dependiente

54004=La sentencia SELECT tiene demasiados elementos en GROUP BY, ORDER BY o lista de selecci\u00f3n.
54008=La sentencia CREATE INDEX especifica demasiadas columnas (16 es el n\u00famero m\u00e1ximo).
54023=Se ha excedido el l\u00edmite del n\u00famero de par\u00e1metros para un procedimiento. El l\u00edmite es {0} y el n\u00famero de par\u00e1metros del procedimiento {1} es {2}.
54038=Se ha excedido la profundidad m\u00e1xima de desencadenantes anidados.

## all other org.apache.derby.catalog.types
44X00.U=Nombre de tipo SQL
44X05.U=error siguiente

X0X02.S=La tabla ''{0}'' no puede bloquearse en modalidad ''{1}''.
X0X03.S=Estado de transacci\u00f3n no v\u00e1lido - el cursor retenido necesita el mismo nivel de aislamiento
X0X05.S=La tabla ''{0}'' no existe.
X0X0E.S=La posici\u00f3n de columna ''{0}'' que aparece en la matriz de selecci\u00f3n de columnas autogeneradas no se encontr\u00f3 en la tabla de inserci\u00f3n.
X0X0F.S=El nombre de columna ''{0}'' que aparece en la matriz de selecci\u00f3n de columnas autogeneradas no se encontr\u00f3 en la tabla de inserci\u00f3n.
X0X07.S=No se puede eliminar el archivo jar ''{0}'' porque est\u00e1 en db2j.database.classpath ''{0}''.
X0X10.S=La cl\u00e1usula USING ha devuelto m\u00e1s de una fila y s\u00f3lo est\u00e1n permitidos ResultSets de una sola fila.
X0X11.S=La cl\u00e1usula USING no ha devuelto ning\u00fan resultado, no se pueden establecer par\u00e1metros.
X0X13.S=El archivo jar ''{0}'' no existe en el esquema ''{1}''.
X0X57.S=Se ha intentado situar un valor Java de tipo ''{0}'' en un valor SQL, pero no existe el tipo SQL correspondiente.  El valor Java es probablemente el resultado de una llamada de m\u00e9todo o acceso de campo.
X0X60.S=Ya existe un cursor con el nombre ''{0}''.
X0X61.S=Los valores de la columna ''{4}'' del \u00edndice ''{0}'' y tabla ''{1}.{2}'' no coinciden en la ubicaci\u00f3n de la fila {3}.  El valor del \u00edndice es ''{5}'', mientras que el valor de la tabla base es ''{6}''.  La clave de \u00edndice completa, incluida la ubicaci\u00f3n de la fila, es ''{7}''.  La acci\u00f3n correctiva sugerida es volver a crear el \u00edndice.
X0X62.S=Se ha encontrado una inconsistencia entre la tabla ''{0}'' y el \u00edndice ''{1}''.  Error al intentar recuperar la ubicaci\u00f3n de la fila ''{2}'' de la tabla.  La clave de \u00edndice completa, incluida la ubicaci\u00f3n de la fila, es ''{3}''. La acci\u00f3n correctiva sugerida es volver a crear el \u00edndice.
X0X63.S=Se ha obtenido una excepci\u00f3n de E/S ''{0}''.
X0X67.S=Las columnas de tipo ''{0}'' no se pueden utilizar en CREATE INDEX, ORDER BY, GROUP BY, UNION o DISTINCT, porque no se soportan las comparaciones de ese tipo.
X0X81.S={0} ''{1}'' no existe.
X0X85.S=No se ha creado el \u00edndice ''{0}'' porque ''{1}'' no es un tipo de \u00edndice v\u00e1lido.
X0X86.S=0 es un valor de par\u00e1metro no v\u00e1lido para ResultSet.absolute(int row).
X0X87.S=No se puede llamar a ResultSet.relative(int row) si el cursor no est\u00e1 situado sobre una fila.
X0X95.S=No se puede realizar la operaci\u00f3n ''{0}'' sobre el objeto ''{1}'' porque existe un ResultSet abierto que depende de ese objeto.
X0X99.S=El \u00edndice ''{0}'' no existe.
X0Y16.S=''{0}'' no es una vista.  Si es una tabla utilice en su lugar DROP TABLE.
X0Y23.S=No se puede realizar la operaci\u00f3n ''{0}'' sobre el objeto ''{1}'' porque VIEW ''{2}'' depende de ese objeto.
X0Y24.S=No se puede realizar la operaci\u00f3n ''{0}'' sobre el objeto ''{1}'' porque STATEMENT ''{2}'' depende de ese objeto.
X0Y25.S=No se puede realizar la operaci\u00f3n ''{0}'' sobre el objeto ''{1}'' porque {2} ''{3}'' depende de ese objeto.
X0Y26.S=Es necesario que el \u00edndice ''{0}'' est\u00e9 en el mismo esquema que la tabla ''{1}''.
X0Y28.S=No puede crearse el \u00edndice ''{0}'' en la tabla del sistema ''{1}''.  Los usuarios no pueden crear \u00edndices en tablas del sistema.
# column c already exists in table t.
X0Y32.S={0} ''{1}'' ya existe en {2} ''{3}''.
X0Y38.S=No se puede crear el \u00edndice ''{0}'' porque la tabla ''{1}'' no existe.
X0Y41.S=La restricci\u00f3n ''{0}'' no es v\u00e1lida: la tabla referenciada {1} no tiene clave primaria.  A\u00f1ada una clave primaria a {1} o especifique expl\u00edcitamente las columnas de una restricci\u00f3n \u00fanica a las que hace referencia esta clave for\u00e1nea.
X0Y42.S=La restricci\u00f3n ''{0}'' no es v\u00e1lida: los tipos de las columnas de la clave for\u00e1nea no coinciden con los tipos de las columnas referenciadas.
X0Y43.S=La restricci\u00f3n ''{0}'' no es v\u00e1lida: el n\u00famero de columnas de {0} ({1}) no coincide con el n\u00famero de columnas de la clave referenciada ({2}).
X0Y44.S=La restricci\u00f3n ''{0}'' no es v\u00e1lida: no existe una restricci\u00f3n de clave \u00fanica o primaria sobre la tabla ''{1}'' que coincida con el n\u00famero y tipos de las columnas de la clave primaria.
X0Y45.S=La restricci\u00f3n de clave for\u00e1nea ''{0}'' no se puede a\u00f1adir o habilitar sobre la tabla {1} porque 1 o m\u00e1s claves for\u00e1neas no tienen claves referenciadas coincidentes.
X0Y46.S=La restricci\u00f3n ''{0}'' no es v\u00e1lida: la tabla referenciada {1} no existe.
X0Y54.S=El esquema ''{0}'' no se puede eliminar porque no est\u00e1 vac\u00edo.
X0Y55.S=El n\u00famero de filas de la tabla base no coincide con el n\u00famero de filas de al menos 1 de los \u00edndices de la tabla. El \u00edndice ''{0}'' de la tabla ''{1}.{2}'' tiene {3} filas, pero la tabla base tiene {4} filas.  La acci\u00f3n correctiva sugerida es volver a crear el \u00edndice.
X0Y56.S=''{0}'' no se permite en la tabla del sistema ''{1}''.
X0Y57.S=No se puede a\u00f1adir una columna que no acepta nulos a la tabla ''{0}'' porque la tabla contiene al menos 1 fila.  Las columnas que no aceptan nulos s\u00f3lo pueden a\u00f1adirse en tablas vac\u00edas.
X0Y58.S=Se ha intentado a\u00f1adir una restricci\u00f3n de clave primaria en la tabla ''{0}'' y no se ha podido porque la tabla ya tiene una restricci\u00f3n de ese tipo.  Una tabla puede tener una sola restricci\u00f3n de clave primaria.
X0Y59.S=Se ha intentado a\u00f1adir o habilitar la(s) restricci\u00f3n(es) sobre la tabla ''{1}'' y no se ha podido porque la tabla contiene {2} fila(s) que viola(n) la(s) restricci\u00f3n(es) de comprobaci\u00f3n siguiente(s): {0}.
X0Y63.S=Error del mandato sobre la tabla ''{0}''. Se han encontrado datos nulos en la(s) columna(s) de clave primaria o restricci\u00f3n/\u00edndice \u00fanico. Todas las columnas de una clave primaria o de \u00edndice \u00fanico no deben ser nulas.
X0Y66.S=No se puede emitir comprometer en una conexi\u00f3n anidada si existe una operaci\u00f3n pendiente en la conexi\u00f3n padre.
X0Y67.S=No se puede emitir retrotraer en una conexi\u00f3n anidada si existe una operaci\u00f3n pendiente en la conexi\u00f3n padre.
X0Y68.S={0} ''{1}'' ya existe.
X0Y69.S={1} no se permite porque el desencadenante {0} est\u00e1 activo en {2}.
X0Y70.S=No se permite INSERT, UPDATE y DELETE sobre la tabla {1} porque el desencadenante {0} est\u00e1 activo.
X0Y71.S=No se permite la manipulaci\u00f3n de transacciones como SET ISOLATION porque el desencadenante {0} est\u00e1 activo.
X0Y72.S=La sustituci\u00f3n mediante inserci\u00f3n general no est\u00e1 permitida en ''{0}'' porque tiene un desencadenante habilitado ({1}).
X0Y77.S=No se puede emitir establecer el nivel de aislamiento de la transacci\u00f3n sobre una transacci\u00f3n global que est\u00e9 en proceso porque podr\u00eda haber comprometido impl\u00edcitamente la transacci\u00f3n global. 
X0Y78.S=No se puede llamar Statement.executeQuery() con una sentencia que devuelve una cuenta de columnas.
X0Y79.S=No se puede llamar Statement.executeUpdate() con una sentencia que devuelve un ResultSet.
X0Y80.S=Error de ALTER tabla ''{0}''. Se han encontrado datos nulos en la columna ''{1}''.
X0Y83.S=AVISO: al suprimir una fila de la tabla no se ha encontrado la fila de \u00edndice de la fila de la tabla base {0} en el \u00edndice con el id de conglomerado {1}.  Este problema se ha corregido autom\u00e1ticamente como parte de la operaci\u00f3n de supresi\u00f3n.
XCL01.S=El ResultSet no devuelve filas; operaci\u00f3n {0} no permitida.
XCL05.S=Activaci\u00f3n cerrada, operaci\u00f3n {0} no permitida.
XCL07.S=El cursor ''{0}'' est\u00e1 cerrado. Verifique que AutoCommit es OFF.
XCL08.S=El cursor ''{0}'' no est\u00e1 sobre una fila.
XCL09.S=Se ha pasado una activaci\u00f3n al m\u00e9todo ''{0}'' que no coincide con el PreparedStatement.
XCL10.S=Se ha recompilado un PreparedStatement y los par\u00e1metros han cambiado.  Si utiliza JDBC, debe volver a preparar la sentencia.
XCL12.S=Se ha intentado situar un valor de datos de tipo ''{0}'' en un valor de datos de tipo ''{1}''.
XCL13.S=La posici\u00f3n del par\u00e1metro ''{0}'' est\u00e1 fuera de rango.  El n\u00famero de par\u00e1metros de esta sentencia preparada es ''{1}''.
XCL15.S=Se ha producido una ClassCastException al llamar al m\u00e9todo compareTo() sobre un objeto ''{0}''.  El par\u00e1metro para compareTo() es de clase ''{1}''.
XCL16.S=ResultSet no abierto, operaci\u00f3n ''{0}'' no permitida. Verifique que AutoCommit es OFF.
XCL17.S=Sentencia no permitida en esta base de datos.
XCL19.S=Falta una fila en la tabla ''{0}'' de la clave ''{1}''.
XCL20.S=Los cat\u00e1logos del nivel de versi\u00f3n ''{0}'' no pueden actualizarse al nivel de versi\u00f3n ''{1}''.
XCL21.S=Est\u00e1 intentando ejecutar una sentencia de definici\u00f3n de datos (CREATE, DROP o ALTER) mientras prepara una sentencia diferente. No est\u00e1 permitido. Puede suceder si ejecuta una sentencia de definici\u00f3n de datos desde un inicializador est\u00e1tico de una clase Java que se est\u00e1 utilizando desde una sentencia SQL.
XCL22.S=No es posible registrar el par\u00e1metro {0} como un par\u00e1metro OUT puesto que es un par\u00e1metro IN.
XCL23.S=El n\u00famero de tipo SQL ''{0}'' no es un tipo soportado por registerOutParameter().
XCL24.S=El par\u00e1metro {0} parece ser un par\u00e1metro de salida, pero no ha sido designado de esa forma por registerOutParameter().  Si no es un par\u00e1metro de salida, entonces debe establecerse como del tipo {1}.
XCL25.S=El par\u00e1metro {0} no puede registrarse como del tipo {1} porque se correlaciona con el tipo {2} y son incompatibles.
XCL26.S=El par\u00e1metro {0} no es un par\u00e1metro de salida.
XCL27.S=No se puede establecer devolver par\u00e1metros de salida.
XCL30.S=Se ha generado una excepci\u00f3n de E/S al leer ''{0}'' de InputStream.
XCL31.S=Sentencia cerrada.

# Delete Rule Restrictions Violation Messages
XCL33.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de normas de supresi\u00f3n. (La relaci\u00f3n es de autoreferencia y ya existe una relaci\u00f3n de autoreferencia con la norma de supresi\u00f3n SET NULL). 
XCL34.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de normas de supresi\u00f3n. (La relaci\u00f3n forma un ciclo de dos o m\u00e1s tablas que hacen que la tabla est\u00e9 conectada para suprimirse a s\u00ed misma (todas las otras normas de supresi\u00f3n en el ciclo deber\u00edan ser CASCADE)).  
XCL35.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de normas de supresi\u00f3n. (La relaci\u00f3n hace que la tabla sea conectada para sumprimir con la tabla indicada a trav\u00e9s de varias relaciones y la norma de supresi\u00f3n de la relaci\u00f3n existente es  SET NULL.).  

XCL36.S=La norma de supresi\u00f3n de la clave for\u00e1nea debe ser {0}. (La restricci\u00f3n de referencia es de autoreferencia y una restricci\u00f3n de autoreferencia tiene la norma de supresi\u00f3n indicada (NO ACTION, RESTRICT o CASCADE)). 
XCL37.S=La norma de supresi\u00f3n de la clave for\u00e1nea debe ser {0}. (La restricci\u00f3n de referencia es de autoreferencia y la tabla es dependiente en una relaci\u00f3n con una norma de supresi\u00f3n de CASCADE).
XCL38.S=La norma de supresi\u00f3n de la clave for\u00e1nea debe ser {0}. (La relaci\u00f3n har\u00eda que la tabla estuviera conectada para supresi\u00f3n a la misma tabla a trav\u00e9s de distintas relaciones y dichas relaciones deben tener la misma norma de supresi\u00f3n (NO ACTION, RESTRICT o CASCADE)). 

XCL39.S=La norma de supresi\u00f3n de la clave for\u00e1nea no puede ser CASCADE. (Existe una restricci\u00f3n de autoreferencia con una norma de supresi\u00f3n de SET NULL, NO ACTION o RESTRICT). 
XCL40.S=La norma de supresi\u00f3n de la clave for\u00e1nea no puede ser CASCADE. (La relaci\u00f3n formar\u00eda un ciclo que har\u00eda que una tabla pudiera estar conectada para supresi\u00f3n consigo misma. Una de las normas de supresi\u00f3n existentes en el ciclo no es CASCADE, de forma que se puede definir esta relaci\u00f3n si la norma de supresi\u00f3n no es CASCADE). 
XCL41.S=La norma de supresi\u00f3n de la clave for\u00e1nea no puede ser CASCADE. (La relaci\u00f3n har\u00eda que otra tabla estuviera conectada para suprimir con la misma tabla a trav\u00e9s de distintas v\u00edas con disitntas normas de supresi\u00f3n o con normas de supresi\u00f3n iguales a SET NULL). 
XCL42.S="CASCADE"
XCL43.S="SET NULL"
XCL44.S="RESTRICT"
XCL45.S="NO ACTION"
XCL46.S="SET DEFAULT"

XCL47.S=Utilizar ''{0}'' obliga a actualizar la base de datos desde la versi\u00f3n {1} a la versi\u00f3n {2} o posterior.

XCL48.S= No se permite TRUNCATE TABLE en ''{0}'' porque restricciones de clave for\u00e1neas de otras tablas hacen referencia a las restricciones de clave primaria/exclusiva de esta tabla. 
XCL49.S= No se permite TRUNCATE TABLE en ''{0}'' porque tiene habilitado un desencadenante DELETE ({1}).
XCL50.S=No se ha soporte a una actualizaci\u00f3n de base de datos de una versi\u00f3n anterior. La base de datos a la que se accede est\u00e1 al nivel de versi\u00f3n ''{0}'', este software est\u00e1 al nivel de versi\u00f3n ''{1}''.


# Transaction states, matches DB2
25000=Estado de transacci\u00f3n no v\u00e1lido.

# Authorization
25501=Imposible establecer la propiedad de conexi\u00f3n de s\u00f3lo lectura en una transacci\u00f3n activa.
25502=No se permite un cambio de datos SQL en una conexi\u00f3n, usuario o base de datos de s\u00f3lo lectura.
25503=No se permite DDL en una conexi\u00f3n, usuario o base de datos de s\u00f3lo lectura.
25505=Un usuario de s\u00f3lo lectura o un usuario de una base de datos de s\u00f3lo lectura no tiene permitido inhabilitar la modalidad de s\u00f3lo lectura de una conexi\u00f3n.
28501=Propiedad de autorizaci\u00f3n de base de datos no v\u00e1lida ''{0}={1}''.
28502.C=El nombre de usuario ''{0}'' no es v\u00e1lido. 
28503=Los usuarios ''{0}'' no pueden estar a la vez en listas de autorizaci\u00f3n de s\u00f3lo lectura y acceso total.
28504=Usuario(s) repetido(s) ''{1}'' en la lista de acceso ''{0}'';
04501.C=Conexi\u00f3n de base de datos rechazada.


# Dependency Manager
XD003.S=Imposible restaurar dependencia del disco. DependableFinder = ''{0}''. M\u00e1s informaci\u00f3n: ''{1}''.
XD004.S=Imposible almacenar dependencias.


#../java/com/ibm/db2j/impl/Connectivity/JDBC/Local/messages.properties
24000=Estado del cursor no v\u00e1lido - sin fila actual.

07000=Al menos un par\u00e1metro de la sentencia actual no est\u00e1 inicializado.

# 07004 : {0} is an number {1) is fixed text OUT or INOUT
07004=El par\u00e1metro {0} es un par\u00e1metro de procedimiento {1} y por tanto debe registrarse con CallableStatement.registerOutParameter antes de la ejecuci\u00f3n.

07009=Sin par\u00e1metros de entrada.

S0022=Columna ''{0}'' no encontrada.
XJ009.S=Es necesario utilizar CallableStatement con llamadas de procedimientos almacenados o utilizar par\u00e1metros de salida: {0}
XJ010.S=No se puede emitir un SAVEPOINT cuando autoCommit est\u00e1 activado.
XJ011.S=No se puede pasar null como nombre de SAVEPOINT.
XJ012.S=''{0}'' ya se ha cerrado.
XJ013.S=No hay ID para SAVEPOINT con nombre.
XJ014.S=No hay nombre para SAVEPOINT sin nombre.
XJ016.S=El m\u00e9todo ''{0}'' no est\u00e1 permitido en una sentencia preparada.
XJ017.S=No se permite el mandato SAVEPOINT dentro de un c\u00f3digo de desencadenates.
XJ018.S=El nombre de columna no puede ser nulo.
XJ020.S=El tipo de objeto no es convertible a TYPE ''{0}'', valor java.sql.Types no v\u00e1lido o el objeto es nulo.
XJ022.S=Imposible establecer la corriente: ''{0}''.
XJ023.S=La corriente de entrada contiene menos datos que la longitud solicitada.
XJ025.S=La corriente de entrada no puede tener una longitud negativa.
XJ030.S=No se puede establecer AUTOCOMMIT ON si est\u00e1 en una conexi\u00f3n anidada.
XJ042.S=''{0}'' no es un valor v\u00e1lido para la propiedad ''{1}''.
XJ044.S=''{0}'' no es una escala v\u00e1lida.
XJ045.S=Se ha pasador un nivel de aislamiento no v\u00e1lido o no soportado (actualmente), ''{0}'', a Connection.setTransactionIsolationLevel(). Los valores a los que actualmente se da soporte son java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED y java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
XJ04B.S=El proceso por lotes no puede contener un mandatos que intente devolver un juego de resultados.
XJ04C.S=El proceso por lotes CallableStatement no puede contener par\u00e1metros de salida.
XJ056.S=No se puede establecer AUTOCOMMIT ON si est\u00e1 en una conexi\u00f3n XA.
XJ057.S=No se puede comprometer una transacci\u00f3n global mediante la conexi\u00f3n, el proceso de comprometer debe ir a trav\u00e9s de la interfaz XAResource.
XJ058.S=No se puede retrotraer una transacci\u00f3n global mediante la conexi\u00f3n, el proceso de comprometer debe ir a trav\u00e9s de la interfaz XAResource.
XJ059.S=No se puede cerrar una conexi\u00f3n mientras siga activa una transacci\u00f3n global.
XJ05C.S=No se puede establecer la constante de retenci\u00f3n ResultSet.HOLD_CURSORS_OVER_COMMIT para una transacci\u00f3n global.
XJ061.S=El m\u00e9todo ''{0}'' s\u00f3lo est\u00e1 permitido sobre cursores de desplazamiento.
XJ062.S=Valor del par\u00e1metro no v\u00e1lido ''{0}'' para ResultSet.setFetchSize(int rows).
XJ063.S=Valor del par\u00e1metro no v\u00e1lido ''{0}'' para Statement.setMaxRows(int maxRows).  El valor del par\u00e1metro debe ser >= 0.
XJ064.S=Valor del par\u00e1metro no v\u00e1lido ''{0}'' para setFetchDirection(int direction).
XJ065.S=Valor del par\u00e1metro no v\u00e1lido ''{0}'' para Statement.setFetchSize(int rows).
XJ066.S=Valor del par\u00e1metro no v\u00e1lido ''{0}'' para Statement.setMaxFieldSize(int max).
XJ067.S=El puntero de texto SQL es nulo.
XJ068.S=S\u00f3lo est\u00e1n permitidos executeBatch y clearBatch en mitad de un proceso por lotes.
XJ069.S=No se permiten m\u00e9todos SetXXX en el caso de Execute Statement Using.
XJ080.S=Execute Statement Using pas\u00f3 {0} par\u00e1metros en lugar de {1}.
XJ070.S=Se ha pasado un argumento de posici\u00f3n negativo o cero ''{0}'' en un m\u00e9todo Blob o Clob.
XJ071.S=Se ha pasado un argumento de longitud negativo o cero ''{0}'' en un m\u00e9todo Blob o Clob.
XJ072.S=Se ha pasado un patr\u00f3n o searchStr nulo a un m\u00e9todo de posici\u00f3n Blob o Clob.
XJ073.S=Los datos de este Blob o Clob ya no est\u00e1n disponibles. Las razones posibles son que su transacci\u00f3n se ha comprometido o su conexi\u00f3n se ha cerrado.
XJ076.S=El argumento de posici\u00f3n ''{0}'' supera el tama\u00f1o del Blob/Clob.
XJ077.S=Se ha obtenido una excepci\u00f3n al intentar leer el primer byte/car\u00e1cter del patr\u00f3n Blob/Clob mediante getBytes/getSubString.
XJ082.U=No se permiten los valores BLOB/CLOB como receptor o par\u00e1metros de m\u00e9todo.

0A000.S=Caracter\u00edstica no implementada: {0}.

XJ004.C=Base de datos ''{0}'' no encontrada.
08004=Conexi\u00f3n rechazada: {0}
A020=Autenticaci\u00f3n no v\u00e1lida.
08003=Sin conexi\u00f3n actual.
XJ028.C=El URL ''{0}'' no est\u00e1 formado correctamente.
XJ040.C=No se ha podido iniciar la base de datos ''{0}'', consulte la excepci\u00f3n siguiente para obtener detalles.
XJ041.C=No se ha podido crear la base de datos ''{0}'', consulte la excepci\u00f3n siguiente para obtener detalles.
XJ049.C=Se han especificado atributos de creaci\u00f3n que entran en conflicto.
XJ081.C=Se han especificado atributos de creaci\u00f3n/restauraci\u00f3n/recuperaci\u00f3n que entran en conflicto.
XJ05B.C=El atributo JDBC ''{0}'' tiene un valor no v\u00e1lido ''{1}'', los valores v\u00e1lidos son ''{2}''.

XXXXX.C.6=Cierre de sesi\u00f3n de base de datos normal.

08006.D=Conclusi\u00f3n de la base de datos ''{0}''.

XJ015.M=Conclusi\u00f3n del sistema Derby.

01J01=Base de datos ''{0}'' no creada, en su lugar se ha realizado una conexi\u00f3n con una base de datos existente.
01J02=Los cursores sensibles al desplazamiento no est\u00e1n implementandos actualmente.
01J03=Los ResultSets actualizables no est\u00e1n implementados actualmente.
01J04=La clase ''{0}'' de la columna ''{1}'' no implementa java.io.Serializable ni java.sql.SQLData. Las instancias deben implementar una de estas interfaces para permitir poder ser almacenadas.
01J05=Actualizaci\u00f3n de base de datos correcta. La base de datos actualizada est\u00e1 preparada ahora para su uso. No se han podido revalidar las sentencias preparadas almacenadas. Consulte la excepci\u00f3n siguiente para obtener detalles sobre la anomal\u00eda. 
XJ001.U=Excepci\u00f3n Java: ''{1}: {0}''.
XJ050.U=La base de datos necesita actualizarse desde la versi\u00f3n {0}, establezca el atributo ''upgrade=true'' en el URL de conexi\u00f3n JDBC para permitir la actualizaci\u00f3n a la versi\u00f3n {1}.


# org.apache.derby.database.UserUtility
#
XCZ00.S=Permiso desconocido ''{0}''.
XCZ01.S=Usuario desconocido ''{0}''.
XCZ02.S=Par\u00e1metro no v\u00e1lido ''{0}''=''{1}''.

# SQL J Jar support
46001=Excepci\u00f3n al acceder al archivo jar mediante el URL ''{0}''.

###############################################################################
#
# Text for non-exception strings
#
###############################################################################

# Log
L001=------------  PRINCIPIO DE MENSAJE DE ERROR -------------\n
L002=------------  FIN DE MENSAJE DE ERROR -------------\n
L003=\n-------  COMENZANDO PILA DE ERROR DE CONCLUSI\u00d3N ----\n
L004=\n------------  FIN DE PILA DE ERROR DE CONCLUSI\u00d3N ----\n
L005=\n------------  PRINCIPIO DE PILA DE ERRORES -------------\n
L006=\n------------  FIN DE PILA DE ERRORES -------------\n
L007=AVISO: archivo de anotaciones cronol\u00f3gicas no encontrado, creando uno nuevo. Posible inconsistencia en la base de datos
L008=Suprimiendo Logfile antiguo incompatible {0}
L009=Suprimiendo Logfile antiguo {0}
L010=Se ha detectado un registro de anotaci\u00f3n cronol\u00f3gica incompleto en el archivo {0}, borrando el archivo de anotaciones cronol\u00f3gicas desde la posici\u00f3n {1} hasta el fin de archivo en {2}.
L011=El daemon de punto de control ha capturado una excepci\u00f3n est\u00e1ndar
L012=El registro de anotaci\u00f3n cronol\u00f3gica no es el primero pero la transacci\u00f3n no est\u00e1 en una tabla de transacci\u00f3n: {0}
L013=El registro de anotaci\u00f3n cronol\u00f3gica es el primero pero la transacci\u00f3n ya est\u00e1 en la tabla de transacci\u00f3n: {0}
L014=Instante de inicio incorrecto
L015=existe un nuevo archivo de anotaciones cronol\u00f3gicas y no puede suprimirse {0}
L016=no se puede crear un nuevo archivo de anotaciones cronol\u00f3gicas {0}
L017=no se puede crear un nuevo archivo de anotaciones cronol\u00f3gicas {0} debido a {1}
L018=El sistema puede estar en un estado inconsistente, falta el archivo {0}

# Class Manager
C000=Se ha grabado la clase {0} en el archivo {1}. Proporcione a soporte el archivo y la informaci\u00f3n de excepci\u00f3n siguiente: {2}
C001=La clase {0} tiene un tipo de certificado desconocido en el jar {1}, se esperaba un certificado X509.
C002=Se ha generado una excepci\u00f3n de seguridad al acceder a la clase {0} del jar {1} : {2}
C003=Excepci\u00f3n al cargar el jar de base de datos {0} - {1}
C004=Cargador de clases obsoleto para la clase {0}
C005=Cargador de clases de base de datos iniciado - derby.database.classpath=''{0}''
C006=Se ha cargado {0} desde el jar de base de datos {1}
C007=Excepci\u00f3n al cargar la clase {0} desde el jar {1} - {2}

# RawStore Data

D001=:\n Arrancando Derby versi\u00f3n {0}: instancia {1}\nen el directorio de base de datos {2} \n
D002=:\nConcluyendo instancia {0}
D004=Copia de seguridad iniciada de la base de datos situada en {0}
D005=se ha movido la copia de seguridad antigua de {0} a {1}
D006=se ha copiado el directorio de base de datos de {0} a {1}
D007=se ha editado service.properties de la base de datos para utilizar el dispositivo de anotaci\u00f3n cronol\u00f3gica por omisi\u00f3n
D008=error editando service.properties de la base de datos, copia de seguridad terminada anormalmente: {0}
D009=se ha copiado el directorio de anotaci\u00f3n cronol\u00f3gica de {0} a {1}
D010=Copia de seguridad terminada anormalmente debido a un error
D011=se ha eliminado la copia de seguridad antigua de {0}
D012=Copia de seguridad completada, instancia de anotaci\u00f3n cronol\u00f3gica en {0} \n

# Connectivity 
J004=identidad de base de datos
J005=concluir Derby
J007=crear base de datos
J008=sin detalles
J010=cifrar base de datos en disco
J013=actualizar base de datos
J016=suministrador de servicio criptogr\u00e1fico
J017=algoritmo criptogr\u00e1fico
J018=longitud de clave criptogr\u00e1fica
J019=clave criptogr\u00e1fica externa
J020=clave criptogr\u00e1fica secreta
J021=territorio de la base de datos
J022=nombre usuario
J023=contrase\u00f1a de usuario
J025=v\u00eda de acceso del directorio de anotaci\u00f3n cronol\u00f3gica
J028=v\u00eda de acceso de seguridad para la recuperaci\u00f3n en avance
J100=No se puede encontrar la clase del servidor de red, {0}. La v\u00eda de acceso a la clase deber\u00eda tener csnet.jar.
J101=No se puede cargar la clase del servidor de red, {0}. {1} - Compruebe la integridad del archivo csnet.jar.
J102=Se ha generado una excepci\u00f3n al iniciar el servidor de red. {0}
J103=Se ha generado una excepci\u00f3n al cerrar el servidor de red. {0}

# Authentication
A001=MUY GRAVE: no existe servicio de autenticaci\u00f3n para el sistema
A002=MUY GRAVE: no existe servicio de autenticaci\u00f3n para la base de datos
A011=AVISO: no se ha mencionado ning\u00fan nombre de servidor/sistema principal LDAP en la propiedad {0}; se asume localhost:389

I015=org.apache.derby.jdbc.EmbeddedDriver no se ha registrado con el gestor de controladores JDBC
I024=Base de datos no disponible
I025=Controlador JDBC no disponible

# Import/Export
XIE01.S=Conexi\u00f3n nula.
XIE03.S=Se han encontrado datos en la l\u00ednea {0} de la columna {1} despu\u00e9s del delimitador de parada
XIE04.S=Archivo de datos no encontrado: {0}
XIE05.S=El archivo de datos no puede ser nulo.
XIE06.S=Nombre de entidad nulo.
XIE07.S=Los separadores de campo y registro no pueden ser una subserie uno de otro.
XIE08.S=No hay ninguna columna de nombre: {0}
XIE09.S=El n\u00famero total de columnas en la fila es: {0}
XIE0B.S=La columna ''{0}'' de la tabla de tipo {1} no recibe soporte de import/export.
XIE0D.S=No se puede encontrar el separador de registro en la l\u00ednea {0}
XIE0E.S=Se ha le\u00eddo el fin de archivo en un lugar inesperado de la l\u00ednea {0}
XIE0I.S=Se ha obtenido una excepci\u00f3n de E/S al grabar datos en el archivo
XIE0J.S=Un delimitador no es v\u00e1lido o se ha utilizado m\u00e1s de una vez.
XIE0K.S=El punto se ha especificado como un delimitador de serie de caracteres.
XIE0M.S=La tabla ''{0}'' no existe.

# Monitor
M001=\n# ********************************************************************\n# ***                   NO edite este archivo.                 ***\n# ***   SI CAMBIA SU CONTENIDO PODR\u00cdA CAUSAR DA\u00d1OS EN LOS DATOS. ***\n# ********************************************************************




#  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#
#
#  DO NOT TRANSLATE MESSAGES OR TEXT BELOW THIS LINE
#
#
# ----------------------------------------------------------------------------------------------------------


