
###############################################################################
#
# Text for exceptions
#
###############################################################################

# Monitor
XBM01.D=\u4f8b\u5916\u306e\u305f\u3081\u3001\u59cb\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBM02.D={0} \u306e\u6a5f\u80fd\u304c\u306a\u3044\u305f\u3081\u3001\u59cb\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u30af\u30e9\u30b9\u30d1\u30b9\u306b\u6b63\u3057\u3044 Derby \u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBM05.D={0} \u306e\u88fd\u54c1\u30d0\u30fc\u30b8\u30e7\u30f3\u60c5\u5831\u304c\u306a\u3044\u305f\u3081\u3001\u59cb\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
XBM06.D=\u59cb\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u6697\u53f7\u5316\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u3001\u6b63\u3057\u3044\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u306a\u3044\u3068\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002
XBM07.D=\u59cb\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u9577\u3055\u306f 8 \u30d0\u30a4\u30c8\u4ee5\u4e0a\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XBM08.D={0} StorageFactory \u30af\u30e9\u30b9 {1} \u3092\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

XBM0G.D=\u6697\u53f7\u5316\u30a8\u30f3\u30b8\u30f3\u306e\u59cb\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 Java 2 \u3092\u5b9f\u884c\u3057\u3066\u304a\u308a\u3001JCE \u306a\u3069\u306e\u6697\u53f7\u5316\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u3066\u30af\u30e9\u30b9\u30d1\u30b9\u306b\u6307\u5b9a\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBM0H.D=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
XBM0I.D=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u3092\u9664\u53bb\u3067\u304d\u307e\u305b\u3093\u3002
XBM0J.D=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
XBM0K.D=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u540d {0} \u306e\u30b5\u30d6\u30d7\u30ed\u30c8\u30b3\u30eb\u304c\u4e0d\u660e\u3067\u3059\u3002
XBM0L.D=\u6307\u5b9a\u3055\u308c\u305f\u8a8d\u8a3c\u30b9\u30ad\u30fc\u30e0\u30fb\u30af\u30e9\u30b9 {0} \u306f\u3001\u8a8d\u8a3c\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9 {1} \u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
XBM0M.D=\u8a8d\u8a3c\u30b9\u30ad\u30fc\u30e0\u30fb\u30af\u30e9\u30b9 {0} \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u4f5c\u6210\u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
XBM0N.D=java.sql.DriverManager \u3078\u306e JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u306e\u767b\u9332\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBM0P.D=\u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306f\u8aad\u307f\u53d6\u308a\u5c02\u7528\u3067\u3059\u3002\u3053\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XBM0S.D=\u30d5\u30a1\u30a4\u30eb ''{0}'' \u3092 ''{1}'' \u306b\u540d\u524d\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
XBM0T.D=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u540d {0} \u306e\u30b5\u30d6\u30d7\u30ed\u30c8\u30b3\u30eb\u304c\u672a\u78ba\u5b9a\u3067\u3059\u3002
XBM0U.S=ID {0} \u306b\u5bfe\u3057\u3066\u30af\u30e9\u30b9\u304c\u767b\u9332\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XBM0V.S=ID {0} \u306b\u5bfe\u3057\u3066\u767b\u9332\u3055\u308c\u305f\u30af\u30e9\u30b9 {1} \u306e\u30ed\u30fc\u30c9\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f
XBM0W.S=ID {0} \u306b\u5bfe\u3057\u3066\u767b\u9332\u3055\u308c\u305f\u30af\u30e9\u30b9 {1} \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u4f5c\u6210\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f
XBM0X.D=\u63d0\u4f9b\u3055\u308c\u305f\u30c6\u30ea\u30c8\u30ea\u30fc\u8a18\u8ff0 ''{0}'' \u306f\u7121\u52b9\u3067\u3059\u3002\u4e88\u671f\u3055\u308c\u3066\u3044\u308b\u30c6\u30ea\u30c8\u30ea\u30fc\u8a18\u8ff0: ln[_CO[_variant]]\nln= \u5c0f\u6587\u5b57 2 \u6587\u5b57\u304b\u3089\u6210\u308b ISO-639 \u8a00\u8a9e\u30b3\u30fc\u30c9\u3001CO= \u5927\u6587\u5b57 2 \u6587\u5b57\u304b\u3089\u6210\u308b ISO-3166 \u56fd\u5225\u30b3\u30fc\u30c9\u3002java.util.Locale \u3092\u53c2\u7167\u3002
XBM0Y.D=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 \u6307\u5b9a\u3057\u305f\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30d1\u30b9\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBM0Z.D=\u30d5\u30a1\u30a4\u30eb ''{0}'' \u3092 ''{1}'' \u306b\u30b3\u30d4\u30fc\u3067\u304d\u307e\u305b\u3093\u3002 \u5341\u5206\u306a\u30b9\u30da\u30fc\u30b9\u304c\u3042\u308a\u3001\u8a31\u53ef\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
XBM0Q.D=\u30d5\u30a1\u30a4\u30eb {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 \u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30b3\u30d4\u30fc\u304c\u6b63\u3057\u3044\u3082\u306e\u3067\u3042\u308a\u3001\u305d\u308c\u304c\u7834\u58ca\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBM0R.D=\u30d5\u30a1\u30a4\u30eb {0} \u3092\u9664\u53bb\u3067\u304d\u307e\u305b\u3093\u3002

# Upgrade
XCW00.D=''{0}'' \u304b\u3089 ''{1}'' \u3078\u306e\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

# Feature not supported


# COntext service
08000=\u4e0d\u660e\u306e\u5272\u308a\u8fbc\u307f\u306b\u3088\u308a\u3001\u63a5\u7d9a\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002

#../java/com/ibm/db2j/protocol/BasicServices/LockManager/messages.properties
40001=\u30c7\u30c3\u30c9\u30ed\u30c3\u30af\u304c\u539f\u56e0\u3067\u30ed\u30c3\u30af\u3092\u7372\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30ed\u30c3\u30af\u3068\u5f85\u3061\u306e\u30b5\u30a4\u30af\u30eb:\n {0}\u9078\u629e\u3055\u308c\u305f victim \u306f XID : {1}

40XL1=\u8981\u6c42\u6642\u9593\u5185\u306b\u30ed\u30c3\u30af\u3092\u7372\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
40XL2=\u8981\u6c42\u6642\u9593\u5185\u306b\u30ed\u30c3\u30af\u3092\u7372\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002  lockTable \u30c0\u30f3\u30d7: {0}

# ClassManager
XBCM1.S=\u751f\u6210\u3055\u308c\u305f\u30af\u30e9\u30b9 {0} \u306e\u30ed\u30fc\u30c9\u4e2d\u306b Java \u30ea\u30f3\u30b1\u30fc\u30b8\u30fb\u30a8\u30e9\u30fc\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
XBCM2.S=\u751f\u6210\u3055\u308c\u305f\u30af\u30e9\u30b9 {0} \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
XBCM3.S=\u30e1\u30bd\u30c3\u30c9 {1}() \u306f\u3001\u751f\u6210\u3055\u308c\u305f\u30af\u30e9\u30b9 {0} \u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002

# Properties

XCY00.S=\u7121\u52b9\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024 ''{0}''=''{1}''\u3002
XCY02.S=\u8981\u6c42\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5909\u66f4\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002''{0}''=''{1}''\u3002
XCY03.S=\u5fc5\u8981\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

# Cryptography
XBCX0.S=\u6697\u53f7\u65b9\u5f0f\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304b\u3089\u306e\u4f8b\u5916\u3002\u8a73\u3057\u304f\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBCX1.S=\u8aa4\u3063\u305f\u30e2\u30fc\u30c9\u3067\u6697\u53f7\u3092\u521d\u671f\u5316\u3057\u3066\u3044\u307e\u3059\u3002ENCRYPT \u304b DECRYPT \u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBCX2.S=\u6697\u53f7\u306e\u521d\u671f\u5316\u306b\u4f7f\u3063\u3066\u3044\u308b\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u77ed\u904e\u304e\u307e\u3059\u3002\u5c11\u306a\u304f\u3068\u3082 {0} \u6587\u5b57\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XBCX5.S=\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u3092 NULL \u306b\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XBCX6.S=\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u3001\u975e\u30b9\u30c8\u30ea\u30f3\u30b0\u306e\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u53ef\u80fd\u306a\u30bf\u30a4\u30d7\u306b\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XBCX7.S=\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u5909\u66f4\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u304c\u8aa4\u308a\u3067\u3059\u3002  \u6b63\u3057\u3044\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306f\u6b21\u306e\u901a\u308a\u3067\u3059: old_boot_password, new_boot_password\u3002
XBCX8.S=\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
XBCX9.S=\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
XBCXA.S=\u30d6\u30fc\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u8aa4\u308a\u3067\u3059\u3002
XBCXB.S=\u8aa4\u3063\u305f\u6697\u53f7\u5316\u57cb\u3081\u8fbc\u307f ''{0}'' \u304c\u6307\u5b9a\u3055\u308c\u305f\u304b\u3001\u57cb\u3081\u8fbc\u307f\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 ''NoPadding'' \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBCXC.S=\u6697\u53f7\u5316\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 ''{0}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002 \u9078\u629e\u3057\u305f\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc ''{1}'' \u304c\u3053\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u308b\u304b\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBCXD.S=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u4f5c\u6210\u5f8c\u306b\u6697\u53f7\u5316\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XBCXE.S=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u4f5c\u6210\u5f8c\u306b\u6697\u53f7\u5316\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XBCXF.S=\u6697\u53f7\u5316\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u3092\u793a\u3059\u30af\u30e9\u30b9 ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
XBCXG.S=\u6697\u53f7\u5316\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc ''{0}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
XBCXH.S=encryptionAlgorithm ''{0}'' \u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u304c\u8aa4\u308a\u3067\u3059\u3002 \u6b63\u3057\u3044\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306f\u3001algorithm/feedbackMode/NoPadding \u3067\u3059\u3002
XBCXI.S=\u30d5\u30a3\u30fc\u30c9\u30d0\u30c3\u30af\u30fb\u30e2\u30fc\u30c9 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30d5\u30a3\u30fc\u30c9\u30d0\u30c3\u30af\u30fb\u30e2\u30fc\u30c9\u306f CBC\u3001CFB\u3001OFB\u3001\u304a\u3088\u3073 ECB \u3067\u3059\u3002
XBCXJ.S=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u30011.2.1 \u3088\u308a\u524d\u306e Java Cryptography Extension (JCE) \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u3002  JCE 1.2.1 \u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u305f\u4e0a\u3067\u3001\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBCXK.S=\u4e0e\u3048\u3089\u308c\u305f\u6697\u53f7\u9375\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u4f5c\u6210\u6642\u306b\u4f7f\u7528\u3055\u308c\u305f\u6697\u53f7\u9375\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u6b63\u3057\u3044\u6697\u53f7\u9375\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u3001\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XBCXL.S=\u6697\u53f7\u9375\u306e\u691c\u67fb\u30d7\u30ed\u30bb\u30b9\u306f\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u539f\u56e0\u3068\u3057\u3066\u306f\u3001\u691c\u67fb\u30d7\u30ed\u30bb\u30b9\u3092\u884c\u3046\u305f\u3081\u306e\u7279\u5b9a\u306e\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30a2\u30af\u30bb\u30b9\u4e2d\u306e\u30a8\u30e9\u30fc\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002

#../java/com/ibm/db2j/impl/BasicServices/CacheService/Generic/messages.properties

# CacheStatementException messages
# sqlstate range: XBCA0 to XBCAZ

XBCA0.S=\u30ad\u30fc {1} \u3092\u4f7f\u3063\u3066 {0} \u30ad\u30e3\u30c3\u30b7\u30e5\u5185\u306b\u65b0\u898f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u3053\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u3059\u3067\u306b\u3053\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u5b58\u5728\u3057\u307e\u3059\u3002


# java/com/ibm/db2j/protocol/Database/Storage/Access/Interface.
# sqlstate range: XSAI0 to XSAIZ
XSAI2.S=\u8981\u6c42\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304a\u3088\u3073\u95a2\u9023\u30d7\u30ed\u30b8\u30a7\u30af\u30c8 ({0}) \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
XSAI3.S=\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u306f\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

# java/com/ibm/db2j/protocol/Database/Storage/Access/Interface
# RunTimeStatistics properties messages.
# sqlstate range: XSAJ0 to XSAJZ
XSAJ0.U=\u30b9\u30ad\u30e3\u30f3\u30fb\u30bf\u30a4\u30d7
XSAJ1.U=\u8a2a\u554f\u3057\u305f\u30da\u30fc\u30b8\u6570
XSAJ2.U=\u8a2a\u554f\u3057\u305f\u884c\u6570
XSAJ3.U=\u8a2a\u554f\u3057\u305f\u524a\u9664\u6e08\u307f\u884c\u6570
XSAJ4.U=\u4fee\u98fe\u3055\u308c\u305f\u884c\u6570
XSAJ5.U=\u30d5\u30a7\u30c3\u30c1\u3055\u308c\u305f\u5217\u6570
XSAJ6.U=\u30d5\u30a7\u30c3\u30c1\u3055\u308c\u305f\u30d3\u30c3\u30c8\u5217\u30bb\u30c3\u30c8
XSAJ7.U=\u30c4\u30ea\u30fc\u306e\u9ad8\u3055
XSAJ8.U=\u30bd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7
XSAJA.U=\u5165\u529b\u884c\u6570
XSAJB.U=\u51fa\u529b\u884c\u6570
XSAJC.U=\u30de\u30fc\u30b8\u5b9f\u884c\u6570
XSAJD.U=\u30de\u30fc\u30b8\u5b9f\u884c\u30b5\u30a4\u30ba
XSAJE.U=\u3059\u3079\u3066

#NOTE: The next three messages are the names of types of scans.
XSAJF.U=btree
XSAJG.U=\u30d2\u30fc\u30d7
XSAJH.U=\u30bd\u30fc\u30c8

#NOTE: The next two messages are types of sorts
XSAJI.U=\u5916\u90e8
XSAJJ.U=\u5185\u90e8

# java/com/ibm/db2j/protocol/Database/Storage/Access/XA.
# sqlstate range: XSAX0 to XSAXZ
XSAX0.S=XA \u30d7\u30ed\u30c8\u30b3\u30eb\u9055\u53cd\u3002
XSAX1.S=\u65e2\u5b58\u3059\u308b\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e Xid \u3092\u4f7f\u3063\u3066\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u958b\u59cb\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/AccessManager/Generic
# sqlstate range: XSAM0 to XSAMZ
XSAM0.S=''{0}'' \u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u30d6\u30fc\u30c8\u3057\u3088\u3046\u3068\u3057\u3066\u4f8b\u5916\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002
XSAM2.S=\u30c9\u30ed\u30c3\u30d7\u3059\u308b\u3001conglom id ''{0}'' \u3092\u6301\u3064\u7d22\u5f15\u307e\u305f\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304a\u3088\u3073\u95a2\u9023\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XSAM3.S=conglom id ''{0}'' \u3092\u6301\u3064\u7d22\u5f15\u307e\u305f\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304a\u3088\u3073\u95a2\u9023\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XSAM4.S=''{0}'' \u3068\u3044\u3046\u540d\u524d\u306e\u30bd\u30fc\u30c8\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XSAM5.S=\u30b9\u30ad\u30e3\u30f3\u3092\u30aa\u30fc\u30d7\u30f3\u3057\u3001next() \u3092\u547c\u3073\u51fa\u3057\u3066\u4f4d\u7f6e\u3092\u79fb\u52d5\u3057\u3066\u304b\u3089\u4ed6\u306e\u547c\u3073\u51fa\u3057\u3092\u884c\u3046\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XSAM6.S=\u30b3\u30f3\u30c6\u30ca\u30fc {0} \u5185\u306e\u30da\u30fc\u30b8 {1} \u4e0a\u306e\u30ec\u30b3\u30fc\u30c9 {2} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002


#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/Generic
# sqlstate range: XSCG0 to XSCGZ
XSCG0.S=\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/Heap
# sqlstate range: XSCH0 to XSCHZ

XSCH8.S=\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u306f\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XSCH7.S=\u30b9\u30ad\u30e3\u30f3\u304c\u4f4d\u7f6e\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XSCH6.S=\u30d2\u30fc\u30d7\u30fb\u30b3\u30f3\u30c6\u30ca\u30fc (\u30b3\u30f3\u30c6\u30ca\u30fc ID {0}) \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
XSCH5.S=\u57fa\u672c\u8868\u306b\u304a\u3044\u3066\u3001\u8981\u6c42\u3055\u308c\u305f\u5217\u6570 {0} \u3068\u6700\u5927\u5217\u6570 {1} \u3068\u306e\u9593\u306b\u30df\u30b9\u30de\u30c3\u30c1\u304c\u3042\u308a\u307e\u3057\u305f\u3002
XSCH4.S=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304a\u3088\u3073\u95a2\u9023\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XSCH1.S=\u30b3\u30f3\u30c6\u30ca\u30fc {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
XSCH0.S=\u30b3\u30f3\u30c6\u30ca\u30fc\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Conglomerate/BTree/Generic
# sqlstate range: XSCB0 to XSCBZ
XSCB9.S=\u30c6\u30b9\u30c8\u7528\u306b\u4e88\u7d04\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XSCB8.S=btree \u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304a\u3088\u3073\u95a2\u9023\u30d7\u30ed\u30b8\u30a7\u30af\u30c8 {0} \u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XSCB7.S=btree \u306e\u30b9\u30ad\u30e3\u30f3\u4e2d\u306b\u5185\u90e8\u30a8\u30e9\u30fc\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002current_rh \u306f NULL = {0}\u3002\u4f4d\u7f6e\u30ad\u30fc\u306f NULL = {1}\u3002
XSCB6.S=\u5236\u9650: \u30da\u30fc\u30b8\u4e0a\u306e\u30b9\u30da\u30fc\u30b9\u4e0d\u8db3\u306e\u305f\u3081\u3001btree \u306e 2 \u6b21\u7d22\u5f15\u3092\u66f4\u65b0\u307e\u305f\u306f\u633f\u5165\u3067\u304d\u307e\u305b\u3093\u3002  \u3053\u306e\u5236\u9650\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc derby.storage.pageSize \u304a\u3088\u3073/\u307e\u305f\u306f derby.storage.pageReservedSpace \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XSCB5.S=btree \u633f\u5165\u307e\u305f\u306f\u524a\u9664\u306e\u8ad6\u7406 UNDO \u4e2d\u3001\u30c4\u30ea\u30fc\u3067\u3053\u306e\u884c\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XSCB4.S=\u30b9\u30ad\u30e3\u30f3\u3092\u6700\u521d\u306e\u884c\u306b\u4f4d\u7f6e\u4ed8\u3051\u308b\u524d (\u3064\u307e\u308a\u3001next() \u547c\u3073\u51fa\u3057\u304c\u884c\u308f\u308c\u308b\u524d) \u306b\u3001btree \u30aa\u30fc\u30d7\u30f3\u30fb\u30b9\u30ad\u30e3\u30f3\u4e0a\u306e\u30e1\u30bd\u30c3\u30c9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002  \u30b9\u30ad\u30e3\u30f3\u306e\u73fe\u5728\u306e\u72b6\u614b\u306f ({0}) \u3067\u3059\u3002
XSCB3.S=\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u3002
XSCB2.S=\u5fc5\u8981\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc {0} \u304c\u3001btree \u306e 2 \u6b21\u7d22\u5f15\u306e createConglomerate() \u306b\u4e0e\u3048\u3089\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ea\u30b9\u30c8\u3067\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XSCB1.S=\u30b3\u30f3\u30c6\u30ca\u30fc {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
XSCB0.S=\u30b3\u30f3\u30c6\u30ca\u30fc\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

#../java/com/ibm/db2j/impl/Database/Storage/Access/Raw/Sort/External
# sqlstate range: XSAS0 to XSASZ

XSAS6.S=\u30bd\u30fc\u30c8\u3059\u308b\u305f\u3081\u306e\u30ea\u30bd\u30fc\u30b9\u3092\u7372\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XSAS3.S=\u30bd\u30fc\u30c8\u306b\u633f\u5165\u3055\u308c\u305f\u884c\u306e\u30bf\u30a4\u30d7\u304c\u3001\u30bd\u30fc\u30c8\u306e\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
XSAS1.S=\u30bd\u30fc\u30c8\u306e\u958b\u59cb\u524d\u307e\u305f\u306f\u30bd\u30fc\u30c8\u306e\u7d42\u4e86\u5f8c\u306b\u884c\u3092\u30d5\u30a7\u30c3\u30c1\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
XSAS0.S=\u30bd\u30fc\u30c8\u306e\u30b9\u30ad\u30e3\u30f3\u306b\u4e0d\u9069\u5207\u306a\u30b9\u30ad\u30e3\u30f3\u30fb\u30b3\u30f3\u30c8\u30ed\u30fc\u30e9\u30fc\u30fb\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u30fb\u30e1\u30bd\u30c3\u30c9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002

# java/com/ibm/db2j/protocol/Database/Storage/RawStore/Interface.
# statement errors.
# sqlstate range: XSRS0 to XSRSZ
XSRS0.S=\u3059\u3067\u306b\u30d5\u30ea\u30fc\u30ba\u3057\u305f\u5f8c\u306b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30d5\u30ea\u30fc\u30ba\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XSRS1.S=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092 {0} \u306b\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u308c\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3067\u3059\u3002
XSRS4.S=\u30d5\u30a1\u30a4\u30eb\u3092 (\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u4e2d\u306b) {0} \u304b\u3089 {1} \u306b\u540d\u524d\u5909\u66f4\u3057\u3088\u3046\u3068\u3057\u3066\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
XSRS5.S=\u30d5\u30a1\u30a4\u30eb\u3092 (\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u4e2d\u306b) {0} \u304b\u3089 {1} \u306b\u30b3\u30d4\u30fc\u3057\u3088\u3046\u3068\u3057\u3066\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
XSRS6.S=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
XSRS7.S=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u3067\u4e88\u671f\u3057\u306a\u3044\u4f8b\u5916\u304c\u30ad\u30e3\u30c3\u30c1\u3055\u308c\u307e\u3057\u305f\u3002
XSRS8.S=\u30ed\u30ae\u30f3\u30b0\u7528\u88c5\u7f6e\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u4f5c\u6210\u6642\u306b\u3057\u304b\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u3053\u3067\u3059\u3050\u306b\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XSRS9.S=\u30ec\u30b3\u30fc\u30c9 {0} \u306f\u3001\u3082\u306f\u3084\u5b58\u5728\u3057\u307e\u305b\u3093


# java/com/ibm/db2j/impl/Database/Storage/RawStore/Log/Generic
# statement errors.
# sqlstate range: XSLB0 to XSLBZ
XSLB9.S=\u3053\u308c\u4ee5\u4e0a\u5909\u66f4\u3092\u767a\u884c\u3067\u304d\u307e\u305b\u3093\u3002\u30ed\u30b0\u30fb\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u304c\u505c\u6b62\u3055\u308c\u307e\u3057\u305f\u3002
XSLB8.S={1} \u306e\u9650\u5ea6\u3092\u8d85\u3048\u3066\u3001\u30b9\u30ad\u30e3\u30f3\u3092 {0} \u306b\u30ea\u30bb\u30c3\u30c8\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
XSLB6.S=0 \u307e\u305f\u306f -ve \u306e\u9577\u3055\u306e\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u3092\u30ed\u30b0\u306b\u8a18\u9332\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
XSLB5.S=\u5207\u308a\u6368\u3066\u30dd\u30a4\u30f3\u30c8 {0} \u306b\u8aa4\u3063\u305f truncationLWM \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {1}\u3002 \u6b63\u3057\u3044\u7bc4\u56f2\u306f {2} \u304b\u3089 {3} \u3067\u3059\u3002
XSLB4.S=truncationLWM {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
XSLB2.S=\u30ed\u30b0\u30fb\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 {0} \u304c\u8d85\u904e\u30c7\u30fc\u30bf\u3092\u30ed\u30ae\u30f3\u30b0\u3057\u3066\u3044\u307e\u3059\u3002\u5185\u90e8\u30ed\u30b0\u30fb\u30d0\u30c3\u30d5\u30a1\u30fc\u304c\u6e80\u676f\u3067\u3059\u3002
XSLB1.S=\u30ed\u30b0\u30fb\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 {0} \u306f\u3001\u30ed\u30b0\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u3078\u306e\u66f8\u304d\u51fa\u3057\u4e2d\u306b\u30a8\u30e9\u30fc\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002\u8aa4\u3063\u305f\u30ed\u30b0\u30fb\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u304c\u5b9f\u884c\u3055\u308c\u305f\u304b\u3001\u6975\u7aef\u306b\u5927\u304d\u306a\u30ed\u30b0\u30fb\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u308a\u5185\u90e8\u30d0\u30c3\u30d5\u30a1\u30fc\u304c\u6e80\u676f\u306b\u306a\u3063\u305f\u3053\u3068\u304c\u539f\u56e0\u3068\u8003\u3048\u3089\u308c\u307e\u3059\u3002

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Log/Generic
# database errors.
# sqlstate range: XSLA0 to XSLAZ
XSLAT.D=\u30ed\u30b0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u304c\u5b58\u5728\u3057\u307e\u3059\u3002 \u6307\u5b9a\u3055\u308c\u305f logDevice \u306e\u5834\u6240\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002  
XSLAS.D=\u30ea\u30b9\u30c8\u30a2\u306e\u9593\u3001\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u306e\u4e2d\u306b\u30ed\u30b0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 \u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30b3\u30d4\u30fc\u304c\u6b63\u3057\u3044\u3082\u306e\u3067\u3042\u308a\u3001\u305d\u308c\u304c\u7834\u58ca\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XSLAR.D=\u30ea\u30b9\u30c8\u30a2\u306e\u9593\u306b\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb ''{0}'' \u3092 ''{1}'' \u306b\u30b3\u30d4\u30fc\u3067\u304d\u307e\u305b\u3093\u3002 \u5341\u5206\u306a\u30b9\u30da\u30fc\u30b9\u304c\u3042\u308a\u3001\u8a31\u53ef\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
XSLAQ.D=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u306b\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
XSLAP.D=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ({0}) \u306f\u30d0\u30fc\u30b8\u30e7\u30f3 {1} \u3067\u3059\u3002 \u30d9\u30fc\u30bf\u30fb\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002
XSLAO.D=\u4e88\u671f\u3057\u306a\u3044\u554f\u984c {0} \u304c\u539f\u56e0\u3067\u3001\u30ea\u30ab\u30d0\u30ea\u30fc\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
XSLAN.D={0} \u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306f\u3001\u3053\u306e\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306e\u73fe\u884c\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u975e\u4e92\u63db\u3067\u3059\u3002  \u3053\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u3001\u30d0\u30fc\u30b8\u30e7\u30f3 {1} \u306b\u3088\u3063\u3066\u4f5c\u6210\u307e\u305f\u306f\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3055\u308c\u307e\u3057\u305f\u3002
XSLAM.D=IOException \u306e\u305f\u3081\u3001{1} \u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3092\u691c\u8a3c\u3067\u304d\u307e\u305b\u3093\u3002
XSLAL.D=\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u30fb\u30b5\u30a4\u30ba {2} \u304c\u3001\u6700\u5927\u8a31\u5bb9\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u30fb\u30b5\u30a4\u30ba {3} \u3092\u8d85\u3048\u307e\u3057\u305f\u3002 \u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {0} (\u4f4d\u7f6e {1}) \u3067\u30a8\u30e9\u30fc\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002
XSLAK.D=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u3001\u6700\u5927\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u6570 {0} \u3092\u8d85\u3048\u307e\u3057\u305f\u3002
XSLAJ.D=\u30ed\u30ae\u30f3\u30b0\u30fb\u30b7\u30b9\u30c6\u30e0\u306f\u3001\u4ee5\u524d\u306b\u767a\u751f\u3057\u305f\u554f\u984c\u306e\u305f\u3081\u306b\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3059\u308b\u3068\u30de\u30fc\u30af\u3055\u308c\u3066\u304a\u308a\u3001\u30b7\u30b9\u30c6\u30e0\u304c\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3057\u3066\u518d\u59cb\u52d5\u3055\u308c\u308b\u307e\u3067\u3001\u3053\u308c\u4ee5\u4e0a\u4f55\u3082\u64cd\u4f5c\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XSLAI.D=\u30c1\u30a7\u30c3\u30af\u30dd\u30a4\u30f3\u30c8\u30fb\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u3092\u30ed\u30b0\u306b\u8a18\u9332\u3067\u304d\u307e\u305b\u3093
XSLAH.D=\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u66f4\u65b0\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XSLAF.D=\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u30c0\u30fc\u30c6\u30a3\u30fc\u30fb\u30c7\u30fc\u30bf\u30fb\u30d0\u30c3\u30d5\u30a1\u30fc\u3092\u4f7f\u3063\u3066\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u3002
XSLAE.D={0} \u306e\u5236\u5fa1\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u66f8\u304d\u8fbc\u307f\u307e\u305f\u306f\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002
XSLAD.D=\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {3} \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {2} \u306b\u3042\u308b\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u304c\u7834\u58ca\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u4e88\u671f\u3055\u308c\u3066\u3044\u305f\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u9577\u306f {0} \u3067\u3057\u305f\u304c\u3001\u5b9f\u969b\u306e\u9577\u3055\u306f {1} \u3067\u3057\u305f\u3002
XSLAC.D={0} \u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306f\u3053\u306e\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306e\u73fe\u884c\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u975e\u4e92\u63db\u3067\u3059\u3002\u3053\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u3001\u305d\u308c\u3088\u308a\u65b0\u3057\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u4f5c\u6210\u307e\u305f\u306f\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3055\u308c\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
XSLAB.D=\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002logDevice \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u3001\u4f7f\u7528\u3059\u308b\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u306b\u9069\u5207\u306a\u30d1\u30b9\u533a\u5207\u308a\u8a18\u53f7\u3067\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XSLAA.D=\u3053\u306e\u30b9\u30c8\u30a2\u306f\u3001\u4ee5\u524d\u306b\u767a\u751f\u3057\u305f\u4f8b\u5916\u306b\u3088\u308a\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3068\u30de\u30fc\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XSLA8.D=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3 {0} \u3092\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u3067\u304d\u307e\u305b\u3093\u3002{2} \u3067 {1} \u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u88dc\u6b63\u3092\u8a66\u884c\u3057\u307e\u3059\u3002
XSLA7.D=\u30ed\u30b0\u306b\u3042\u308b\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 {0} \u3092\u518d\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
XSLA6.D=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30ea\u30ab\u30d0\u30ea\u30fc\u3067\u304d\u307e\u305b\u3093\u3002
XSLA5.D=\u4f55\u3089\u304b\u306e\u7406\u7531\u306b\u3088\u308a\u30ed\u30b0\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u3092\u8aad\u307f\u53d6\u3063\u3066\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3 {0} \u3092\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
XSLA4.D=\u30ed\u30b0\u306b\u66f8\u304d\u8fbc\u3081\u307e\u305b\u3093\u3002\u30ed\u30b0\u304c\u6e80\u676f\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002  \u4e0d\u5fc5\u8981\u306a\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u304c\u8aad\u307f\u53d6\u308a\u5c02\u7528\u3067\u3042\u308b\u3001\u30c7\u30a3\u30b9\u30af\u306b\u969c\u5bb3\u304c\u3042\u308b\u3001\u307e\u305f\u306f\u30e1\u30c7\u30a3\u30a2\u306b\u4f55\u3089\u304b\u306e\u554f\u984c\u304c\u3042\u308b\u3068\u3044\u3063\u305f\u3053\u3068\u3082\u539f\u56e0\u3068\u3057\u3066\u8003\u3048\u3089\u308c\u307e\u3059\u3002
XSLA3.D=\u30ed\u30b0\u304c\u7834\u58ca\u3055\u308c\u3066\u304a\u308a\u3001\u30ed\u30b0\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u306b\u7121\u52b9\u306a\u30c7\u30fc\u30bf\u304c\u3042\u308a\u307e\u3059\u3002
XSLA2.D=\u30b7\u30b9\u30c6\u30e0\u306f\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3057\u307e\u3059\u3002\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30a2\u30af\u30bb\u30b9\u4e2d\u306b\u5165\u51fa\u529b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
XSLA1.D=\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u304c\u30b9\u30c8\u30ea\u30fc\u30e0\u306b\u9001\u4fe1\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30b9\u30c8\u30a2 (\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0}) \u306b\u9069\u7528\u3067\u304d\u307e\u305b\u3093\u3002  \u3053\u306e\u3053\u3068\u304c\u539f\u56e0\u3067\u30ea\u30ab\u30d0\u30ea\u30fc\u554f\u984c\u3082\u767a\u751f\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
XSLA0.D=\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u30c7\u30a3\u30b9\u30af {0} \u306b\u30d5\u30e9\u30c3\u30b7\u30e5\u3067\u304d\u307e\u305b\u3093\u3002

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# statement errors.
# sqlstate range: XSTA0 to XSTAZ
# changed XSTA0 and XSTA1 to match DB2 sqlstates - bug 4466
3B501.S=\u30d1\u30b9\u3055\u308c\u305f\u540d\u524d\u306e SAVEPOINT \u306f\u3059\u3067\u306b\u73fe\u884c\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
3B502.S=RELEASE \u307e\u305f\u306f ROLLBACK TO SAVEPOINT \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
3B001.S=SAVEPOINT\u3001{0} \u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u3001\u73fe\u884c\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3067\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u3042\u308a\u307e\u305b\u3093\u3002
3B002.S=\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u306e\u6700\u5927\u6570\u306b\u5230\u9054\u3057\u307e\u3057\u305f\u3002 
XSTA2.S=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u3001\u5225\u306e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u3059\u3067\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u3057\u305f\u3002

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# transaction errors.
# sqlstate range: 40XT0 to 40XTZ
40XT0=RawStore \u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u78ba\u8a8d\u3055\u308c\u307e\u3057\u305f\u3002
40XT1=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u30b3\u30df\u30c3\u30c8\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
40XT2=SAVEPOINT \u306e\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
40XT4=\u307e\u3060\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u30af\u30ed\u30fc\u30ba\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306f\u30a2\u30dc\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
40XT5=\u5185\u90e8\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
40XT6=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u9759\u6b62\u72b6\u614b\u3067\u3059\u3002\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u6d3b\u52d5\u5316\u3067\u304d\u307e\u305b\u3093\u3002  \u9759\u6b62\u72b6\u614b\u304c\u7d42\u308f\u308b\u307e\u3067\u3057\u3070\u3089\u304f\u304a\u5f85\u3061\u304f\u3060\u3055\u3044\u3002
40XT7=\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u5185\u90e8\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

#
#java/com/ibm/db2j/internalUtil
#	Id Parse Errors       			XCXA0-XCXAZ
#  	Db Class Path Parse Errors 	 	XCXB0-XCXBZ
# 	Id List Parse Errors			XCXC0-XCXCZ
#  	IO Errors						XCXD0-XCXDZ
#	LocaleFinder Errors				XCXE0-XCXEZ
XCXA0.S=\u7121\u52b9\u306a ID\u3002
XCXB0.S=\u7121\u52b9\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30af\u30e9\u30b9\u30d1\u30b9: ''{0}''\u3002
XCXC0.S=\u7121\u52b9\u306a ID \u30ea\u30b9\u30c8\u3002
XCXE0.S=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30c6\u30ea\u30c8\u30ea\u30fc\u3092\u4f7f\u7528\u3059\u308b\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u304c\u3001\u305d\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u30c6\u30ea\u30c8\u30ea\u30fc\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u3002

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Transactions/Basic
# system errors.
# sqlstate range: XSTB0 to XSTBZ
XSTB0.M=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u30a2\u30dc\u30fc\u30c8\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
XSTB2.M=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u5909\u66f4\u3092\u30ed\u30b0\u306b\u8a18\u9332\u3067\u304d\u307e\u305b\u3093\u3002\u304a\u305d\u3089\u304f\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u66f8\u304d\u8fbc\u3082\u3046\u3068\u3057\u3066\u3044\u308b\u3068\u8003\u3048\u3089\u308c\u307e\u3059\u3002
XSTB3.M=(\u304a\u305d\u3089\u304f\u4ee5\u524d\u306e\u30a8\u30e9\u30fc\u304c\u539f\u56e0\u3067) \u30ed\u30b0\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c NULL \u306e\u305f\u3081\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u30a2\u30dc\u30fc\u30c8\u3067\u304d\u307e\u305b\u3093\u3002
XSTB5.M=\u30ed\u30b0\u3092\u4f7f\u7528\u3057\u306a\u3044\u3067\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u4f5c\u6210\u4e2d\u306b\u3001\u4e88\u671f\u3057\u306a\u3044\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
XSTB6.M=1 \u3064\u306e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u8868\u304c\u3059\u3067\u306b\u4f7f\u7528\u4e2d\u306e\u5834\u5408\u3001\u305d\u308c\u3092\u5225\u306e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u8868\u306b\u7f6e\u63db\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# transaction errors.
# sqlstate range: 40XD0 to 40XDZ
40XD0=\u30b3\u30f3\u30c6\u30ca\u30fc\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f
40XD1=\u30b3\u30f3\u30c6\u30ca\u30fc\u304c\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30e2\u30fc\u30c9\u3067\u30aa\u30fc\u30d7\u30f3\u3055\u308c\u307e\u3057\u305f
40XD2=\u30b3\u30f3\u30c6\u30ca\u30fc {0} \u3092\u30aa\u30fc\u30d7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u30b3\u30f3\u30c6\u30ca\u30fc\u306f\u30c9\u30ed\u30c3\u30d7\u3055\u308c\u3066\u3044\u308b\u304b\u3001\u5b58\u5728\u3057\u307e\u305b\u3093\u3002


# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# statement errors.
# sqlstate range: XSDA0 to XSDAZ
XSDA1.S=\u30da\u30fc\u30b8\u4e0a\u306e\u7bc4\u56f2\u5916\u306e\u30b9\u30ed\u30c3\u30c8\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f
XSDA2.S=\u524a\u9664\u6e08\u307f\u30ec\u30b3\u30fc\u30c9\u3092\u66f4\u65b0\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f
XSDA3.S=\u5236\u9650: \u30da\u30fc\u30b8\u4e0a\u306e\u30b9\u30da\u30fc\u30b9\u4e0d\u8db3\u306e\u305f\u3081\u3001\u30ec\u30b3\u30fc\u30c9\u3092\u66f4\u65b0\u307e\u305f\u306f\u633f\u5165\u3067\u304d\u307e\u305b\u3093\u3002 \u3053\u306e\u5236\u9650\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc derby.storage.pageSize \u304a\u3088\u3073/\u307e\u305f\u306f derby.storage.pageReservedSpace \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XSDA4.S=\u4e88\u671f\u3057\u306a\u3044\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f
XSDA5.S=\u524a\u9664\u3055\u308c\u3066\u3044\u306a\u3044\u30ec\u30b3\u30fc\u30c9\u306e\u524a\u9664\u3092\u53d6\u308a\u6d88\u305d\u3046\u3068\u3057\u307e\u3057\u305f
XSDA6.S=\u884c\u306e\u5217 {0} \u304c NULL \u3067\u3059\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u6307\u3059\u3088\u3046\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XSDA7.S=\u30af\u30e9\u30b9 {0} \u306e\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u53ef\u80fd\u307e\u305f\u306f SQLData \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30ea\u30b9\u30c8\u30a2\u3067\u3001\u6700\u521d\u306b\u4fdd\u7ba1\u3055\u308c\u305f\u30c7\u30fc\u30bf\u3088\u308a\u3082\u591a\u304f\u306e\u30c7\u30fc\u30bf\u306e\u8aad\u307f\u53d6\u308a\u304c\u8a66\u884c\u3055\u308c\u307e\u3057\u305f
XSDA8.S=\u30af\u30e9\u30b9 {0} \u306e\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u53ef\u80fd\u307e\u305f\u306f SQLData \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30ea\u30b9\u30c8\u30a2\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f
XSDA9.S=\u30af\u30e9\u30b9 {0} \u306e\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u53ef\u80fd\u307e\u305f\u306f SQLData \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30ea\u30b9\u30c8\u30a2\u4e2d\u3001\u30af\u30e9\u30b9\u304c\u691c\u51fa\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f
XSDAA.S=\u4e0d\u6b63\u306a\u30bf\u30a4\u30e0\u30fb\u30b9\u30bf\u30f3\u30d7 {0}\u3002\u30bf\u30a4\u30e0\u30fb\u30b9\u30bf\u30f3\u30d7\u306f\u5225\u306e\u30da\u30fc\u30b8\u306e\u3082\u306e\u304b\u3001\u307e\u305f\u306f\u975e\u4e92\u63db\u306e\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u3082\u306e\u3067\u3059
XSDAB.S=NULL \u306e\u30bf\u30a4\u30e0\u30fb\u30b9\u30bf\u30f3\u30d7\u306f\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093
XSDAC.S=\u884c\u307e\u305f\u306f\u30da\u30fc\u30b8\u306e\u3044\u305a\u308c\u304b\u3092\u30b3\u30f3\u30c6\u30ca\u30fc\u304b\u3089\u5225\u306e\u30b3\u30f3\u30c6\u30ca\u30fc\u306b\u79fb\u52d5\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
XSDAD.S=1 \u3064\u306e\u30da\u30fc\u30b8\u304b\u3089\u5225\u306e\u30da\u30fc\u30b8\u306b\u30bc\u30ed\u884c\u3092\u79fb\u52d5\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
XSDAE.S=\u7279\u6b8a\u30ec\u30b3\u30fc\u30c9\u30fb\u30cf\u30f3\u30c9\u30eb ID \u306e\u30ec\u30b3\u30fc\u30c9\u30fb\u30cf\u30f3\u30c9\u30eb\u3057\u304b\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
XSDAF.S=\u901a\u5e38\u306e\u30ec\u30b3\u30fc\u30c9\u30fb\u30cf\u30f3\u30c9\u30eb\u306e\u3088\u3046\u306b\u3001\u7279\u6b8a\u30ec\u30b3\u30fc\u30c9\u30fb\u30cf\u30f3\u30c9\u30eb\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
XSDAG.S=\u5272\u308a\u632f\u308a\u306e\u30cd\u30b9\u30c8\u3055\u308c\u305f\u6700\u4e0a\u4f4d\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306f\u3001\u30b3\u30f3\u30c6\u30ca\u30fc\u3092\u30aa\u30fc\u30d7\u30f3\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XSDAI.S=\u9664\u53bb\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308b\u30da\u30fc\u30b8 {0} \u306f\u3001\u3059\u3067\u306b\u5272\u308a\u632f\u308a\u89e3\u9664\u306e\u305f\u3081\u306b\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XSDAJ.S=\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u53ef\u80fd\u307e\u305f\u306f SQLData \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
XSDAK.S=\u30ec\u30b3\u30fc\u30c9\u30fb\u30cf\u30f3\u30c9\u30eb {0} \u306b\u5bfe\u3057\u3066\u8aa4\u3063\u305f\u30da\u30fc\u30b8\u304c\u53d6\u5f97\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XSDAL.S=\u30ec\u30b3\u30fc\u30c9\u30fb\u30cf\u30f3\u30c9\u30eb {0} \u306f\u3001\u4e88\u671f\u305b\u305a\u3001\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u30fb\u30da\u30fc\u30b8\u3092\u6307\u3057\u3066\u3044\u307e\u3059\u3002

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/Generic
# database errors.
# sqlstate range: XSDB0 to XSDBZ
XSDB0.D=\u30e1\u30e2\u30ea\u30fc\u5185\u306e\u30da\u30fc\u30b8 {0} \u3067\u4e88\u671f\u3057\u306a\u3044\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f
XSDB1.D=\u30da\u30fc\u30b8 {0} \u306b\u4e0d\u660e\u306e\u30da\u30fc\u30b8\u30fb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u304c\u3042\u308a\u307e\u3059
XSDB2.D=\u30b3\u30f3\u30c6\u30ca\u30fc {0} \u306b\u4e0d\u660e\u306e\u30b3\u30f3\u30c6\u30ca\u30fc\u30fb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u304c\u3042\u308a\u307e\u3059: {1}
XSDB3.D=\u30b3\u30f3\u30c6\u30ca\u30fc\u60c5\u5831\u306f\u3001\u66f8\u304d\u8fbc\u307f\u5f8c\u306b\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002{0} \u3067\u3057\u305f\u304c\u3001\u73fe\u5728\u306f {1} \u3067\u3059\u3002
XSDB4.D=\u30da\u30fc\u30b8 {0} \u306f\u30d0\u30fc\u30b8\u30e7\u30f3 {1} \u3067\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u306b\u306f\u5909\u66f4\u30d0\u30fc\u30b8\u30e7\u30f3 {2} \u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u30da\u30fc\u30b8\u306e\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u304c\u6b20\u843d\u3057\u3066\u3044\u308b\u304b\u3001\u3053\u306e\u30da\u30fc\u30b8\u304c\u6b63\u3057\u304f\u30c7\u30a3\u30b9\u30af\u306b\u66f8\u304d\u8fbc\u307e\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XSDB5.D=\u30ed\u30b0\u306f\u30da\u30fc\u30b8 {0} \u306b\u5909\u66f4\u30ec\u30b3\u30fc\u30c9\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u304c\u3001\u3053\u308c\u306f\u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u7d42\u308f\u308a\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
XSDB6.D=Derby \u306e\u5225\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u3059\u3067\u306b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 {0} \u3092\u30d6\u30fc\u30c8\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
XSDB7.D=\u8b66\u544a: Derby (\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {2}) \u304c\u307e\u3060\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u306e\u306b\u3082\u304b\u304b\u308f\u3089\u305a\u3001Derby ( \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {0}) \u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 {1} \u3092\u30d6\u30fc\u30c8\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002  \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30d6\u30fc\u30c8\u3067\u304d\u308b Derby \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u30011 \u5ea6\u306b 1 \u3064\u3060\u3051\u3067\u3059\u3002 \u3053\u308c\u306b\u3088\u308a\u91cd\u5927\u306a\u3001\u30ea\u30ab\u30d0\u30ea\u30fc\u4e0d\u80fd\u306e\u7834\u58ca\u304c\u767a\u751f\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u3059\u3067\u306b\u7834\u58ca\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
XSDB8.D=\u8b66\u544a: Derby (\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {2}) \u304c\u307e\u3060\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u306e\u306b\u3082\u304b\u304b\u308f\u3089\u305a\u3001Derby ( \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {0}) \u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 {1} \u3092\u30d6\u30fc\u30c8\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002  \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30d6\u30fc\u30c8\u3067\u304d\u308b Derby \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u30011 \u5ea6\u306b 1 \u3064\u3060\u3051\u3067\u3059\u3002 Derby \u306e 2 \u3064\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u540c\u6642\u306b\u540c\u3058\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30d6\u30fc\u30c8\u3057\u305f\u5834\u5408\u3001\u91cd\u5927\u306a\u3001\u30ea\u30ab\u30d0\u30ea\u30fc\u4e0d\u80fd\u306a\u7834\u58ca\u304c\u767a\u751f\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002  db2j.database.forceDatabaseLock=true \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u305f\u3081\u3001db.lck \u304c\u5b58\u5728\u3057\u306a\u304f\u306a\u308b\u307e\u3067\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u30d6\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002  \u901a\u5e38\u3001\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30d6\u30fc\u30c8\u3059\u308b Derby \u306e\u6700\u521d\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u7d42\u4e86\u3057\u305f\u6642\u70b9\u3067\u9664\u53bb\u3055\u308c\u307e\u3059\u304c\u3001\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u65b9\u6cd5\u306b\u3088\u3063\u3066\u306f\u5f8c\u306b\u6b8b\u3063\u3066\u3057\u307e\u3046\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002  \u305d\u306e\u5834\u5408\u306f\u3001\u624b\u64cd\u4f5c\u3067\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u9664\u53bb\u3059\u308b\u3053\u3068\u304c\u5fc5\u8981\u306b\u306a\u308a\u307e\u3059\u3002  db.lck \u30d5\u30a1\u30a4\u30eb\u3092\u624b\u64cd\u4f5c\u3067\u524a\u9664\u3059\u308b\u524d\u306b\u3001\u3053\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3066\u3044\u308b VM \u304c\u307b\u304b\u306b\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XSDB9.D=\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30b3\u30f3\u30c6\u30ca\u30fc {0} \u306f\u7834\u58ca\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XSDBA.D=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0} \u306e\u5272\u308a\u632f\u308a\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/FileSystem
# statment errors.
# sqlstate range: XSDF0 to XSDFZ
XSDF0.S=\u30d5\u30a1\u30a4\u30eb {0} \u306f\u3059\u3067\u306b\u5b58\u5728\u3059\u308b\u305f\u3081\u3001\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XSDF1.S=\u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u30d5\u30a1\u30a4\u30eb {0} \u306e\u4f5c\u6210\u4e2d\u306b\u4f8b\u5916
XSDF2.S=\u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u30d5\u30a1\u30a4\u30eb {0} \u306e\u4f5c\u6210\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30d5\u30a1\u30a4\u30eb\u3092\u9664\u53bb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u4f8b\u5916: {1}\u3002
XSDF3.S=\u30bb\u30b0\u30e1\u30f3\u30c8 {0} \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
XSDF4.S=\u30c9\u30ed\u30c3\u30d7\u6e08\u307f\u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u30d5\u30a1\u30a4\u30eb {0} \u306e\u9664\u53bb\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30d5\u30a1\u30a4\u30eb\u3092\u9664\u53bb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: {1}\u3002
XSDF6.S=\u5272\u308a\u632f\u308a\u30da\u30fc\u30b8 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
XSDF7.S=\u65b0\u3057\u304f\u4f5c\u6210\u3055\u308c\u305f\u30da\u30fc\u30b8\u3092\u30e9\u30c3\u30c1\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: {0}
XSDF8.S=\u518d\u4f7f\u7528\u3059\u308b\u30da\u30fc\u30b8 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
XSDFB.S=\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
XSDFD.S=\u30da\u30fc\u30b8 {0} \u306e 2 \u3064\u306e\u5165\u51fa\u529b\u3067\u7570\u306a\u308b\u30da\u30fc\u30b8\u30fb\u30a4\u30e1\u30fc\u30b8\u304c\u8aad\u307f\u53d6\u3089\u308c\u307e\u3057\u305f\u30021 \u3064\u76ee\u306e\u30a4\u30e1\u30fc\u30b8\u306f\u8aa4\u3063\u305f\u30c1\u30a7\u30c3\u30af\u30b5\u30e0\u3092\u6301\u3063\u3066\u304a\u308a\u30012 \u3064\u76ee\u306e\u30a4\u30e1\u30fc\u30b8\u306f\u6b63\u3057\u3044\u30c1\u30a7\u30c3\u30af\u30b5\u30e0\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002 \u30da\u30fc\u30b8\u30fb\u30a4\u30e1\u30fc\u30b8\u306f\u6b21\u306e\u901a\u308a\u3067\u3059: {1} {2}
XSDFF.S=\u4e88\u671f\u3057\u306a\u3044\u4f8b\u5916\u306e\u305f\u3081\u3001\u8981\u6c42\u3055\u308c\u305f\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u5931\u6557\u3057\u307e\u3057\u305f\u3002

# java/com/ibm/db2j/impl/Database/Storage/RawStore/Data/FileSystem
# database errors.
# sqlstate range: XSDG0 to XSDGZ
XSDG0.D=\u30da\u30fc\u30b8 {0} \u3092\u30c7\u30a3\u30b9\u30af\u304b\u3089\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XSDG1.D=\u30da\u30fc\u30b8 {0} \u3092\u30c7\u30a3\u30b9\u30af\u306b\u66f8\u304d\u8fbc\u3081\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30c7\u30a3\u30b9\u30af\u304c\u6e80\u676f\u3067\u306a\u3044\u304b\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XSDG2.D=\u30da\u30fc\u30b8 {0} \u306b\u7121\u52b9\u306a\u30c1\u30a7\u30c3\u30af\u30b5\u30e0\u3002\u4e88\u671f\u3055\u308c\u3066\u3044\u305f\u30c1\u30a7\u30c3\u30af\u30b5\u30e0={1}\u3001\u30c7\u30a3\u30b9\u30af\u4e0a\u306e\u30d0\u30fc\u30b8\u30e7\u30f3={2}\u3001\u30da\u30fc\u30b8\u30fb\u30c0\u30f3\u30d7: {3}
XSDG3.D=\u30b3\u30f3\u30c6\u30ca\u30fc {0} \u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
XSDG5.D=createFinished \u306e\u547c\u3073\u51fa\u3057\u6642\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u4f5c\u6210\u30e2\u30fc\u30c9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XSDG6.D=\u30ea\u30b9\u30c8\u30a2\u306e\u9593\u3001\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u306e\u4e2d\u306b\u30c7\u30fc\u30bf\u30fb\u30bb\u30b0\u30e1\u30f3\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 \u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30b3\u30d4\u30fc\u304c\u6b63\u3057\u3044\u3082\u306e\u3067\u3042\u308a\u3001\u305d\u308c\u304c\u7834\u58ca\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XSDG7.D=\u30ea\u30b9\u30c8\u30a2\u306e\u9593\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u3092\u9664\u53bb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u8a31\u53ef\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XSDG8.D=\u30ea\u30b9\u30c8\u30a2\u306e\u9593\u306b\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc ''{0}'' \u3092 ''{1}'' \u306b\u30b3\u30d4\u30fc\u3067\u304d\u307e\u305b\u3093\u3002 \u5341\u5206\u306a\u30b9\u30da\u30fc\u30b9\u304c\u3042\u308a\u3001\u8a31\u53ef\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 

# language
01500=\u8868 {1} \u306e\u5236\u7d04 {0} \u304c\u30c9\u30ed\u30c3\u30d7\u3055\u308c\u307e\u3057\u305f\u3002
01501=\u30d3\u30e5\u30fc {0} \u304c\u30c9\u30ed\u30c3\u30d7\u3055\u308c\u307e\u3057\u305f\u3002
01502=\u8868 {1} \u306e\u30c8\u30ea\u30ac\u30fc {0} \u304c\u30c9\u30ed\u30c3\u30d7\u3055\u308c\u307e\u3057\u305f\u3002
01503=\u8868 {1} \u306e\u5217 {0} \u306f\u3001\u975e\u30cc\u30eb\u5236\u7d04\u306e\u8ffd\u52a0\u306b\u3088\u308a\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
01504=\u65b0\u898f\u7d22\u5f15\u306f\u65e2\u5b58\u7d22\u5f15 {0} \u3068\u91cd\u8907\u3057\u3066\u3044\u307e\u3059\u3002
01505=\u5024 {0} \u306f\u5207\u308a\u6368\u3066\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
01003=\u5217\u95a2\u6570\u306e\u5f15\u304d\u6570\u304b\u3089 NULL \u5024\u304c\u9664\u53bb\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
0100E=XX \u304c\u623b\u305d\u3046\u3068\u3057\u3066\u3044\u308b\u7d50\u679c\u30bb\u30c3\u30c8\u304c\u591a\u3059\u304e\u307e\u3059
02000=FETCH\u3001UPDATE \u307e\u305f\u306f DELETE; \u306e\u884c\u304c\u691c\u51fa\u3055\u308c\u306a\u304b\u3063\u305f\u304b\u3001\u307e\u305f\u306f\u3001\u7167\u4f1a\u7d50\u679c\u304c\u7a7a\u306e\u8868\u3067\u3059\u3002
21000=\u30b9\u30ab\u30e9\u30fc\u526f\u7167\u4f1a\u306f\u3001\u5358\u4e00\u884c\u3057\u304b\u623b\u305b\u307e\u305b\u3093\u3002
22001={0} ''{1}'' \u3092\u9577\u3055 {2} \u306b\u7e2e\u5c0f\u3057\u3088\u3046\u3068\u3057\u3066\u3001\u5207\u308a\u6368\u3066\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
54006={0} \u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u7d50\u679c\u306e\u9577\u3055\u306f {1} \u3088\u308a\u3082\u9577\u3044\u3067\u3059\u3002
22003=\u7d50\u679c\u5024\u306f\u3001\u30c7\u30fc\u30bf\u578b {0} \u306e\u7bc4\u56f2\u5916\u3067\u3059\u3002
22005=\u578b ''{1}'' \u306e\u30c7\u30fc\u30bf\u5024\u304b\u3089\u578b ''{0}'' \u306e\u30c7\u30fc\u30bf\u5024\u3092\u53d6\u5f97\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
22007.S.180=\u65e5\u6642\u5024\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u8868\u8a18\u304c\u7bc4\u56f2\u5916\u3067\u3059\u3002
22007.S.181=\u65e5\u6642\u5024\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u8868\u8a18\u306e\u69cb\u6587\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
22011=SUBSTR \u95a2\u6570\u306e 2 \u756a\u76ee\u307e\u305f\u306f 3 \u756a\u76ee\u306e\u5f15\u304d\u6570\u304c\u7bc4\u56f2\u5916\u3067\u3059\u3002
22012=0 \u9664\u7b97\u3092\u8a66\u884c\u3057\u3066\u3044\u307e\u3059\u3002
22013=\u8ca0\u306e\u6570\u5024 ''{0}'' \u306e\u5e73\u65b9\u6839\u3092\u53d6\u308d\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
22014=LOCATE \u306e\u958b\u59cb\u4f4d\u7f6e\u304c\u7121\u52b9\u3067\u3059\u3002\u3053\u306e\u4f4d\u7f6e\u306f\u6b63\u306e\u6574\u6570\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002  \u691c\u7d22\u3092\u958b\u59cb\u3059\u308b\u7d22\u5f15\u306f ''{2}'' \u3067\u3059\u3002  \u691c\u7d22\u3059\u308b\u30b9\u30c8\u30ea\u30f3\u30b0\u306f ''{0}'' \u3067\u3059\u3002  \u30b9\u30c8\u30ea\u30f3\u30b0\u306e\u691c\u7d22\u5143\u306f ''{1}'' \u3067\u3059\u3002 
22015=''{0}'' \u95a2\u6570\u306f\u3001\u6b21\u306e\u578b\u306e\u30bb\u30c3\u30c8\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002  \u7b2c 1 \u30aa\u30da\u30e9\u30f3\u30c9\u306f\u578b ''{1}'' \u3067\u3059\u3002  \u7b2c 2 \u30aa\u30da\u30e9\u30f3\u30c9\u306f\u578b ''{2}'' \u3067\u3059\u3002  \u7b2c 3 \u30aa\u30da\u30e9\u30f3\u30c9 (\u958b\u59cb\u4f4d\u7f6e) \u306f\u578b ''{3}'' \u3067\u3059\u3002
22018=\u578b {0} \u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u6587\u5b57\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3067\u3059\u3002
22019=\u7121\u52b9\u306a\u30a8\u30b9\u30b1\u30fc\u30d7\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9\u3067\u3059: ''{0}''\u3002 \u30a8\u30b9\u30b1\u30fc\u30d7\u30fb\u30b9\u30c8\u30ea\u30f3\u30b0\u306f\u30011 \u6587\u5b57\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 NULL \u3067\u3082 2 \u6587\u5b57\u4ee5\u4e0a\u3067\u3082\u3044\u3051\u307e\u305b\u3093\u3002
22025=\u30a8\u30b9\u30b1\u30fc\u30d7\u6587\u5b57\u306e\u5f8c\u306b\u306f\u30a8\u30b9\u30b1\u30fc\u30d7\u6587\u5b57 '_' \u307e\u305f\u306f '%' \u304c\u5fc5\u8981\u3067\u3059\u3002 \u30a8\u30b9\u30b1\u30fc\u30d7\u6587\u5b57\u306e\u5f8c\u306b\u3053\u308c\u4ee5\u5916\u306e\u6587\u5b57\u3092\u7d9a\u3051\u305f\u308a\u3001\u30a8\u30b9\u30b1\u30fc\u30d7\u6587\u5b57\u3092\u30d1\u30bf\u30fc\u30f3\u306e\u7d42\u308f\u308a\u306b\u6307\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
22027=\u7d44\u307f\u8fbc\u307f TRIM() \u95a2\u6570\u306f\u3001\u5358\u4e00\u30c8\u30ea\u30e0\u6587\u5b57\u306e\u307f\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002  LTRIM() \u304a\u3088\u3073 RTRIM() \u7d44\u307f\u8fbc\u307f\u95a2\u6570\u306f\u8907\u6570\u306e\u30c8\u30ea\u30e0\u6587\u5b57\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002
22500=LIKE \u30d1\u30bf\u30fc\u30f3\u3068 ESCAPE \u6587\u7bc0\u306e\u4e21\u65b9\u306b ? \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
22501=NULL \u306e ESCAPE \u6587\u7bc0\u306f\u672a\u5b9a\u7fa9\u306e\u7d50\u679c\u3092\u623b\u3059\u305f\u3081\u3001\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
23502=\u5217 ''{0}'' \u306f NULL \u5024\u3092\u53d7\u3051\u5165\u308c\u3089\u308c\u307e\u305b\u3093\u3002
23505=\u3053\u306e\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u3001\u30e6\u30cb\u30fc\u30af\u307e\u305f\u306f\u4e3b\u30ad\u30fc\u5236\u7d04\u3001\u307e\u305f\u306f ''{1}'' \u4e0a\u3067\u5b9a\u7fa9\u3055\u308c\u305f ''{0}'' \u306b\u3088\u3063\u3066\u8b58\u5225\u3055\u308c\u308b\u30e6\u30cb\u30fc\u30af\u7d22\u5f15\u306b\u304a\u3044\u3066\u91cd\u8907\u30ad\u30fc\u5024\u306e\u539f\u56e0\u3068\u306a\u308b\u53ef\u80fd\u6027\u304c\u3042\u3063\u305f\u305f\u3081\u3001\u6253\u3061\u5207\u3089\u308c\u307e\u3057\u305f\u3002
23503=\u8868 ''{1}'' \u4e0a\u306e {2} \u304c\u539f\u56e0\u3067\u3001\u30ad\u30fc {3} \u306e\u5916\u90e8\u30ad\u30fc\u5236\u7d04 ''{0}'' \u9055\u53cd\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u3055\u308c\u307e\u3057\u305f\u3002
23513=\u8868 ''{0}'' \u3067 INSERT \u307e\u305f\u306f UPDATE \u3092\u5b9f\u884c\u3057\u3066\u3044\u308b\u3068\u304d\u306b\u30c1\u30a7\u30c3\u30af\u5236\u7d04 ''{1}'' \u306e\u9055\u53cd\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
38000=\u5f0f\u3092\u8a55\u4fa1\u3057\u3066\u3044\u308b\u9593\u306b\u4f8b\u5916 ''{0}'' \u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
38001=\u5916\u90e8\u30eb\u30fc\u30c1\u30f3\u306f SQL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
38002=\u30eb\u30fc\u30c1\u30f3\u304c\u30c7\u30fc\u30bf\u3092\u5909\u66f4\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u305d\u306e\u30eb\u30fc\u30c1\u30f3\u306f MODIFIES SQL DATA \u3068\u3057\u3066\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002
38004=\u30eb\u30fc\u30c1\u30f3\u304c\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u305d\u306e\u30eb\u30fc\u30c1\u30f3\u306f READS SQL DATA \u3068\u3057\u3066\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002
39004=\u30d7\u30ea\u30df\u30c6\u30a3\u30d6\u578b ''{0}'' \u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u53d6\u308b\u30e1\u30bd\u30c3\u30c9\u306b NULL \u5024\u3092\u6e21\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
40XC0=\u975e\u6d3b\u52d5\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3002 \u539f\u56e0\u3068\u3057\u3066\u3001\u3053\u306e\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u5185\u3067\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u91cd\u5927\u5ea6\u30a8\u30e9\u30fc\u3092\u30ad\u30e3\u30c3\u30c1\u3057\u305f\u3053\u3068\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002
# this error is retired in 1.3
42000=\u69cb\u6587\u30a8\u30e9\u30fc\u307e\u305f\u306f\u30a2\u30af\u30bb\u30b9\u898f\u5247\u9055\u53cd\u3002\u8a73\u3057\u304f\u306f\u8ffd\u52a0\u30a8\u30e9\u30fc\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# DB2 error for max length violation by char, varchar and long varchar. In future, this error message will be used for other purposes too
42601=ALTER TABLE \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u306f\u3001\u5217 ''{0}'' \u306f NOT NULL \u3068\u3057\u3066\u6307\u5b9a\u3055\u308c\u3001DEFAULT \u6587\u7bc0\u306f\u3001\u6307\u5b9a\u3055\u308c\u306a\u304b\u3063\u305f\u304b\u3001DEFAULT NULL \u3068\u3057\u3066\u6307\u5b9a\u3055\u308c\u305f\u304b\u306e\u3044\u305a\u308c\u304b\u3067\u3059\u3002
42601.S.372=ALTER TABLE \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u3001\u8868\u306b IDENTITY \u5217\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
42606=''{0}'' \u3067\u59cb\u307e\u308b\u7121\u52b9\u306a 16 \u9032\u5b9a\u6570\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
54002=''{0}'' \u3067\u59cb\u307e\u308b\u30b9\u30c8\u30ea\u30f3\u30b0\u5b9a\u6570\u304c\u9577\u3059\u304e\u307e\u3059\u3002
42611=\u5217\u306e\u9577\u3055\u3001\u7cbe\u5ea6\u3001\u307e\u305f\u306f\u6841\u6570\u306e\u5c5e\u6027\u3001\u307e\u305f\u306f\u3001\u578b\u306e\u30de\u30c3\u30d4\u30f3\u30b0 ''{0}'' \u304c\u7121\u52b9\u3067\u3059\u3002

42605=\u95a2\u6570 ''{0}'' \u306e\u5f15\u304d\u6570\u306e\u6570\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
42610=COALESC/VALUE \u95a2\u6570\u306b\u5bfe\u3059\u308b\u5f15\u304d\u6570\u306e\u3059\u3079\u3066\u3092\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5f15\u304d\u6570\u306f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u306a\u3044\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

42613=''{0}'' \u6587\u7bc0\u3092\u542b\u3093\u3060\u3001\u8907\u6570\u306e\u3001\u3042\u308b\u3044\u306f\u7af6\u5408\u3059\u308b\u30ad\u30fc\u30ef\u30fc\u30c9\u304c\u5b58\u5728\u3057\u307e\u3059\u3002
42621=''{0}'' \u3067\u5b9a\u7fa9\u3055\u308c\u305f\u30c1\u30a7\u30c3\u30af\u5236\u7d04\u307e\u305f\u306f\u751f\u6210\u5217\u306f\u7121\u52b9\u3067\u3059\u3002
42734=\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8 ''{1}'' \u306b\u6307\u5b9a\u3055\u308c\u305f\u540d\u524d ''{0}'' \u304c\u56fa\u6709\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
# DB2 error for invalid set schema
42802=\u5272\u308a\u5f53\u3066\u3089\u308c\u305f\u5024\u306e\u6570\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u5217\u307e\u305f\u306f\u6697\u9ed9\u306e\u5217\u306e\u6570\u3068\u540c\u3058\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42815.S.713=''{0}'' \u306e\u7f6e\u304d\u63db\u3048\u5024\u304c\u7121\u52b9\u3067\u3059\u3002
42815.S.171=\u5f15\u304d\u6570 ''{0}'' \u304a\u3088\u3073 ''{1}'' \u306e\u30c7\u30fc\u30bf\u578b\u3001\u9577\u3055\u3001\u307e\u305f\u306f\u5024\u306b\u306f\u4e92\u63db\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002
42820=\u6d6e\u52d5\u5c0f\u6570\u70b9\u30ea\u30c6\u30e9\u30eb ''{0}'' \u306f 30 \u6587\u5b57\u4ee5\u4e0a\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002
42824=LIKE \u306e\u30aa\u30da\u30e9\u30f3\u30c9\u304c\u30b9\u30c8\u30ea\u30f3\u30b0\u3067\u306a\u3044\u304b\u3001\u7b2c 1 \u30aa\u30da\u30e9\u30f3\u30c9\u304c\u5217\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42831=NULL \u5024 \u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u305f\u3081\u3001''{0}'' \u3092\u4e3b\u30ad\u30fc\u307e\u305f\u306f\u30e6\u30cb\u30fc\u30af\u30fb\u30ad\u30fc\u306e\u5217\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42834=FOREIGN KEY ''{0}'' \u306b NULL \u5024\u3092\u542b\u3080\u3053\u3068\u304c\u3067\u304d\u306a\u3044\u305f\u3081\u3001SET NULL \u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42884=\u4e92\u63db\u6027\u306e\u3042\u308b\u5f15\u304d\u6570\u3092\u6301\u3064\u3001\u578b ''{1}'' \u306e ''{0}'' \u3068\u3044\u3046\u540d\u524d\u306e\u8a31\u53ef\u30eb\u30fc\u30c1\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
42886=''{0}'' \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{1}'' \u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u30fb\u30de\u30fc\u30ab\u30fc ''?'' \u304c\u5fc5\u8981\u3067\u3059\u3002
42894=DEFAULT \u5024\u307e\u305f\u306f IDENTITY \u5c5e\u6027\u5024\u306f\u5217 ''{0}'' \u306b\u5bfe\u3057\u3066\u7121\u52b9\u3067\u3059\u3002
428C1=1 \u3064\u306e\u8868\u306b\u5bfe\u3057\u3001ID \u5217\u306f 1 \u5217\u306e\u307f\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
42903=\u96c6\u7d04\u95a2\u6570\u306e\u4f7f\u7528\u306f\u7121\u52b9\u3067\u3059\u3002
42908=CREATE VIEW \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306b\u5217\u30ea\u30b9\u30c8\u304c\u3042\u308a\u307e\u305b\u3093\u3002
42915=\u5916\u90e8\u30ad\u30fc ''{0}'' \u306f\u3001''{1}'' \u306e\u305f\u3081\u7121\u52b9\u3067\u3059\u3002 
42972=JOIN \u6f14\u7b97\u5b50\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f ON \u6587\u7bc0\u304c\u7121\u52b9\u3067\u3059\u3002
42X01=\u69cb\u6587\u30a8\u30e9\u30fc: {0}\u3002
42X02={0}\u3002
42X03=\u5217\u540d ''{0}'' \u306f\u3001FROM \u30ea\u30b9\u30c8\u5185\u306e\u8907\u6570\u306e\u8868\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X04=\u5217 ''{0}'' \u306f\u3001FROM \u30ea\u30b9\u30c8\u5185\u306e\u3069\u306e\u8868\u306b\u3082\u306a\u3044\u304b\u3001\u7d50\u5408\u4ed5\u69d8\u5185\u306b\u3042\u308b\u306e\u306b\u305d\u306e\u7d50\u5408\u4ed5\u69d8\u306e\u7bc4\u56f2\u5916\u3067\u3042\u308b\u304b\u3001\u307e\u305f\u306f HAVING \u6587\u7bc0\u5185\u306b\u3042\u308b\u306e\u306b GROUP BY \u30ea\u30b9\u30c8\u306b\u5165\u3063\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002  \u3053\u308c\u304c CREATE \u307e\u305f\u306f ALTER TABLE \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u5834\u5408\u3001''{0}'' \u306f\u30bf\u30fc\u30b2\u30c3\u30c8\u8868\u5185\u306e\u5217\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42X05=\u8868 ''{0}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
42X06=\u8868 ''{0}'' \u306b\u5bfe\u3057\u3066\u6307\u5b9a\u3055\u308c\u305f\u7d50\u679c\u5217\u306e\u6570\u304c\u591a\u904e\u304e\u307e\u3059\u3002
42X07=NULL \u306f\u3001INSERT \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u4e2d\u306e VALUES \u6587\u7bc0\u3067\u3057\u304b\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42X08=\u30af\u30e9\u30b9 ''{0}'' \u306f''{1}'' \u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3057\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u30af\u30e9\u30b9\u306e\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u3092\u5916\u90e8\u4eee\u60f3\u8868\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42X09=\u8868\u30a8\u30a4\u30ea\u30a2\u30b9\u540d ''{0}'' \u304c FROM \u30ea\u30b9\u30c8\u3067\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X10=''{0}'' \u306f\u3001\u305d\u308c\u304c\u4f7f\u7528\u3055\u308c\u308b\u30b9\u30b3\u30fc\u30d7\u5185\u3067\u3001\u516c\u958b\u3055\u308c\u305f\u8868\u540d\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42622=\u540d\u524d ''{0}'' \u306f\u9577\u3059\u304e\u307e\u3059\u3002\u6700\u5927\u9577\u306f ''{1}'' \u3067\u3059\u3002
42X12=\u5217\u540d ''{0}'' \u306f\u3001CREATE TABLE \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
54011=\u8868\u307e\u305f\u306f\u30d3\u30e5\u30fc {1} \u306b\u6307\u5b9a\u3055\u308c\u305f\u5217 ({0}) \u304c\u591a\u3059\u304e\u307e\u3059\u3002\u5236\u9650\u306f {2} \u3067\u3059\u3002
42Z9F=\u8868 {1} \u306b\u6307\u5b9a\u3055\u308c\u305f\u7d22\u5f15 ({0}) \u304c\u591a\u3059\u304e\u307e\u3059\u3002\u5236\u9650\u306f {2} \u3067\u3059\u3002
42X13=\u5217\u540d ''{0}'' \u306f\u3001INSERT \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u5217\u30ea\u30b9\u30c8\u3067\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X14=''{0}'' \u306f\u8868\u306e\u5217\u307e\u305f\u306f VTI ''{1}'' \u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42X15=\u5217\u540d ''{0}'' \u306f\u3001FROM \u30ea\u30b9\u30c8\u306a\u3057\u3067\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X16=\u5217\u540d ''{0}'' \u306f\u3001UPDATE \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e SET \u6587\u7bc0\u306b\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X17=\u5024 ''{0}'' \u306f\u3001FROM \u6587\u7bc0\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ea\u30b9\u30c8\u5185\u306e joinOrder \u4ed5\u69d8\u3068\u3057\u3066\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002 FIXED \u304a\u3088\u3073 UNFIXED \u306e\u5024\u306e\u307f\u304c\u6709\u52b9\u3067\u3059\u3002
42803=\u5217 ''{0}'' \u3092\u542b\u3080\u5f0f\u304c SELECT \u30ea\u30b9\u30c8\u306b\u51fa\u3066\u304d\u307e\u3059\u304c\u3001\u3053\u308c\u306f GROUP BY \u6587\u7bc0\u306e\u4e00\u90e8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42818=''{0}'' \u3068 ''{1}'' \u306e\u6bd4\u8f03\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
42X19=WHERE \u307e\u305f\u306f HAVING \u6587\u7bc0\u3001\u3042\u308b\u3044\u306f CHECK CONSTRAINT \u5b9a\u7fa9\u306f ''{0}'' \u5f0f\u3067\u3059\u3002  \u3053\u308c\u306f\u30d6\u30fc\u30eb\u5f0f\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X23=\u30ab\u30fc\u30bd\u30eb {0} \u306f\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002
#42X24=The unary ''-'' operator is not allowed on the ''{0}'' type.
42X25=''{0}'' \u95a2\u6570\u306f\u3001''{1}'' \u578b\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42X26=\u5217 ''{1}'' \u306e\u30af\u30e9\u30b9 ''{0}'' \u306f\u5b58\u5728\u3057\u306a\u3044\u304b\u3001\u30a2\u30af\u30bb\u30b9\u4e0d\u80fd\u3067\u3059\u3002 \u3053\u308c\u306f\u3001\u3053\u306e\u30af\u30e9\u30b9\u304c public \u3067\u306a\u3044\u5834\u5408\u306b\u767a\u751f\u3059\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
42X28=\u524a\u9664\u8868 ''{0}'' \u306f\u3001\u30ab\u30fc\u30bd\u30eb ''{1}'' \u306e\u30bf\u30fc\u30b2\u30c3\u30c8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42X29=\u66f4\u65b0\u8868 ''{0}'' \u306f\u3001\u30ab\u30fc\u30bd\u30eb ''{1}'' \u306e\u30bf\u30fc\u30b2\u30c3\u30c8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42X30=\u30ab\u30fc\u30bd\u30eb ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 \u81ea\u52d5\u30b3\u30df\u30c3\u30c8\u304c\u30aa\u30d5\u306b\u306a\u3063\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
42X31=\u5217 ''{0}'' \u306f\u30ab\u30fc\u30bd\u30eb ''{1}'' \u306e FOR UPDATE \u30ea\u30b9\u30c8\u306b\u5165\u3063\u3066\u3044\u307e\u305b\u3093\u3002
42X32=\u6d3e\u751f\u5217\u30ea\u30b9\u30c8\u306e\u5217\u6570\u306f\u3001\u8868 ''{0}'' \u306e\u5217\u6570\u3068\u4e00\u81f4\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X33=\u6d3e\u751f\u5217\u30ea\u30b9\u30c8\u306b\u3001\u91cd\u8907\u3059\u308b\u5217\u540d ''{0}'' \u304c\u3042\u308a\u307e\u3059\u3002
42X34=\u9078\u629e\u30ea\u30b9\u30c8\u306b ? \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u308c\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42X35=''{0}'' \u306e\u4e21\u65b9\u306e\u30aa\u30da\u30e9\u30f3\u30c9\u3092 ? \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42X36=''{0}'' \u6f14\u7b97\u5b50\u306f\u3001? \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u30aa\u30da\u30e9\u30f3\u30c9\u3068\u3057\u3066\u53d6\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42X37=\u5358\u9805 ''{0}'' \u6f14\u7b97\u5b50\u306f\u3001''{1}'' \u578b\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42X38=''SELECT *'' \u306f\u3001EXISTS \u304a\u3088\u3073 NOT EXISTS \u526f\u7167\u4f1a\u3067\u306e\u307f\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
42X39=\u526f\u7167\u4f1a\u306f\u3001\u5358\u4e00\u5217\u3092\u623b\u3059\u3053\u3068\u3057\u304b\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42X40=NOT \u306f\u975e\u30d6\u30fc\u30eb\u30fb\u30aa\u30da\u30e9\u30f3\u30c9\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002 NOT \u306e\u30aa\u30da\u30e9\u30f3\u30c9\u306f\u3001TRUE\u3001FALSE\u3001\u307e\u305f\u306f UNKNOWN \u306b\u8a55\u4fa1\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X41=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}'' \u306f\u3001FROM \u30ea\u30b9\u30c8\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u6587\u7bc0\u3067\u306f\u7121\u52b9\u3067\u3059 (\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f ''{1}'' \u306b\u8a2d\u5b9a\u3055\u308c\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3057\u305f)\u3002
42821=\u578b ''{0}'' \u306e\u5217\u306f\u3001\u578b ''{1}'' \u306e\u5024\u3092\u4fdd\u6301\u3067\u304d\u307e\u305b\u3093\u3002 
42X43=\u30af\u30e9\u30b9/\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 ''{0}'' \u306b\u5bfe\u3057\u3066\u623b\u3055\u308c\u305f ResultSetMetaData \u304c NULL \u3067\u3057\u305f\u3002 \u3053\u306e\u30af\u30e9\u30b9\u3092\u5916\u90e8\u4eee\u60f3\u8868\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u305f\u3081\u306b\u306f\u3001ResultSetMetaData \u3092\u975e NULL \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X44=\u5217\u4ed5\u69d8\u306b\u7121\u52b9\u306a\u9577\u3055 ''{0}'' \u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
# 42X45=
# 42X46=
# 42X47=
42X48=\u5024 ''{1}'' \u306f {0} \u306e\u6709\u52b9\u306a\u7cbe\u5ea6\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42X49=\u5024 ''{0}'' \u306f\u6709\u52b9\u306a\u6574\u6570\u30ea\u30c6\u30e9\u30eb\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42X50=\u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057 {0}.{1}({2}) \u306b\u4e00\u81f4\u3067\u304d\u308b\u30e1\u30bd\u30c3\u30c9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u578b\u3068\u30d7\u30ea\u30df\u30c6\u30a3\u30d6\u578b\u306e\u3059\u3079\u3066\u306e\u7d44\u307f\u5408\u308f\u305b\u3068\u3001\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u547c\u3073\u51fa\u3057\u304c\u6301\u3064\u53ef\u80fd\u6027\u306e\u3042\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u53ef\u80fd\u306a\u578b\u5909\u63db\u3092\u3059\u3079\u3066\u8a66\u3057\u307e\u3057\u305f\u304c\u3001\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u5b58\u5728\u3059\u308b\u304c\u3001public \u307e\u305f\u306f\u9759\u7684\u3067\u306a\u3044 (\u3042\u308b\u3044\u306f\u305d\u306e\u4e21\u65b9) \u304b\u3001\u307e\u305f\u306f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u578b\u304c\u30e1\u30bd\u30c3\u30c9\u8d77\u52d5\u5909\u63db\u53ef\u80fd\u3067\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
42X51=\u30af\u30e9\u30b9 ''{0}'' \u306f\u5b58\u5728\u3057\u306a\u3044\u304b\u3001\u30a2\u30af\u30bb\u30b9\u4e0d\u80fd\u3067\u3059\u3002 \u3053\u308c\u306f\u3001\u3053\u306e\u30af\u30e9\u30b9\u304c public \u3067\u306a\u3044\u5834\u5408\u306b\u767a\u751f\u3059\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
42X52=Java \u30d7\u30ea\u30df\u30c6\u30a3\u30d6\u578b ''{1}" \u306e\u53d7\u4fe1\u5074\u3092\u4f7f\u3063\u3066\u30e1\u30bd\u30c3\u30c9 (''{0}'') \u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
42X53=LIKE \u8ff0\u90e8\u306f\u3001''CHAR'' \u307e\u305f\u306f ''VARCHAR'' \u30aa\u30da\u30e9\u30f3\u30c9\u3057\u304b\u6301\u3064\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002 \u578b ''{0}'' \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42X54=Java \u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306f\u53d7\u4fe1\u5074\u3068\u3057\u3066 ? \u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42X55=\u8868\u540d ''{1}'' \u306f\u3001''{0}'' \u3068\u540c\u3058\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X56=\u30d3\u30e5\u30fc\u5217\u30ea\u30b9\u30c8\u5185\u306e\u5217\u6570\u304c\u3001''{0}'' \u306e\u30d3\u30e5\u30fc\u5b9a\u7fa9\u306b\u3042\u308b\u3001\u57fa\u672c\u3068\u306a\u308b\u7167\u4f1a\u5f0f\u306e\u5217\u6570\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
42X57=\u5916\u90e8\u4eee\u60f3\u8868 ''{0}'' \u306e getColumnCount() \u304c\u7121\u52b9\u306a\u5024 ''{1}'' \u3092\u623b\u3057\u307e\u3057\u305f\u3002  \u6709\u52b9\u5024\u306f >= 1\u3002
42X58=UNION \u306e\u5de6\u5074\u306e\u5217\u3068\u53f3\u5074\u306e\u5217\u306e\u6570\u306f\u540c\u3058\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X59=\u5404 VALUES \u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u306e\u5217\u306e\u6570\u306f\u540c\u3058\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X60=\u8868 ''{1}'' \u306e insertMode \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u7121\u52b9\u5024 ''{0}'' \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
42X61=\u578b ''{0}'' \u3068 ''{1}'' \u306f UNION \u4e92\u63db\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42X62=''{0}'' \u306f\u3001''{1}'' \u30b9\u30ad\u30fc\u30de\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42X63=USING \u6587\u7bc0\u304c\u7d50\u679c\u3092\u623b\u3055\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
42X64=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ea\u30b9\u30c8\u306e useStatistics \u306b\u7121\u52b9\u5024 ''{0}'' \u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u6709\u52b9\u5024\u306f\u3001TRUE \u307e\u305f\u306f FALSE \u306e\u307f\u3067\u3059\u3002
42X65=\u7d22\u5f15 ''{0}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
42X66=\u5217\u540d ''{0}'' \u306f\u3001create index \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306b\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X68=\u30af\u30e9\u30b9 ''{1}'' \u306b\u5c5e\u3059\u30d5\u30a3\u30fc\u30eb\u30c9 ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u5b58\u5728\u3059\u308b\u3051\u308c\u3069\u3082 public \u3067\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u30af\u30e9\u30b9\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u3001public \u3067\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
42X69=Java \u30d7\u30ea\u30df\u30c6\u30a3\u30d6\u578b ''{1}'' \u306e\u53c2\u7167\u5f0f\u3092\u4f7f\u3063\u3066\u30d5\u30a3\u30fc\u30eb\u30c9 (''{0}'') \u3092\u53c2\u7167\u3059\u308b\u3053\u3068\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
42X72=\u30af\u30e9\u30b9 ''{1}'' \u306b\u5c5e\u3059\u9759\u7684\u30d5\u30a3\u30fc\u30eb\u30c9 ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u5b58\u5728\u3059\u308b\u3051\u308c\u3069\u3082 public \u307e\u305f\u306f\u9759\u7684\u3067\u306a\u3044 (\u3042\u308b\u3044\u306f\u305d\u306e\u4e21\u65b9) \u304b\u3001\u307e\u305f\u306f\u30af\u30e9\u30b9\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u3001public \u3067\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
42X73=\u30b7\u30b0\u30cb\u30c1\u30e3\u30fc {0}.{1}({2}) \u306e\u30e1\u30bd\u30c3\u30c9\u89e3\u6c7a\u304c\u672a\u78ba\u5b9a\u3067\u3057\u305f\u3002 (\u6700\u5927\u9650\u306b\u7279\u5b9a\u306e\u5358\u4e00\u30e1\u30bd\u30c3\u30c9\u306f\u3042\u308a\u307e\u305b\u3093\u3002)
42X74=\u7121\u52b9\u306a CALL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u69cb\u6587\u3002
42X75=\u30b7\u30b0\u30cb\u30c1\u30e3\u30fc {0}({1}) \u3092\u6301\u3064\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002  \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u578b\u304c\u30e1\u30bd\u30c3\u30c9\u8d77\u52d5\u5909\u63db\u53ef\u80fd\u3067\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
42X76=\u8ffd\u52a0\u3055\u308c\u3066\u3044\u308b\u4e3b\u30ad\u30fc\u306e\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5217 ''{0}'' \u304c NULL \u53ef\u80fd\u3067\u3059\u3002 \u4e3b\u30ad\u30fc\u5217\u306f\u3069\u308c\u3082 NULL \u53ef\u80fd\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42X77=\u5217\u4f4d\u7f6e ''{0}'' \u306f\u7167\u4f1a\u5f0f\u306e\u7bc4\u56f2\u5916\u3067\u3059\u3002
42X78=\u5217 ''{0}'' \u304c\u7167\u4f1a\u5f0f\u306e\u7d50\u679c\u306b\u3042\u308a\u307e\u305b\u3093\u3002
42X79=\u5217\u540d ''{0}'' \u306f\u3001\u7167\u4f1a\u5f0f\u306e\u7d50\u679c\u306b\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42877=\u5217\u306e\u4fee\u98fe\u540d ''{0}'' \u306f\u3001ORDER BY \u6587\u7bc0\u306b\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
42X80=VALUES \u6587\u7bc0\u306b\u306f\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3069\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u3082\u7a7a\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42X82=USING \u6587\u7bc0\u304c\u8907\u6570\u306e\u884c\u3092\u623b\u3057\u307e\u3057\u305f\u304c\u3001\u5358\u4e00\u884c\u306e ResultSet \u306e\u307f\u304c\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
42X83=\u5217 ''{0}'' \u4e0a\u306e\u5236\u7d04\u306f\u3001NULL \u53ef\u80fd\u3067\u3042\u308a\u3001\u306a\u304a\u304b\u3064 NULL \u53ef\u80fd\u3067\u306a\u3044\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X84=\u5236\u7d04 ''{1}'' \u3092\u5f37\u5236\u3059\u308b\u305f\u3081\u306e\u7d22\u5f15 ''{0}'' \u304c\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u3002  \u3053\u306e\u7d22\u5f15\u3092\u30c9\u30ed\u30c3\u30d7\u3059\u308b\u552f\u4e00\u306e\u65b9\u6cd5\u306f\u3001\u3053\u306e\u5236\u7d04\u3092\u30c9\u30ed\u30c3\u30d7\u3059\u308b\u3053\u3068\u3067\u3059\u3002
42X85=\u5236\u7d04 ''{0}'' \u306f\u3001\u8868 ''{1}'' \u3068\u540c\u3058\u30b9\u30ad\u30fc\u30de\u306b\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X86=ALTER \u8868\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u8868 ''{1}'' \u306b\u5bfe\u3059\u308b\u5236\u7d04 ''{0}'' \u304c\u3042\u308a\u307e\u305b\u3093\u3002
42X87=''{0}'' \u5f0f\u306e\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u7d50\u679c\u5f0f (then \u307e\u305f\u306f else) \u306f\u3001''?'' \u306b\u3067\u304d\u307e\u305b\u3093\u3002
42X88=Conditional \u306f\u975e\u30d6\u30fc\u30eb\u30fb\u30aa\u30da\u30e9\u30f3\u30c9\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002 Conditional \u306e\u30aa\u30da\u30e9\u30f3\u30c9\u306f\u3001TRUE\u3001FALSE\u3001\u307e\u305f\u306f UNKNOWN \u306b\u8a55\u4fa1\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42X89=\u578b ''{0}'' \u3068 ''{1}'' \u306f\u3001\u4e92\u63db\u6027\u306e\u3042\u308b\u578b\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002 (\u3069\u3061\u3089\u306e\u578b\u3082\u3082\u3046\u4e00\u65b9\u306e\u578b\u306b\u5272\u308a\u5f53\u3066\u3067\u304d\u307e\u305b\u3093\u3002)
42X90=\u8868 ''{0}'' \u306b\u5bfe\u3057\u3066\u8907\u6570\u306e\u4e3b\u30ad\u30fc\u5236\u7d04\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X91=\u5236\u7d04\u540d ''{0}'' \u306f\u3001create table \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X92=\u5217\u540d ''{0}'' \u306f\u3001\u5236\u7d04\u306e\u5217\u30ea\u30b9\u30c8\u3067\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42X93=\u8868 ''{0}'' \u306b\u306f\u3001\u3053\u306e\u8868\u306b\u306a\u3044\u5217 ''{1}'' \u3092\u6301\u3064\u5236\u7d04\u5b9a\u7fa9\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
42Z93=\u5236\u7d04 ''{0}'' \u3068 ''{1}'' \u306f\u540c\u3058\u5217\u30bb\u30c3\u30c8\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u304c\u3001\u3053\u308c\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Z96=\u8aad\u307f\u53d6\u308a/\u66f8\u304d\u8fbc\u307f VTI \u306f\u3001JDK 1.1/JDBC 1.2 \u74b0\u5883\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093: ''{0}''
42Z9B=\u5916\u90e8\u4eee\u60f3\u8868\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u306f\u3001BLOB \u307e\u305f\u306f CLOB \u5217\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002 ''{0}'' \u5217 ''{1}''\u3002
42Z9D=''{0}'' \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u3001''{1}'' \u30c8\u30ea\u30ac\u30fc\u306b\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Z9E=\u5236\u7d04 ''{0}'' \u306f\u3001{1} \u5236\u7d04\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42X94={0} ''{1}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
42X96=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30af\u30e9\u30b9\u30d1\u30b9\u306b\u4e0d\u660e\u306a jar \u30d5\u30a1\u30a4\u30eb ''{0}'' \u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
42X98=\u30d3\u30e5\u30fc\u5b9a\u7fa9\u3067\u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Y00=\u30af\u30e9\u30b9 ''{0}'' \u306f\u3001org.apache.derby.iapi.db.AggregateDefinition \u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3057\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u96c6\u5408\u4f53\u5f0f\u3068\u3057\u3066\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
42Y01=\u5236\u7d04 ''{0}'' \u306f\u7121\u52b9\u3067\u3059\u3002
42Y03=''{0}'' \u306f\u95a2\u6570\u307e\u305f\u306f\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u3068\u3057\u3066\u8a8d\u8b58\u3055\u308c\u307e\u305b\u3093\u3002

# EXTERNAL NAME is SQL keyword - do not translate
42Y04=\u30c9\u30c3\u30c8\u5206\u96e2\u30ea\u30b9\u30c8\u3067\u306a\u3044\u305f\u3081\u3001EXTERNAL NAME ''{0}'' \u3067\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u307e\u305f\u306f\u95a2\u6570\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002\u4e88\u671f\u3055\u308c\u3066\u3044\u308b\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306f <full java path>.<method name> \u3067\u3059\u3002

42Y05=''{0}'' \u3068\u3044\u3046\u540d\u524d\u306e\u5916\u90e8\u30ad\u30fc\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42Y07=\u30b9\u30ad\u30fc\u30de ''{0}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093
42Y08=\u5916\u90e8\u30ad\u30fc\u5236\u7d04\u306f\u3001\u30b7\u30b9\u30c6\u30e0\u8868\u3067\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
42Y09=void \u30e1\u30bd\u30c3\u30c9\u306f\u3001CALL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u5185\u3067\u306e\u307f\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
42Y10=INSERT \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306b\u306a\u3044\u8868\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u304c\u3001\u5217\u306e 1 \u3064\u306b\u3059\u3079\u3066 ? \u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002  \u5404\u5217\u3054\u3068\u306b\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u884c\u304c\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u4ee5\u5916\u306e\u5024\u3092\u6301\u3063\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42Y11=''{0}'' \u6587\u7bc0\u306b\u306f\u3001\u7d50\u5408\u4ed5\u69d8\u304c\u5fc5\u8981\u3067\u3059\u3002
42Y12=JOIN \u306e ON \u6587\u7bc0\u304c ''{0}'' \u5f0f\u3067\u3059\u3002  \u3053\u308c\u306f\u30d6\u30fc\u30eb\u5f0f\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42Y13=\u5217\u540d ''{0}'' \u306f\u3001create view \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
42Z97=\u5217 ''{0}'' \u306e\u540d\u524d\u3092\u5909\u66f4\u3059\u308b\u3068\u3001\u30c1\u30a7\u30c3\u30af\u5236\u7d04 ''{1}'' \u304c\u4e2d\u65ad\u3057\u307e\u3059\u3002
42Z99=\u30b9\u30c8\u30ea\u30f3\u30b0\u307e\u305f\u306f 16 \u9032\u6570\u30ea\u30c6\u30e9\u30eb\u306f\u300164K \u3092\u8d85\u3048\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42Y16=\u30af\u30e9\u30b9 ''{1}'' \u3067 public \u9759\u7684\u30e1\u30bd\u30c3\u30c9 ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u5b58\u5728\u3059\u308b\u3051\u308c\u3069\u3082\u3001public \u3067\u306a\u3044\u304b\u3001\u9759\u7684\u3067\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
42846=\u578b ''{0}'' \u3092 ''{1}'' \u306b\u5909\u63db\u3067\u304d\u307e\u305b\u3093\u3002
42Y19=''{0}'' \u306f\u3001GROUP BY \u30ea\u30b9\u30c8\u3067\u8907\u6570\u56de\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002 GROUP BY \u30ea\u30b9\u30c8\u5185\u306e\u5217\u306f\u3001\u672a\u78ba\u5b9a\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42Y22=\u96c6\u5408\u4f53 {0} \u306f\u3001\u578b {1} \u306b\u5bfe\u3057\u3066\u64cd\u4f5c\u3067\u304d\u307e\u305b\u3093\u3002
42Y23=\u5217 {0} \u306b\u5bfe\u3057\u3066\u8aa4\u3063\u305f JDBC \u578b\u60c5\u5831\u304c\u623b\u3055\u308c\u307e\u3057\u305f\u3002
42Y24=\u8868\u793a ''{0}'' \u306f\u3001\u66f4\u65b0\u4e0d\u80fd\u3067\u3059\u3002 (\u30d3\u30e5\u30fc\u306f\u73fe\u5728\u66f4\u65b0\u4e0d\u80fd\u3067\u3059\u3002)
42Y25=''{0}'' \u306f\u30b7\u30b9\u30c6\u30e0\u8868\u3067\u3059\u3002  \u30e6\u30fc\u30b6\u30fc\u304c\u3053\u306e\u8868\u306e\u5185\u5bb9\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
#42Y26=Parameters are not allowed in the WHEN clause of a trigger.
42Y27=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u3001\u30c8\u30ea\u30ac\u30fc\u30fb\u30a2\u30af\u30b7\u30e7\u30f3\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Y29=\u30b0\u30eb\u30fc\u30d7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u7167\u4f1a\u306e SELECT \u30ea\u30b9\u30c8\u306b\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u7121\u52b9\u306a\u5f0f\u304c\u3042\u308a\u307e\u3059\u3002  SELECT \u30ea\u30b9\u30c8\u306b\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u96c6\u5408\u4f53\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3059\u3079\u3066\u306e\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u6709\u52b9\u306a\u96c6\u5408\u4f53\u5f0f\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
42Y30=\u30b0\u30eb\u30fc\u30d7\u5316\u3055\u308c\u305f\u7167\u4f1a\u306e SELECT \u30ea\u30b9\u30c8\u306b\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u7121\u52b9\u306a\u5f0f\u304c\u3042\u308a\u307e\u3059\u3002  GROUP BY \u3092\u6301\u3064 SELECT \u306e\u5834\u5408\u3001SELECT \u30ea\u30b9\u30c8\u306b\u306f\u30b0\u30eb\u30fc\u30d7\u5217\u3068\u6709\u52b9\u306a\u96c6\u5408\u4f53\u5f0f\u3057\u304b\u542b\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
42Y32=\u578b {2} \u306e\u96c6\u5408\u4f53 ''{1}'' \u306e\u96c6\u5408\u4f53\u30af\u30e9\u30b9 ''{0}'' \u306f com.ibm.db2j.aggregates.Aggregator \u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002 
42Y33=\u96c6\u5408\u4f53 {0} \u306b\u306f\u30011 \u3064\u4ee5\u4e0a\u306e\u96c6\u5408\u4f53\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
42Y34=\u5217\u540d ''{0}'' \u306f\u3001\u8868 ''{1}'' \u5185\u306e\u8907\u6570\u306e\u7d50\u679c\u5217\u306b\u4e00\u81f4\u3057\u307e\u3059\u3002
42Y35=\u5217\u53c2\u7167 ''{0}'' \u306f\u7121\u52b9\u3067\u3059\u3002 SELECT \u30ea\u30b9\u30c8\u306b\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u96c6\u5408\u4f53\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3059\u3079\u3066\u306e\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u6709\u52b9\u306a\u96c6\u5408\u4f53\u5f0f\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
42Y36=\u5217\u53c2\u7167 ''{0}'' \u306f\u7121\u52b9\u3067\u3059\u3002  GROUP BY \u3092\u6301\u3064 SELECT \u306e\u5834\u5408\u3001SELECT \u30ea\u30b9\u30c8\u306b\u306f\u30b0\u30eb\u30fc\u30d7\u5217\u3068\u6709\u52b9\u306a\u96c6\u5408\u4f53\u5f0f\u3057\u304b\u542b\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
42Y37=''{0}'' \u306f Java \u30d7\u30ea\u30df\u30c6\u30a3\u30d6\u3067\u3042\u308a\u3001\u3053\u306e\u6f14\u7b97\u5b50\u3068\u4e00\u7dd2\u306b\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42Y38=insertMode = replace \u306f\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u8868 ''{0}'' \u304c SELECT \u3067\u53c2\u7167\u3055\u308c\u3066\u3044\u308b\u5834\u6240\u3067\u306e\u633f\u5165\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
# NOTE: The parameter to this message is a keyword used as a noun phrase.
# Some possible values are "subquery", "CurrentDate", and "?".
42Y39=''{0}'' \u306f\u3001\u975e deterministic \u7d50\u679c\u3092\u623b\u3059\u53ef\u80fd\u6027\u304c\u3042\u308b\u306e\u3067\u3001CHECK CONSTRAINT \u5b9a\u7fa9\u306b\u73fe\u308c\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
42Y40=''{0}'' \u306f\u3001\u30c8\u30ea\u30ac\u30fc  ''{1}'' \u306e UPDATE OF \u5217\u30ea\u30b9\u30c8\u306b\u8907\u6570\u56de\u73fe\u308c\u307e\u3059\u3002
42Y41=''{0}'' \u306f\u30c8\u30ea\u30ac\u30fc\u306e\u4e00\u90e8\u306a\u306e\u3067\u3001EXECUTE STATEMENT \u3092\u4f7f\u3063\u3066\u76f4\u63a5\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42Y42=\u76ee\u76db\u308a ''{1}'' \u306f\u3001{0} \u306b\u6709\u52b9\u306a\u76ee\u76db\u308a\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42Y43=\u76ee\u76db\u308a ''{0}'' \u306f\u3001''{1}'' \u306e\u7cbe\u5ea6\u306b\u6709\u52b9\u306a\u76ee\u76db\u308a\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42Y44=\u7121\u52b9\u306a\u30ad\u30fc ''{0}'' \u304c\u3001FROM \u30ea\u30b9\u30c8\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ea\u30b9\u30c8\u306b\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002 \u73fe\u5728\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30ad\u30fc\u3067\u3001\u5927\u6587\u5b57\u5c0f\u6587\u5b57\u306e\u533a\u5225\u304c\u3042\u308b\u3082\u306e\u306f ''{1}'' \u3067\u3059\u3002
42Y45=VTI ''{0}'' \u306f\u7279\u6b8a\u30c8\u30ea\u30ac\u30fc VTI \u3067\u3042\u308a\u3001\u3053\u306e\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u30c8\u30ea\u30ac\u30fc\u30fb\u30a2\u30af\u30b7\u30e7\u30f3\u307e\u305f\u306f WHEN \u6587\u7bc0\u306e\u4e00\u90e8\u3067\u306a\u3044\u305f\u3081\u3001\u30d0\u30a4\u30f3\u30c9\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42Y46=FROM \u30ea\u30b9\u30c8\u306b\u7121\u52b9\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ea\u30b9\u30c8\u3002  \u8868 ''{1}'' \u4e0a\u306b\u7d22\u5f15 ''{0}'' \u304c\u3042\u308a\u307e\u305b\u3093\u3002
42Y48=FROM \u30ea\u30b9\u30c8\u306b\u7121\u52b9\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ea\u30b9\u30c8\u3002  \u540d\u524d\u4ed8\u304d\u5236\u7d04 ''{0}'' \u304c\u8868 ''{1}'' \u4e0a\u306b\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u5236\u7d04\u304c\u30d0\u30c3\u30ad\u30f3\u30b0\u7d22\u5f15\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u3002
42Y49=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ad\u30fc ''{0}'' \u306b\u8907\u6570\u306e\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002 
42Y50=\u8868 ''{0}'' \u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ea\u30b9\u30c8\u306b\u306f\u3001\u7d22\u5f15\u306e\u5024\u307e\u305f\u306f\u5236\u7d04\u306e\u5024\u3092\u5165\u308c\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u304c\u3001\u305d\u306e\u4e21\u65b9\u3092\u5165\u308c\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42Y55=''{1}'' \u306f\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u3053\u308c\u306b\u5bfe\u3057\u3066 ''{0}'' \u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
42Y56=\u7121\u52b9\u306a joinStrategy ''{0}'' \u304c\u3001\u8868 ''{1}'' \u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ea\u30b9\u30c8\u306b\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002 joinStrategy \u306b\u5bfe\u3057\u3066\u73fe\u5728\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306f\u3001''hash''\u3001''nestedloop'' \u3067\u3059\u3002
42Y58=\u30aa\u30d7\u30c6\u30a3\u30de\u30a4\u30b6\u30fc\u30fb\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9 ''{1}'' \u306e\u5024 ''{0}'' \u3092\u5909\u63db\u4e2d\u3001NumberFormatException \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
42Y59=hashInitialCapacity \u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u5024 ''{0}'' \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002 \u5024\u306f > 0 \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42Y60=hashLoadFactor \u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u5024 ''{0}'' \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002 \u5024\u306f\u3001> 0.0 \u306a\u304a\u304b\u3064 <= 1.0 \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42Y61=hashMaxCapacity \u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u5024 ''{0}'' \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002 \u5024\u306f > 0 \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42Y62=''{1}'' \u306f\u30d3\u30e5\u30fc\u306e\u305f\u3081\u3001\u3053\u308c\u306b\u5bfe\u3059\u308b ''{0}'' \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Y63=\u30cf\u30c3\u30b7\u30e5\u7d50\u5408\u306b\u306f\u3001\u9078\u629e\u3055\u308c\u305f\u7d22\u5f15\u307e\u305f\u306f\u30d2\u30fc\u30d7\u5185\u306e\u5217\u306b\u6700\u9069\u5316\u53ef\u80fd\u306a\u7b49\u4fa1\u7d50\u5408\u8ff0\u90e8\u304c\u5fc5\u8981\u3067\u3059\u3002  \u8868\u307e\u305f\u306f\u7d22\u5f15 ''{0}'' \u5185\u306e\u3069\u306e\u5217\u306b\u3082\u3001\u6700\u9069\u5316\u53ef\u80fd\u306a\u7b49\u4fa1\u7d50\u5408\u8ff0\u90e8\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002 ''index'' \u30aa\u30d7\u30c6\u30a3\u30de\u30a4\u30b6\u30fc\u30fb\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3092\u4f7f\u3063\u3066\u3001\u8868 ''{1}'' \u306b\u305d\u306e\u3088\u3046\u306a\u7d22\u5f15\u307e\u305f\u306f\u30d2\u30fc\u30d7\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
42Y64=bulkFetch \u5024 ''{0}'' \u306f\u7121\u52b9\u3067\u3059\u3002bulkFetch \u306e\u6700\u5c0f\u5024\u306f 1 \u3067\u3059\u3002
42Y65=bulkFetch \u306f\u3001''{0}'' \u7d50\u5408\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Y66=bulkFetch \u306f\u66f4\u65b0\u53ef\u80fd\u306a\u30ab\u30fc\u30bd\u30eb\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Y67=\u30b9\u30ad\u30fc\u30de ''{0}'' \u306f\u30c9\u30ed\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
42Y69=\u3053\u306e\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306b\u5bfe\u3059\u308b\u6709\u52b9\u306a\u5b9f\u884c\u30d7\u30e9\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u3053\u306e\u539f\u56e0\u3068\u3057\u3066\u6b21\u306e 2 \u3064\u306e\u3046\u3061\u306e 1 \u3064\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002\u30cf\u30c3\u30b7\u30e5\u7d50\u5408\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u306a\u3044\u3068\u304d\u306b\u30cf\u30c3\u30b7\u30e5\u7d50\u5408\u30b9\u30c8\u30e9\u30c6\u30b8\u30fc\u3092\u6307\u5b9a\u3057\u305f (\u6700\u9069\u5316\u53ef\u80fd\u306a\u7b49\u4fa1\u7d50\u5408\u304c\u306a\u3044)\u3002\u307e\u305f\u306f\u3001\u305d\u308c\u305e\u308c\u304c\u304a\u4e92\u3044\u3092\u53c2\u7167\u3057\u3066\u3044\u308b\u305f\u3081\u306b\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u8a55\u4fa1\u3059\u308b\u3053\u3068\u306e\u3067\u304d\u306a\u3044\u30012 \u3064\u306e ExternalVirtualTables \u3092\u7d50\u5408\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308b\u3002
42Y70=\u30e6\u30fc\u30b6\u30fc\u304c\u6307\u5b9a\u3057\u305f\u7d50\u5408\u9806\u5e8f\u306f\u3001\u6b63\u3057\u3044\u7d50\u5408\u9806\u5e8f\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002 \u3053\u306e\u539f\u56e0\u3068\u3057\u3066\u3001\u5185\u90e8\u8868\u304b\u3089\u306e\u7d50\u5408\u5217\u304c\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068\u3057\u3066\u5916\u90e8\u4eee\u60f3\u8868\u306b\u6e21\u3055\u308c\u305f\u3053\u3068\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002
42Y71=\u30b7\u30b9\u30c6\u30e0\u95a2\u6570\u304a\u3088\u3073\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc ''{0}'' \u3092\u30c9\u30ed\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
42Y82=\u30b7\u30b9\u30c6\u30e0\u751f\u6210\u306e\u4fdd\u7ba1\u3055\u308c\u305f\u6e96\u5099\u6e08\u307f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8 ''{0}'' \u306f\u3001DROP STATEMENT \u3092\u4f7f\u3063\u3066\u30c9\u30ed\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u308c\u306f\u30c8\u30ea\u30ac\u30fc\u306e\u4e00\u90e8\u3067\u3059\u3002
42Y83=\u578b\u306e\u306a\u3044 NULL \u306f\u3001\u96c6\u5408\u4f53 {0} \u306e\u5f15\u304d\u6570\u3068\u3057\u3066\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002  NULL \u3092\u9069\u5207\u306a\u578b\u306b\u30ad\u30e3\u30b9\u30c8\u3057\u3066\u304f\u3060\u3055\u3044\u3002
# NOTE: The parameter to this message is a keyword used as a noun phrase.
# Some possible values are "subquery", "CurrentDate", and "?".
42Y84=''{0}'' \u306f DEFAULT \u5b9a\u7fa9\u306b\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
42Y85=DEFAULT \u30ad\u30fc\u30ef\u30fc\u30c9\u306f\u3001VALUES \u6587\u7bc0\u304c INSERT \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u5185\u306b\u3042\u308b\u3068\u304d\u306b\u305d\u306e VALUES \u6587\u7bc0\u3067\u306e\u307f\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
42Y90=FOR UPDATE \u306f\u3001\u3053\u306e\u578b\u306e\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Y91=USING \u6587\u7bc0\u306f\u3001\u30c8\u30ea\u30ac\u30fc\u30fb\u30a2\u30af\u30b7\u30e7\u30f3\u306e EXECUTE STATEMENT \u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Y92={0} \u30c8\u30ea\u30ac\u30fc\u306f\u3001{1} \u9077\u79fb\u5909\u6570/\u8868\u3057\u304b\u53c2\u7167\u3067\u304d\u307e\u305b\u3093\u3002
42Y93=\u8aa4\u3063\u305f REFERENCING \u6587\u7bc0: \u9077\u79fb\u5909\u6570/\u8868\u306e\u5404\u30bf\u30a4\u30d7\u3054\u3068\u306b 1 \u3064\u306e\u540d\u524d\u3057\u304b\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Y94=AND \u307e\u305f\u306f OR \u304c\u975e\u30d6\u30fc\u30eb\u30fb\u30aa\u30da\u30e9\u30f3\u30c9\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002 AND \u304a\u3088\u3073 OR \u306e\u30aa\u30da\u30e9\u30f3\u30c9\u306f\u3001TRUE\u3001FALSE\u3001\u307e\u305f\u306f UNKNOWN \u306b\u8a55\u4fa1\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42Y95=''{1}'' \u306e\u5de6\u306e\u30aa\u30da\u30e9\u30f3\u30c9\u578b\u3068 ''{2}'' \u306e\u53f3\u306e\u30aa\u30da\u30e9\u30f3\u30c9\u578b\u3092\u6301\u3064 ''{0}'' \u6f14\u7b97\u5b50\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
42Y96.U=UNKNOWN
42Y97=\u7121\u52b9\u306a\u30a8\u30b9\u30b1\u30fc\u30d7\u6587\u5b57\u304c\u3042\u308a\u307e\u3059\u3002\u884c ''{0}''\u3001\u5217 ''{1}''\u3002
42Y98.U="{0}" \u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002\u884c {1}\u3001\u5217 {2}\u3002
42Y99.U=\u5b57\u53e5\u30a8\u30e9\u30fc\u3002\u884c {0}\u3001\u5217 {1}\u3002 \u691c\u51fa: {2}
42Z00.U=Java \u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u307e\u305f\u306f\u30d5\u30a3\u30fc\u30eb\u30c9\u53c2\u7167
# This message is put into message 42X75 when a parameter doesn't have a
# datatype. For example, from the parameterWidening test:
#
# values (java.lang.Integer::toString(?, null));
# ERROR 42X50: No method was found with the signature
# java.lang.Integer.toString(UNTYPED, UNTYPED).  It may be that the method
# exists, but it is not public and/or static, or that the parameter types
# are not method invocation convertible.
42Z01.U=UNTYPED
42Z02=\u3053\u3053\u3067\u306f\u3001\u8907\u6570\u306e DISTINCT \u96c6\u5408\u4f53\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
42Z07=\u96c6\u5408\u4f53\u306f ON \u6587\u7bc0\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Z08=''{0}'' \u306f\u4f7f\u7528\u53ef\u80fd\u306a\u30c8\u30ea\u30ac\u30fc ({1}) \u3092\u6301\u3063\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u308c\u306b\u5bfe\u3059\u308b\u30d0\u30eb\u30af\u633f\u5165\u7f6e\u63db\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
42Z09.U=\u6b21\u306e COLUMN DEFAULT:
#
# The following message is used in error messages where we want to say that
# certain operations on streams are illegal. The word "stream" is not a
# keyword or method name, so it should be translated.
42Z11.U=\u30b9\u30c8\u30ea\u30fc\u30e0

# alter table modify column error messages.
#####
42Z15=\u5217 ''{0}'' \u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u578b\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u5217\u306e\u578b\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
42Z16=\u578b VARCHAR \u306e\u5217\u306e\u307f\u5909\u66f4\u3055\u308c\u305f\u9577\u3055\u3092\u6301\u3064\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
42Z17=\u5217 ''{0}'' \u306b\u7121\u52b9\u306a\u9577\u3055\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002 \u9577\u3055\u306f\u3001\u73fe\u884c\u306e\u5217\u306e\u9577\u3055\u3088\u308a\u3082\u9577\u304f\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42Z18=\u5217 ''{0}'' \u306f\u3001\u5916\u90e8\u30ad\u30fc\u5236\u7d04 ''{1}'' \u306e\u4e00\u90e8\u3067\u3059\u3002 \u3053\u306e\u5217\u306e\u9577\u3055\u3092\u5909\u66f4\u3059\u308b\u306b\u306f\u3001\u307e\u305a\u5236\u7d04\u3092\u30c9\u30ed\u30c3\u30d7\u3057\u3001ALTER TABLE \u3092\u5b9f\u884c\u3057\u3066\u304b\u3089\u3001\u5236\u7d04\u3092\u4f5c\u6210\u3057\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
42Z19=\u5217 ''{0}'' \u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5916\u90e8\u30ad\u30fc\u5236\u7d04 ''{1}'' \u306b\u3088\u3063\u3066\u53c2\u7167\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u3053\u306e\u5217\u306e\u9577\u3055\u3092\u5909\u66f4\u3059\u308b\u306b\u306f\u3001\u307e\u305a\u53c2\u7167\u5236\u7d04\u3092\u30c9\u30ed\u30c3\u30d7\u3057\u3001ALTER TABLE \u3092\u5b9f\u884c\u3057\u3066\u304b\u3089\u3001\u5236\u7d04\u3092\u4f5c\u6210\u3057\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
42Z20=\u5217 ''{0}'' \u3092 NULL \u53ef\u80fd\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002 \u3053\u308c\u306f\u4e3b\u30ad\u30fc\u306e\u4e00\u90e8\u3067\u3042\u308a\u3001NULL \u53ef\u80fd\u306a\u5217\u3092\u6301\u3064\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002

#####
# end of alter table modify constraints.
# identity error message (from 42Z21-42Z29)
#####
42837=\u5217 ''{1}'' \u306b\u6307\u5b9a\u3055\u308c\u305f ALTER TABLE ''{0}'' \u5c5e\u6027\u306f\u3001\u65e2\u5b58\u306e\u5217\u3068\u4e92\u63db\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002
42Z21=\u5217 ''{0}'' \u306e ID \u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u5897\u5206\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002\u5897\u5206\u306f\u975e\u30bc\u30ed\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42Z22=ID \u5217 ''{0}'' \u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u578b\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002ID \u5217\u306b\u6709\u52b9\u306a\u578b\u306f\u3001BIGINT\u3001INT \u304a\u3088\u3073 SMALLINT \u306e\u307f\u3067\u3059\u3002
42Z23=ID \u5217 ''{0}'' \u3092\u5909\u66f4\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
42Z24=\u8868 ''{0}'' \u306e\u5217 ''{1}'' \u306b\u5bfe\u3059\u308b IDENTITY \u5024 \u306b\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
42Z25=INTERNAL ERROR ID \u30ab\u30a6\u30f3\u30bf\u30fc: \u73fe\u884c\u5024 = NULL \u306e\u72b6\u614b\u3067\u3001\u5f15\u304d\u6570\u306a\u3057\u3067\u66f4\u65b0\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
42Z26=ID \u30c7\u30d5\u30a9\u30eb\u30c8\u3092\u6301\u3064\u5217 ''{0}'' \u306f NULL \u53ef\u80fd \u306b\u3067\u304d\u307e\u305b\u3093\u3002
42Z27=NULL \u53ef\u80fd\u5217 ''{0}'' \u3092\u3001ID \u30c7\u30d5\u30a9\u30eb\u30c8\u3092\u6301\u3064\u3088\u3046\u306b\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002

#####
# end of identity error messages.

42Z30.U=\u3053\u306e ResultSet \u306b\u8cbb\u3084\u3055\u308c\u305f\u6642\u9593 =
42Z31.U=\u3053\u306e ResultSet \u306b\u8cbb\u3084\u3055\u308c\u305f\u6642\u9593\u4ee5\u4e0b =
42Z32.U=\u5408\u8a08\u6642\u9593\u306e\u660e\u7d30: 
42Z33.U=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u6642\u9593 (\u30df\u30ea\u79d2) =
42Z34.U=\u30aa\u30fc\u30d7\u30f3\u6642\u9593 (\u30df\u30ea\u79d2) =
42Z35.U=\u6b21\u306e\u6642\u9593 (\u30df\u30ea\u79d2) =
42Z36.U=\u30af\u30ed\u30fc\u30ba\u6642\u9593 (\u30df\u30ea\u79d2) =
42Z37.U=\u306a\u3057
42Z38.U=\u3053\u306e ResultSet \u306f\u30aa\u30fc\u30d7\u30f3\u3055\u308c\u305f\u3053\u3068\u304c\u306a\u3044\u305f\u3081\u3001\u4f4d\u7f6e\u60c5\u5831\u306f\u3042\u308a\u307e\u305b\u3093\u3002
42Z39.U=positioner \u306e\u53d6\u5f97\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u4f8b\u5916 {0} \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
## NOTE: In the following message, {0} will be either >= or >
42Z40.U=\u6700\u521d\u306e {1} \u5217\u3067 {0}\u3002
42Z41.U=\u6b21\u306e\u5217\u4e0a\u306e\u9806\u5e8f\u4ed8\u3051\u3055\u308c\u305f NULL \u30bb\u30de\u30f3\u30c6\u30a3\u30af\u30b9: 
42Z42.U=\u5217 ID
42Z43.U=\u6f14\u7b97\u5b50
42Z44.U=\u9806\u5e8f\u4ed8\u3051\u3055\u308c\u305f NULL
42Z45.U=\u4e0d\u660e\u306a\u623b\u308a\u5024
42Z46.U=\u6bd4\u8f03\u7d50\u679c\u306e\u5426\u5b9a
42Z47.U=\u7167\u4f1a\u30d7\u30e9\u30f3\u3092 String \u3068\u3057\u3066\u53d6\u5f97\u3059\u308b\u3053\u3068\u306f\u3001{0} \u3067\u306f\u73fe\u5728\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
## NOTE: In the following message, {0} and {1} are integer indexes into a 2-d array
42Z48.U=\u5217[{0}][{1}] ID

# matches DB2
42939=\u30b9\u30ad\u30fc\u30de\u540d ''{0}'' \u3067\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002




42Z50=\u5185\u90e8\u30a8\u30e9\u30fc: {0} \u306e\u30b3\u30fc\u30c9\u3092\u751f\u6210\u3067\u304d\u307e\u305b\u3093\u3002
42Z53=\u5185\u90e8\u30a8\u30e9\u30fc: \u30ce\u30fc\u30c9\u9078\u629e {0} \u306b\u5bfe\u3057\u3066\u3069\u306e\u3088\u3046\u306a\u30bf\u30a4\u30d7\u306e Activation \u3092\u751f\u6210\u3059\u308b\u306e\u304b\u4e0d\u660e\u3067\u3059\u3002
42Z54.U=\u3053\u306e\u4f8b\u5916\u306f\u3001\u69cb\u6587\u89e3\u6790\u5f8c\u306b\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u505c\u6b62\u3057\u307e\u3059\u3002\u3053\u308c\u4ee5\u964d\u306e\u51e6\u7406\u306f\u5fc5\u8981\u3042\u308a\u307e\u305b\u3093\u3002
42Z55.U=StopAfterParsing \u30c7\u30d0\u30c3\u30b0\u30fb\u30d5\u30e9\u30b0\u306b\u3088\u308b\u69cb\u6587\u89e3\u6790\u5f8c\u3001\u5b9f\u884c\u304c\u505c\u6b62\u3055\u308c\u307e\u3057\u305f\u3002
42Z56.U=StopAfterBinding \u30c7\u30d0\u30c3\u30b0\u30fb\u30d5\u30e9\u30b0\u306b\u3088\u308b\u30d0\u30a4\u30f3\u30c9\u5f8c\u3001\u5b9f\u884c\u304c\u505c\u6b62\u3055\u308c\u307e\u3057\u305f\u3002
42Z57.U=StopAfterOptimizing \u30c7\u30d0\u30c3\u30b0\u30fb\u30d5\u30e9\u30b0\u306b\u3088\u308b\u6700\u9069\u5316\u5f8c\u3001\u5b9f\u884c\u304c\u505c\u6b62\u3055\u308c\u307e\u3057\u305f\u3002
42Z58.U=StopAfterGenerating \u30c7\u30d0\u30c3\u30b0\u30fb\u30d5\u30e9\u30b0\u306b\u3088\u308b\u751f\u6210\u5f8c\u3001\u5b9f\u884c\u304c\u505c\u6b62\u3055\u308c\u307e\u3057\u305f\u3002

## More RUNTIMESTATISTICS messages
42Z80.U=\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u53ef\u80fd
42Z81.U=\u30b3\u30df\u30c3\u30c8\u3055\u308c\u305f\u8aad\u307f\u53d6\u308a
42Z82.U=\u6392\u4ed6\u7684
42Z83.U=\u77ac\u9593\u5171\u7528
42Z84.U=\u5171\u7528
42Z85.U=\u8868
42Z86.U=\u884c
42Z87.U=\u5171\u7528\u8868
42Z88.U=\u5171\u7528\u884c

# More generic language stuff
42Z90=\u30af\u30e9\u30b9 ''{0}'' \u306f\u3001\u66f4\u65b0\u53ef\u80fd\u306a ResultSet \u3092\u623b\u3057\u307e\u305b\u3093\u3002
42Z91=\u526f\u7167\u4f1a
42Z92=\u53cd\u5fa9\u53ef\u80fd\u8aad\u307f\u53d6\u308a
42Z9A=\u30b3\u30df\u30c3\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u8aad\u307f\u53d6\u308a

# Declare global temporary table language stuff. Does not match DB2, specific to Derby behavior
XCL478.S=\u8981\u6c42\u3055\u308c\u305f\u6a5f\u80fd\u306f\u3001SESSION \u30b9\u30ad\u30fc\u30de\u306e\u8868\u3092\u53c2\u7167\u3067\u304d\u307e\u305b\u3093\u3002
# Declare global temporary table language stuff. Matches DB2
428EK=\u5ba3\u8a00\u6e08\u307f\u30b0\u30ed\u30fc\u30d0\u30eb\u4e00\u6642\u8868\u540d\u306e\u4fee\u98fe\u5b50\u306f\u3001SESSION \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
42995=\u8981\u6c42\u3055\u308c\u305f\u6a5f\u80fd\u306f\u3001\u30b0\u30ed\u30fc\u30d0\u30eb\u4e00\u6642\u8868\u306b\u9069\u7528\u3055\u308c\u307e\u305b\u3093\u3002
42962=long \u5217\u578b\u306e\u5217\u307e\u305f\u306f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{0}'' \u306f\u3001\u5ba3\u8a00\u6e08\u307f\u30b0\u30ed\u30fc\u30d0\u30eb\u4e00\u6642\u8868\u307e\u305f\u306f\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u5b9a\u7fa9\u3067\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002 

## org.apache.derby.impl.sql.execute.rts
43X00.U=\u30a2\u30bf\u30c3\u30c1\u5148
43X01.U=\u526f\u7167\u4f1a\u306e\u958b\u59cb\u756a\u53f7
# NOTE: In this case, the name of the type of ResultSet is "Any". ResultSet
# is the name of an interface, so it should not be translated.
43X02.U=\u4efb\u610f\u306e ResultSet
43X03.U=\u30aa\u30fc\u30d7\u30f3\u306e\u6570
43X04.U=\u8868\u793a\u6e08\u307f\u884c
43X05.U=\u30bd\u30fc\u30b9\u7d50\u679c\u30bb\u30c3\u30c8
43X06.U=\u526f\u7167\u4f1a\u306e\u7d42\u4e86\u756a\u53f7
43X07.U=\u30aa\u30d7\u30c6\u30a3\u30de\u30a4\u30b6\u30fc\u898b\u7a4d\u884c\u6570
43X08.U=\u30aa\u30d7\u30c6\u30a3\u30de\u30a4\u30b6\u30fc\u898b\u7a4d\u30b3\u30b9\u30c8
43X09.U=\u79d2
43X10.U=\u5408\u8a08
43X11.U=\u30ce\u30fc\u30c9
43X12.U={0} \u306f\u3001{1} \u306b\u5bfe\u3057\u3066\u73fe\u5728\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
# NOTE: In this case, the name of the type of ResultSet is "Any". ResultSet
# is the name of an interface, so it should not be translated.
43X13.U=\u6b21\u3092\u4f7f\u3063\u305f\u524a\u9664 ResultSet:
43X14.U=\u8868\u30ed\u30c3\u30af
43X15.U=\u884c\u30ed\u30c3\u30af
43X16.U=\u636e\u3048\u7f6e\u304d
43X17.U=\u524a\u9664\u3055\u308c\u305f\u884c
43X18.U=\u66f4\u65b0\u3055\u308c\u305f\u7d22\u5f15
43X19.U=\u524a\u9664
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X20.U=\u7279\u6b8a\u30b9\u30ab\u30e9\u30fc\u96c6\u5408\u4f53 ResultSet
# NOTE: In this message, "input" is being used as a verb
43X21.U=\u5165\u529b\u3055\u308c\u305f\u884c
43X22.U=\u7279\u6b8a\u30b9\u30ab\u30e9\u30fc\u96c6\u5408\u4f53
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X23.U={1} {2} \u3092\u4f7f\u3063\u305f {0} \u306e\u7279\u6b8a\u30b9\u30ad\u30e3\u30f3 ResultSet
43X24.U=\u5236\u7d04
43X25.U=\u7d22\u5f15
43X26.U={0} \u306e\u7279\u6b8a\u30b9\u30ad\u30e3\u30f3 ResultSet
#NOTE: In this message, {0} will be something like "serializable" or "read
# committed", and {1} will be something like "share" or "exclusive".
43X27.U={1} \u30ed\u30c3\u30af\u3092\u4f7f\u7528\u3057\u305f {0} \u5206\u96e2\u30ec\u30d9\u30eb\u3067
43X28.U=\u30b9\u30ad\u30e3\u30f3\u60c5\u5831
43X29.U=\u7279\u6b8a\u5217\u306f\u5217\u756a\u53f7
43X30.U=\u7279\u6b8a\u5217\u306f\u5217\u756a\u53f7
43X31.U=\u30cf\u30c3\u30b7\u30e5\u8868\u30b5\u30a4\u30ba
43X32.U=\u30d5\u30a3\u30eb\u30bf\u30fc\u3055\u308c\u305f\u884c
43X33.U=\u6b21\u306e\u6642\u9593 (\u30df\u30ea\u79d2/\u884c)
43X34.U=\u958b\u59cb\u4f4d\u7f6e
43X35.U=\u505c\u6b62\u4f4d\u7f6e
43X36.U=\u30b9\u30ad\u30e3\u30f3\u4fee\u98fe\u5b50
#NOTE: The message means the set of qualifiers that filter rows returned
# by the "next" operation, not the set of qualifiers that come next.
43X37.U=\u6b21\u306e\u4fee\u98fe\u5b50
#NOTE: In this message, {0} is a table name and {1} is an index name
43X38.U={1} \u3092\u4f7f\u7528\u3057\u3066 {0} \u4e0a\u3067
43X39.U=\u7279\u6b8a\u30b9\u30ad\u30e3\u30f3
43X40.U=\u30bd\u30fc\u30c8\u60c5\u5831
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X41.U=\u30b0\u30eb\u30fc\u30d7\u5316\u3055\u308c\u305f\u96c6\u5408\u4f53 ResultSet
43X42.U=\u7279\u6b8a\u96c6\u5408\u4f53\u3092\u6301\u3064
43X43.U=\u30bd\u30fc\u30c8\u9806
43X44.U=\u30b0\u30eb\u30fc\u30d7\u5316\u3055\u308c\u305f\u96c6\u5408\u4f53
43X45.U=Hash Exists Join
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X46.U=Hash Exists Join ResultSet
43X47.U=\u30cf\u30c3\u30b7\u30e5\u7d50\u5408
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X48.U=\u30cf\u30c3\u30b7\u30e5\u7d50\u5408 ResultSet
43X49.U=\u30cf\u30c3\u30b7\u30e5\u5de6\u5916\u90e8\u7d50\u5408
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X50.U=\u30cf\u30c3\u30b7\u30e5\u5de6\u5916\u90e8\u7d50\u5408 ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {1} is either "constraint" or "index", {0} is a table name, and {2} is a
# constraint or index name.
43X51.U={1} {2} \u3092\u4f7f\u3063\u305f {0} \u306e\u30cf\u30c3\u30b7\u30e5\u30fb\u30b9\u30ad\u30e3\u30f3 ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X52.U={0} \u306e\u30cf\u30c3\u30b7\u30e5\u30fb\u30b9\u30ad\u30e3\u30f3 ResultSet
43X53.U=\u30cf\u30c3\u30b7\u30e5\u30fb\u30ad\u30fc\u306f\u5217\u756a\u53f7\u3067\u3059
43X54.U=\u30cf\u30c3\u30b7\u30e5\u30fb\u30ad\u30fc\u306f\u5217\u756a\u53f7\u3067\u3059
43X55.U=\u30cf\u30c3\u30b7\u30e5\u30fb\u30b9\u30ad\u30e3\u30f3
43X56.U=\u30a2\u30bf\u30c3\u30c1\u3055\u308c\u305f\u526f\u7167\u4f1a
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X57.U=\u30cf\u30c3\u30b7\u30e5\u8868 ResultSet
43X58.U=\u30cf\u30c3\u30b7\u30e5\u8868
43X59.U=\u3059\u3079\u3066
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43X60.U={0} \u306e\u57fa\u672c\u884c\u306b\u5bfe\u3059\u308b\u7d22\u5f15\u884c ResultSet
43X61.U=\u30d2\u30fc\u30d7\u304b\u3089\u30a2\u30af\u30bb\u30b9\u3055\u308c\u308b\u5217
#NOTE: {0} is a table name
43X62.U={0} \u306e\u305f\u3081\u306e
43X63.U=\u57fa\u672c\u884c\u306b\u5bfe\u3059\u308b\u7d22\u5f15\u884c
43X64.U=\u633f\u5165\u30e2\u30fc\u30c9: \u30d0\u30eb\u30af\u633f\u5165
43X65.U=\u633f\u5165\u30e2\u30fc\u30c9: \u901a\u5e38 (\u7a7a\u3067\u306a\u3044\u8868\u306e\u305f\u3081\u3001\u30d0\u30eb\u30af\u633f\u5165\u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093)
43X66.U=\u633f\u5165\u30e2\u30fc\u30c9: \u901a\u5e38
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X67.U=\u6b21\u3092\u4f7f\u3063\u305f\u633f\u5165 ResultSet
43X68.U=\u633f\u5165\u3055\u308c\u305f\u884c
43X69.U=\u633f\u5165
43X70.U=\u7d50\u5408
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43X71.U=index {1} \u3092\u4f7f\u7528\u3057\u305f {0} \u306e\u6700\u7d42\u30ad\u30fc\u7d22\u5f15\u30b9\u30ad\u30e3\u30f3 ResultSet
43X72.U=\u30aa\u30d7\u30c6\u30a3\u30de\u30a4\u30b6\u30fc\u306b\u3088\u3063\u3066\u9078\u629e\u3055\u308c\u305f {1} \u30ed\u30c3\u30af\u3092\u4f7f\u7528\u3059\u308b {0} \u5206\u96e2\u30ec\u30d9\u30eb\u3067
43X73.U=\u8868\u30b9\u30ad\u30e3\u30f3
43X74.U=\u7d22\u5f15\u30b9\u30ad\u30e3\u30f3
#NOTE: {0} is a table name or class name
43X75.U={0} \u4e0a
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X76.U=\u30de\u30c6\u30ea\u30a2\u30e9\u30a4\u30ba ResultSet
43X77.U=\u4e00\u6642\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304a\u3088\u3073\u95a2\u9023\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u4f5c\u6210\u6642\u9593 (\u30df\u30ea\u79d2)
43X78.U=\u4e00\u6642\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304a\u3088\u3073\u95a2\u9023\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30fb\u30d5\u30a7\u30c3\u30c1\u6642\u9593 (\u30df\u30ea\u79d2)
43X79.U=\u5de6\u65b9\u304b\u3089\u8868\u793a\u3055\u308c\u305f\u884c
43X80.U=\u53f3\u65b9\u304b\u3089\u8868\u793a\u3055\u308c\u305f\u884c
43X81.U=\u623b\u3055\u308c\u305f\u884c
43X82.U=\u5de6\u65b9\u7d50\u679c\u30bb\u30c3\u30c8
43X83.U=\u53f3\u65b9\u7d50\u679c\u30bb\u30c3\u30c8
43X84.U=Nested Loop Exists Join
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X85.U=Nested Loop Exists Join ResultSet
43X86.U=\u30cd\u30b9\u30c8\u3055\u308c\u305f\u30eb\u30fc\u30d7\u7d50\u5408
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X87.U=\u30cd\u30b9\u30c8\u3055\u308c\u305f\u30eb\u30fc\u30d7\u7d50\u5408 ResultSet
43X88.U=\u7a7a\u306e\u53f3\u306e\u884c\u304c\u623b\u3055\u308c\u307e\u3057\u305f
43X89.U=\u30cd\u30b9\u30c8\u3055\u308c\u305f\u30eb\u30fc\u30d7\u306e\u5de6\u5916\u90e8\u7d50\u5408
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X90.U=\u30cd\u30b9\u30c8\u3055\u308c\u305f\u30eb\u30fc\u30d7\u306e\u5de6\u5916\u90e8\u7d50\u5408 ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X91.U=\u6b63\u898f\u5316 ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X92.U=\u4e00\u56de ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X93.U=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u5236\u7d04 ResultSet
43X94.U=\u5236\u9650
43X95.U=\u5c55\u958b
43X96.U=\u5236\u9650\u6642\u9593 (\u30df\u30ea\u79d2)
43X97.U=\u5c55\u958b\u6642\u9593 (\u30df\u30ea\u79d2)
43X98.U=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u5236\u7d04
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43X99.U=\u884c ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y00.U=\u30b9\u30ab\u30e9\u30fc\u96c6\u5408\u4f53 ResultSet
43Y01.U=\u7d22\u5f15\u30ad\u30fc\u306e\u6700\u9069\u5316
43Y02.U=\u30b9\u30ab\u30e9\u30fc\u96c6\u5408\u4f53
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y03.U=\u30b9\u30af\u30ed\u30fc\u30eb\u30fb\u30bb\u30f3\u30b7\u30c6\u30a3\u30d6\u3067\u306a\u3044 ResultSet
43Y04.U=\u30cf\u30c3\u30b7\u30e5\u8868\u304b\u3089\u306e\u8aad\u307f\u53d6\u308a\u6570
43Y05.U=\u30cf\u30c3\u30b7\u30e5\u8868\u3078\u306e\u66f8\u304d\u8fbc\u307f\u6570
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y06.U=\u30bd\u30fc\u30c8 ResultSet
43Y07.U=\u91cd\u8907\u306e\u9664\u53bb
43Y08.U=\u30bd\u30fc\u30c8
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name, {1} is either "constraint" or "index", {2} is a
# constraint or index name.
43Y09.U={1} {2}\u3092\u4f7f\u7528\u3059\u308b\u3001{0} \u306e\u305f\u3081\u306e\u7d22\u5f15\u30b9\u30ad\u30e3\u30f3 ResultSet
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a table name.
43Y10.U={0} \u306e\u8868\u30b9\u30ad\u30e3\u30f3 ResultSet
43Y11.U=\u5b9f\u969b\u306b\u4f7f\u7528\u3055\u308c\u305f\u30ed\u30c3\u30ad\u30f3\u30b0: \u8868\u30ec\u30d9\u30eb\u30fb\u30ed\u30c3\u30ad\u30f3\u30b0
43Y12.U=\u30d5\u30a7\u30c3\u30c1\u30fb\u30b5\u30a4\u30ba
43Y13.U=\u4fee\u98fe\u5b50
# NOTE: ResultSet is the name of an interface, so it should not be translated.
43Y14.U=\u5171\u7528\u4f53 ResultSet
43Y15.U=\u5171\u7528\u4f53
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is either "table" or "row"
43Y16.U={0} \u30ed\u30c3\u30af\u3092\u4f7f\u7528\u3059\u308b\u66f4\u65b0 ResultSet
43Y17.U=\u66f4\u65b0\u3055\u308c\u305f\u884c
43Y18.U=\u66f4\u65b0
# NOTE: ResultSet is the name of an interface, so it should not be translated.
# {0} is a Java class name.
43Y19.U={0} \u306e\u305f\u3081\u306e VTI ResultSet
43Y20.U=VTI
43Y21.U=\u30de\u30c6\u30ea\u30a2\u30e9\u30a4\u30ba\u526f\u7167\u4f1a
43Y22.U=\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u540d
43Y23.U=\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u30fb\u30c6\u30ad\u30b9\u30c8
# NOTE: This means the amount of time it takes to parse
43Y24.U=\u89e3\u6790\u6642\u9593
# NOTE: This means the amount of time it takes to bind
43Y25.U=\u30d0\u30a4\u30f3\u30c9\u6642\u9593
# NOTE: This means the amount of time it takes to optimize
43Y26.U=\u6700\u9069\u5316\u6642\u9593
# NOTE: This means the amount of time it takes to generate
43Y27.U=\u751f\u6210\u6642\u9593
# NOTE: This means the amount of time it takes to compile
43Y28.U=\u30b3\u30f3\u30d1\u30a4\u30eb\u6642\u9593
# NOTE: This means the amount of time it takes to execute
43Y29.U=\u5b9f\u884c\u6642\u9593
43Y30.U=\u30b3\u30f3\u30d1\u30a4\u30eb\u958b\u59cb\u30bf\u30a4\u30e0\u30fb\u30b9\u30bf\u30f3\u30d7
43Y31.U=\u30b3\u30f3\u30d1\u30a4\u30eb\u7d42\u4e86\u30bf\u30a4\u30e0\u30fb\u30b9\u30bf\u30f3\u30d7
43Y32.U=\u5b9f\u884c\u958b\u59cb\u30bf\u30a4\u30e0\u30fb\u30b9\u30bf\u30f3\u30d7
43Y33.U=\u5b9f\u884c\u7d42\u4e86\u30bf\u30a4\u30e0\u30fb\u30b9\u30bf\u30f3\u30d7
43Y44.U=\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u5b9f\u884c\u30d7\u30e9\u30f3\u30fb\u30c6\u30ad\u30b9\u30c8
43Y45.U=\u5b9f\u884c\u6642\u9593 100%\u3001{0} \u79d2
43Y46.U=\u633f\u5165 VTI ResultSet
43Y47.U=\u524a\u9664 VTI ResultSet
43Y49.U=\u633f\u5165 VTI
43Y50.U=\u524a\u9664 VTI
43Y51.U=\u30ab\u30b9\u30b1\u30fc\u30c9\u7d50\u679c\u30bb\u30c3\u30c8\u306e\u524a\u9664
43Y52.U=\u6b21\u3092\u4f7f\u7528\u3057\u305f\u30ab\u30b9\u30b1\u30fc\u30c9\u7d50\u679c\u30bb\u30c3\u30c8\u306e\u524a\u9664
43Y53.U=\u5f93\u5c5e\u8868\u306b\u5bfe\u3059\u308b\u53c2\u7167\u30a2\u30af\u30b7\u30e7\u30f3
43Y54.U=\u5f93\u5c5e\u8868\u756a\u53f7\u306b\u5bfe\u3059\u308b\u53c2\u7167\u30a2\u30af\u30b7\u30e7\u30f3\u306e\u958b\u59cb
43Y55.U=\u5f93\u5c5e\u8868\u756a\u53f7\u306b\u5bfe\u3059\u308b\u53c2\u7167\u30a2\u30af\u30b7\u30e7\u30f3\u306e\u7d42\u4e86

54004=SELECT \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u304c GROUP BY\u3001ORDER BY \u307e\u305f\u306f\u9078\u629e\u30ea\u30b9\u30c8\u306b\u6301\u3064\u9805\u76ee\u304c\u591a\u3059\u304e\u307e\u3059\u3002
54008=CREATE INDEX \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u304c\u6307\u5b9a\u3059\u308b\u5217\u304c\u591a\u3059\u304e\u307e\u3059 (16 \u304c\u6700\u5927\u3067\u3059)\u3002
54023=\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u306b\u5bfe\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u6570\u304c\u5236\u9650\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002\u5236\u9650\u306f {0} \u3067\u3001\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc {1} \u306b\u5bfe\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u6570\u306f {2} \u3067\u3059\u3002
54038=\u30cd\u30b9\u30c8\u3055\u308c\u305f\u30c8\u30ea\u30ac\u30fc\u306e\u6df1\u3055\u304c\u6700\u5927\u5024\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002

## all other org.apache.derby.catalog.types
44X00.U=SQL \u578b\u540d
44X05.U=\u6b21\u306e\u30a8\u30e9\u30fc

X0X02.S=\u8868 ''{0}'' \u306f\u3001''{1}'' \u30e2\u30fc\u30c9\u306b\u30ed\u30c3\u30af\u3067\u304d\u307e\u305b\u3093\u3002
X0X03.S=\u7121\u52b9\u306a\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u72b6\u614b\u3067\u3059\u3002\u4fdd\u7559\u30ab\u30fc\u30bd\u30eb\u306b\u306f\u540c\u3058\u5206\u96e2\u30ec\u30d9\u30eb\u304c\u5fc5\u8981\u3067\u3059\u3002
X0X05.S=\u8868 ''{0}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
X0X0E.S=\u81ea\u52d5\u751f\u6210\u5217\u306e\u9078\u629e\u914d\u5217\u306b\u30ea\u30b9\u30c8\u3055\u308c\u305f\u5217\u4f4d\u7f6e ''{0}'' \u304c\u633f\u5165\u8868\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
X0X0F.S=\u81ea\u52d5\u751f\u6210\u5217\u306e\u9078\u629e\u914d\u5217\u306b\u30ea\u30b9\u30c8\u3055\u308c\u305f\u5217\u540d ''{0}'' \u304c\u633f\u5165\u8868\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
X0X07.S=JAR \u30d5\u30a1\u30a4\u30eb ''{0}'' \u306f db2j.database.classpath ''{0}'' \u306b\u3042\u308b\u305f\u3081\u3001\u30c9\u30ed\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
X0X10.S=USING \u6587\u7bc0\u304c\u8907\u6570\u306e\u884c\u3092\u623b\u3057\u307e\u3057\u305f\u304c\u3001\u5358\u4e00\u884c\u306e ResultSet \u306e\u307f\u304c\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
X0X11.S=USING \u6587\u7bc0\u304c\u7d50\u679c\u3092\u623b\u3055\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
X0X13.S=JAR \u30d5\u30a1\u30a4\u30eb ''{0}'' \u306f\u3001\u30b9\u30ad\u30fc\u30de ''{1}'' \u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
X0X57.S=\u578b ''{0}'' \u306e Java \u5024\u3092 SQL \u5024\u306b\u5165\u308c\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u3001\u5bfe\u5fdc\u3059\u308b SQL \u578b\u304c\u3042\u308a\u307e\u305b\u3093\u3002  \u3053\u306e Java \u5024\u306f\u3001\u304a\u305d\u3089\u304f\u30e1\u30bd\u30c3\u30c9\u547c\u3073\u51fa\u3057\u307e\u305f\u306f\u30d5\u30a3\u30fc\u30eb\u30c9\u30fb\u30a2\u30af\u30bb\u30b9\u306e\u7d50\u679c\u3067\u3059\u3002
X0X60.S=''{0}'' \u3068\u3044\u3046\u540d\u524d\u306e\u30ab\u30fc\u30bd\u30eb\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
X0X61.S=\u7d22\u5f15 ''{0}'' \u3068\u8868 ''{1}.{2}'' \u5185\u306e\u5217 ''{4}'' \u306e\u5024\u304c\u3001\u884c\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3 {3} \u3067\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002  \u7d22\u5f15\u306e\u5024\u306f ''{5}'' \u3067\u3059\u304c\u3001\u57fa\u672c\u8868\u306e\u5024\u306f ''{6}'' \u3067\u3059\u3002  \u884c\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u542b\u3080\u3001\u5b8c\u5168\u7d22\u5f15\u30ad\u30fc\u306f ''{7}'' \u3067\u3059\u3002  \u8a02\u6b63\u51e6\u7f6e\u3068\u3057\u3066\u3001\u7d22\u5f15\u306e\u518d\u4f5c\u6210\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
X0X62.S=\u8868 ''{0}'' \u3068\u7d22\u5f15 ''{1}'' \u306e\u9593\u3067\u77db\u76fe\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002  \u8868\u304b\u3089\u884c\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3 ''{2}'' \u3092\u691c\u7d22\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002  \u884c\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u542b\u3080\u3001\u5b8c\u5168\u7d22\u5f15\u30ad\u30fc\u306f ''{3}'' \u3067\u3059\u3002 \u8a02\u6b63\u51e6\u7f6e\u3068\u3057\u3066\u3001\u7d22\u5f15\u306e\u518d\u4f5c\u6210\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
X0X63.S=IOException ''{0}'' \u3092\u53d7\u3051\u53d6\u308a\u307e\u3057\u305f\u3002
X0X67.S=\u578b ''{0}'' \u306e\u5217\u304c CREATE INDEX\u3001ORDER BY\u3001GROUP BY\u3001UNION\u3001\u307e\u305f\u306f DISTINCT \u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u578b\u3067\u306f\u3001\u6bd4\u8f03\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
X0X81.S={0} ''{1}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
X0X85.S=\u7d22\u5f15 ''{0}'' \u304c\u4f5c\u6210\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002''{1}'' \u306f\u6709\u52b9\u306a\u7d22\u5f15\u578b\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
X0X86.S=0 \u306f\u3001ResultSet.absolute(int row) \u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u3059\u3002
X0X87.S=\u30ab\u30fc\u30bd\u30eb\u304c\u884c\u306b\u4f4d\u7f6e\u4ed8\u3051\u3089\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001ResultSet.relative(int row) \u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
X0X95.S=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 ''{1}'' \u306b\u5bfe\u3057\u3066\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 ''{0}'' \u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u305d\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u306f\u30aa\u30fc\u30d7\u30f3\u306e ResultSet \u5f93\u5c5e\u304c\u3042\u308a\u307e\u3059\u3002
X0X99.S=\u7d22\u5f15 ''{0}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
X0Y16.S=''{0}'' \u306f\u30d3\u30e5\u30fc\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002  \u8868\u306e\u5834\u5408\u306f\u3001\u4ee3\u308f\u308a\u306b DROP TABLE \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
X0Y23.S=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 ''{1}'' \u306b\u5bfe\u3057\u3066\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 ''{0}'' \u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002VIEW ''{2}'' \u304c\u305d\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5f93\u5c5e\u3057\u3066\u3044\u307e\u3059\u3002
X0Y24.S=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 ''{1}'' \u306b\u5bfe\u3057\u3066\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 ''{0}'' \u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002STATEMENT ''{2}'' \u304c\u305d\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5f93\u5c5e\u3057\u3066\u3044\u307e\u3059\u3002
X0Y25.S=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 ''{1}'' \u306b\u5bfe\u3057\u3066\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 ''{0}'' \u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002{2} ''{3}'' \u304c\u305d\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5f93\u5c5e\u3057\u3066\u3044\u307e\u3059\u3002
X0Y26.S=\u7d22\u5f15 ''{0}'' \u306f\u3001\u8868 ''{1}'' \u3068\u540c\u3058\u30b9\u30ad\u30fc\u30de\u306b\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
X0Y28.S=\u7d22\u5f15 ''{0}'' \u3092\u3001\u30b7\u30b9\u30c6\u30e0\u8868 ''{1}'' \u4e0a\u306b\u4f5c\u6210\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002  \u30e6\u30fc\u30b6\u30fc\u304c\u30b7\u30b9\u30c6\u30e0\u8868\u4e0a\u306b\u7d22\u5f15\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
# column c already exists in table t.
X0Y32.S={0} ''{1}'' \u306f\u3059\u3067\u306b {2} ''{3}'' \u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
X0Y38.S=\u7d22\u5f15 ''{0}'' \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002\u8868 ''{1}'' \u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
X0Y41.S=\u5236\u7d04 ''{0}'' \u306f\u7121\u52b9\u3067\u3059: \u53c2\u7167\u8868 {1} \u306f\u4e3b\u30ad\u30fc\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u3002  \u4e3b\u30ad\u30fc\u3092 {1} \u306b\u8ffd\u52a0\u3059\u308b\u304b\u3001\u3053\u306e\u5916\u90e8\u30ad\u30fc\u304c\u53c2\u7167\u3059\u308b\u30e6\u30cb\u30fc\u30af\u5236\u7d04\u306e\u5217\u3092\u660e\u793a\u7684\u306b\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
X0Y42.S=\u5236\u7d04 ''{0}'' \u306f\u7121\u52b9\u3067\u3059: \u5916\u90e8\u30ad\u30fc\u5217\u306e\u578b\u304c\u53c2\u7167\u5217\u306e\u578b\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
X0Y43.S=\u5236\u7d04 ''{0}'' \u306f\u7121\u52b9\u3067\u3059: {0} ({1}) \u306e\u5217\u6570\u304c\u53c2\u7167\u30ad\u30fc ({2}) \u306e\u5217\u6570\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
X0Y44.S=\u5236\u7d04 ''{0}'' \u306f\u7121\u52b9\u3067\u3059: \u8868 ''{1}'' \u306b\u3001\u5916\u90e8\u30ad\u30fc\u306e\u5217\u306e\u6570\u304a\u3088\u3073\u578b\u3068\u4e00\u81f4\u3059\u308b\u30e6\u30cb\u30fc\u30af\u307e\u305f\u306f\u4e3b\u30ad\u30fc\u5236\u7d04\u304c\u3042\u308a\u307e\u305b\u3093\u3002
X0Y45.S=1 \u3064\u4ee5\u4e0a\u306e\u5916\u90e8\u30ad\u30fc\u304c\u4e00\u81f4\u3059\u308b\u53c2\u7167\u30ad\u30fc\u3092\u6301\u3063\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u5916\u90e8\u30ad\u30fc\u5236\u7d04 ''{0}'' \u3092\u8868 {1} \u306b\u8ffd\u52a0\u3057\u305f\u308a\u3001\u305d\u3053\u3067\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
X0Y46.S=\u5236\u7d04 ''{0}'' \u306f\u7121\u52b9\u3067\u3059: \u53c2\u7167\u8868 {1} \u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
X0Y54.S=\u30b9\u30ad\u30fc\u30de ''{0}'' \u306f\u7a7a\u3067\u306a\u3044\u305f\u3081\u3001\u30c9\u30ed\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
X0Y55.S=\u57fa\u672c\u8868\u306e\u884c\u6570\u304c\u3001\u8868\u4e0a\u306e\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u7d22\u5f15\u306e\u884c\u6570\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002 \u8868 ''{1}.{2}'' \u4e0a\u306e\u7d22\u5f15 ''{0}'' \u306f {3} \u884c\u3067\u3059\u304c\u3001\u57fa\u672c\u8868\u306f {4} \u884c\u3067\u3059\u3002  \u8a02\u6b63\u51e6\u7f6e\u3068\u3057\u3066\u3001\u7d22\u5f15\u306e\u518d\u4f5c\u6210\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
X0Y56.S=''{0}'' \u306f\u3001\u30b7\u30b9\u30c6\u30e0\u8868 ''{1}'' \u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
X0Y57.S=NULL \u53ef\u80fd\u3067\u306a\u3044\u5217\u3092\u8868 ''{0}'' \u306b\u8ffd\u52a0\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u8868\u306b\u306f\u5c11\u306a\u304f\u3068\u3082 1 \u884c\u304c\u5165\u3063\u3066\u3044\u307e\u3059\u3002  NULL \u53ef\u80fd\u3067\u306a\u3044\u5217\u306f\u3001\u7a7a\u306e\u8868\u306b\u3057\u304b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
X0Y58.S=\u4e3b\u30ad\u30fc\u5236\u7d04\u3092\u8868 ''{0}'' \u306b\u8ffd\u52a0\u3057\u3088\u3046\u3068\u3057\u3066\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u3053\u306e\u8868\u306f\u3059\u3067\u306b\u3053\u306e\u578b\u306e\u5236\u7d04\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002  \u8868\u306f\u30011 \u3064\u306e\u4e3b\u30ad\u30fc\u5236\u7d04\u3057\u304b\u6301\u3064\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
X0Y59.S=\u8868 ''{1}'' \u306b\u5236\u7d04\u3092\u8ffd\u52a0\u3001\u307e\u305f\u306f\u305d\u3053\u3067\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u3088\u3046\u3068\u3057\u3066\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u8868\u5236\u7d04 {2} \u884c\u304c\u6b21\u306e\u30c1\u30a7\u30c3\u30af\u5236\u7d04\u306b\u9055\u53cd\u3057\u3066\u3044\u307e\u3059: {0}\u3002
X0Y63.S=\u30b3\u30de\u30f3\u30c9\u8868 ''{0}'' \u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u4e3b\u30ad\u30fc\u307e\u305f\u306f\u30e6\u30cb\u30fc\u30af\u5236\u7d04/\u7d22\u5f15\u5217\u3067 NULL \u30c7\u30fc\u30bf\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002 \u4e3b\u30ad\u30fc\u307e\u305f\u306f\u30e6\u30cb\u30fc\u30af\u7d22\u5f15\u30ad\u30fc\u5185\u306e\u3059\u3079\u3066\u306e\u5217\u306f\u975e NULL \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
X0Y66.S=\u89aa\u63a5\u7d9a\u306b\u4fdd\u7559\u4e2d\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u304c\u3042\u308b\u3068\u304d\u306f\u3001\u30cd\u30b9\u30c8\u3055\u308c\u305f\u63a5\u7d9a\u3067\u30b3\u30df\u30c3\u30c8\u306f\u767a\u884c\u3067\u304d\u307e\u305b\u3093\u3002
X0Y67.S=\u89aa\u63a5\u7d9a\u306b\u4fdd\u7559\u4e2d\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u304c\u3042\u308b\u3068\u304d\u306f\u3001\u30cd\u30b9\u30c8\u3055\u308c\u305f\u63a5\u7d9a\u3067\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u306f\u767a\u884c\u3067\u304d\u307e\u305b\u3093\u3002
X0Y68.S={0} ''{1}'' \u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
X0Y69.S=\u30c8\u30ea\u30ac\u30fc {0} \u304c {2} \u4e0a\u3067\u30a2\u30af\u30c6\u30a3\u30d6\u306e\u305f\u3081\u3001{1} \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
X0Y70.S=\u30c8\u30ea\u30ac\u30fc {0} \u304c\u30a2\u30af\u30c6\u30a3\u30d6\u306e\u305f\u3081\u3001\u8868 {1} \u3067\u306e INSERT\u3001UPDATE \u304a\u3088\u3073 DELETE \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
X0Y71.S=SET ISOLATION \u306e\u3088\u3046\u306a\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u64cd\u4f5c\u306f\u3001\u30c8\u30ea\u30ac\u30fc {0} \u304c\u30a2\u30af\u30c6\u30a3\u30d6\u306e\u305f\u3081\u3001\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
X0Y72.S=''{0}'' \u306f\u4f7f\u7528\u53ef\u80fd\u306a\u30c8\u30ea\u30ac\u30fc ({1}) \u3092\u6301\u3063\u3066\u3044\u308b\u305f\u3081\u3001\u3053\u308c\u306b\u5bfe\u3059\u308b\u30d0\u30eb\u30af\u633f\u5165\u7f6e\u63db\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
X0Y77.S=\u6697\u9ed9\u7684\u306b\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u30b3\u30df\u30c3\u30c8\u3055\u308c\u308b\u305f\u3081\u3001\u5b9f\u884c\u4e2d\u306e\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u5bfe\u3057\u3066 set transaction isolation \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u767a\u884c\u3067\u304d\u307e\u305b\u3093\u3002 
X0Y78.S=Statement.executeQuery() \u306f\u3001\u884c\u30ab\u30a6\u30f3\u30c8\u3092\u623b\u3059\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u4f7f\u3063\u3066\u547c\u3073\u51fa\u305b\u307e\u305b\u3093\u3002
X0Y79.S=Statement.executeUpdate() \u306f\u3001ResultSet \u3092\u623b\u3059\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u4f7f\u3063\u3066\u547c\u3073\u51fa\u305b\u307e\u305b\u3093\u3002
X0Y80.S=ALTER \u8868''{0}'' \u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u5217 ''{1}'' \u3067 NULL \u30c7\u30fc\u30bf\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
X0Y83.S=\u8b66\u544a: \u8868\u304b\u3089\u884c\u3092\u524a\u9664\u3057\u3066\u3044\u308b\u9593\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304a\u3088\u3073\u95a2\u9023\u30d7\u30ed\u30b8\u30a7\u30af\u30c8 ID {1} \u306e\u7d22\u5f15\u3067\u3001\u57fa\u672c\u8868\u884c {0} \u306e\u7d22\u5f15\u884c\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u3053\u306e\u554f\u984c\u306f\u3001\u524a\u9664\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u4e00\u90e8\u3068\u3057\u3066\u81ea\u52d5\u7684\u306b\u8a02\u6b63\u3055\u308c\u307e\u3057\u305f\u3002
XCL01.S=\u7d50\u679c\u30bb\u30c3\u30c8\u304c\u884c\u3092\u623b\u3057\u307e\u305b\u3093\u3002\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 {0} \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XCL05.S=Activation \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 {0} \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XCL07.S=\u30ab\u30fc\u30bd\u30eb ''{0}'' \u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u81ea\u52d5\u30b3\u30df\u30c3\u30c8\u304c\u30aa\u30d5\u306b\u306a\u3063\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XCL08.S=\u30ab\u30fc\u30bd\u30eb ''{0}'' \u304c\u884c\u306e\u4e0a\u306b\u3042\u308a\u307e\u305b\u3093\u3002
XCL09.S=Activation \u304c PreparedStatement \u306b\u4e00\u81f4\u3057\u306a\u3044 ''{0}'' \u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
XCL10.S=PreparedStatement \u304c\u518d\u30b3\u30f3\u30d1\u30a4\u30eb\u3055\u308c\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002JDBC \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u518d\u6e96\u5099\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XCL12.S=\u578b ''{0}'' \u306e\u30c7\u30fc\u30bf\u5024\u3092\u578b ''{1}'' \u306e\u30c7\u30fc\u30bf\u5024\u306b\u5165\u308c\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
XCL13.S=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u4f4d\u7f6e ''{0}'' \u306f\u7bc4\u56f2\u5916\u3067\u3059\u3002  \u3053\u306e\u6e96\u5099\u6e08\u307f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u6570\u306f ''{1}'' \u3067\u3059\u3002
XCL15.S=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 ''{0}''\u306b\u5bfe\u3057\u3066 compareTo() \u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u3066\u3044\u308b\u3068\u304d\u306b ClassCastException \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002  compareTo() \u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u30af\u30e9\u30b9 ''{1}'' \u3067\u3059\u3002
XCL16.S=ResultSet \u304c\u30aa\u30fc\u30d7\u30f3\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 ''{0}'' \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002 \u81ea\u52d5\u30b3\u30df\u30c3\u30c8\u304c\u30aa\u30d5\u306b\u306a\u3063\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XCL17.S=\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u3053\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XCL19.S=\u8868 ''{0}'' \u306b\u3001\u30ad\u30fc ''{1}'' \u306b\u5bfe\u3059\u308b\u884c\u304c\u3042\u308a\u307e\u305b\u3093\u3002
XCL20.S=\u30ab\u30bf\u30ed\u30b0\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3\u30fb\u30ec\u30d9\u30eb ''{0}'' \u3092\u3001\u30d0\u30fc\u30b8\u30e7\u30f3\u30fb\u30ec\u30d9\u30eb ''{1}'' \u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XCL21.S=\u5225\u306e\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u6e96\u5099\u3057\u306a\u304c\u3089\u3001\u30c7\u30fc\u30bf\u5b9a\u7fa9\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8 (CREATE\u3001DROP\u3001\u307e\u305f\u306f ALTER) \u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002 \u3053\u308c\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002 \u3053\u308c\u306f\u3001SQL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u5185\u304b\u3089\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b Java \u30af\u30e9\u30b9\u306e\u9759\u7684\u30a4\u30cb\u30b7\u30e3\u30e9\u30a4\u30b6\u30fc\u5185\u304b\u3089\u30c7\u30fc\u30bf\u5b9a\u7fa9\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u5b9f\u884c\u3057\u305f\u5834\u5408\u306b\u8d77\u3053\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
XCL22.S=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc {0} \u306f IN \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u3042\u308b\u305f\u3081\u3001OUT \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3068\u3057\u3066\u767b\u9332\u3067\u304d\u307e\u305b\u3093\u3002
XCL23.S=SQL \u578b\u756a\u53f7 ''{0}'' \u306f\u3001registerOutParameter() \u306b\u3088\u3063\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u305f\u578b\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XCL24.S=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc {0} \u306f\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u3088\u3046\u3067\u3059\u304c\u3001registerOutParameter() \u306b\u3088\u3063\u3066\u305d\u306e\u3088\u3046\u306b\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002  \u3053\u308c\u304c\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u306a\u3044\u5834\u5408\u306f\u3001\u578b {1} \u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XCL25.S=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc {0} \u306f\u578b {1} \u3068\u3057\u3066\u767b\u9332\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u578b {2} \u3092\u30de\u30c3\u30d7\u3057\u3066\u304a\u308a\u3001\u3053\u306e 2 \u3064\u306f\u975e\u4e92\u63db\u3067\u3059\u3002
XCL26.S=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc {0} \u306f\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XCL27.S=\u623b\u308a\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
XCL30.S=InputStream \u304b\u3089 ''{0}'' \u3092\u8aad\u307f\u53d6\u3063\u3066\u3044\u308b\u3068\u304d\u306b\u3001IOException \u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
XCL31.S=\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002

# Delete Rule Restrictions Violation Messages
XCL33.S=\u524a\u9664\u898f\u5247\u306e\u5236\u7d04\u4e8b\u9805\u306e\u305f\u3081\u3001\u8868 {0} \u306b\u5f93\u5c5e\u3059\u308b\u8868\u3068\u3057\u3066\u305d\u306e\u8868\u3092\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002 (\u305d\u306e\u95a2\u4fc2\u306f\u3001\u81ea\u5df1\u53c2\u7167\u306b\u306a\u3063\u3066\u304a\u308a\u3001\u81ea\u5df1\u53c2\u7167\u95a2\u4fc2\u306f SET NULL \u306e\u524a\u9664\u898f\u5247\u306b\u3059\u3067\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002) 
XCL34.S=\u524a\u9664\u898f\u5247\u306e\u5236\u7d04\u4e8b\u9805\u306e\u305f\u3081\u3001\u8868 {0} \u306b\u5f93\u5c5e\u3059\u308b\u8868\u3068\u3057\u3066\u305d\u306e\u8868\u3092\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002 (\u305d\u306e\u95a2\u4fc2\u306b\u3088\u308a\u3001\u8907\u6570\u8868\u306e\u5faa\u74b0\u304c\u69cb\u6210\u3055\u308c\u3001\u7d50\u679c\u3068\u3057\u3066\u305d\u306e\u8868\u306f\u5faa\u74b0\u3068\u9023\u7d50\u524a\u9664\u3055\u308c\u308b\u3082\u306e\u306b\u306a\u308a\u307e\u3059 (\u5faa\u74b0\u306e\u4ed6\u306e\u3059\u3079\u3066\u306e\u524a\u9664\u898f\u5247\u306f\u3001CASCADE \u306b\u306a\u308a\u307e\u3059))\u3002  
XCL35.S=\u524a\u9664\u898f\u5247\u306e\u5236\u7d04\u4e8b\u9805\u306e\u305f\u3081\u3001\u8868 {0} \u306b\u5f93\u5c5e\u3059\u308b\u8868\u3068\u3057\u3066\u305d\u306e\u8868\u3092\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002 (\u305d\u306e\u95a2\u4fc2\u306b\u3088\u308a\u3001\u305d\u306e\u8868\u306f\u8907\u6570\u306e\u95a2\u4fc2\u3092\u4ecb\u3057\u3066\u6307\u5b9a\u306e\u8868\u3068\u9023\u7d50\u524a\u9664\u3055\u308c\u308b\u8868\u306b\u306a\u308a\u3001\u65e2\u5b58\u306e\u95a2\u4fc2\u306e\u524a\u9664\u898f\u5247\u306f SET NULL \u3067\u3059\u3002)\u3002  

XCL36.S=\u5916\u90e8\u30ad\u30fc\u306e\u524a\u9664\u898f\u5247\u306f {0} \u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 (\u53c2\u7167\u5236\u7d04\u306f\u3001\u81ea\u5df1\u53c2\u7167\u306b\u306a\u3063\u3066\u304a\u308a\u3001\u65e2\u5b58\u306e\u81ea\u5df1\u53c2\u7167\u5236\u7d04\u306b\u6307\u5b9a\u306e\u524a\u9664\u898f\u5247\u304c\u3042\u308a\u307e\u3059 (NO ACTION\u3001RESTRICT \u307e\u305f\u306f CASCADE)\u3002) 
XCL37.S=\u5916\u90e8\u30ad\u30fc\u306e\u524a\u9664\u898f\u5247\u306f {0} \u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 (\u53c2\u7167\u5236\u7d04\u306f\u3001\u81ea\u5df1\u53c2\u7167\u306b\u306a\u3063\u3066\u304a\u308a\u3001\u305d\u306e\u8868\u306f CASCADE \u306e\u524a\u9664\u898f\u5247\u3068\u306e\u95a2\u4fc2\u306b\u4f9d\u5b58\u3057\u3066\u3044\u307e\u3059\u3002)
XCL38.S=\u5916\u90e8\u30ad\u30fc\u306e\u524a\u9664\u898f\u5247\u306f {0} \u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 (\u305d\u306e\u95a2\u4fc2\u306b\u3088\u308a\u3001\u305d\u306e\u8868\u306f\u3001\u8907\u6570\u306e\u95a2\u4fc2\u3092\u4ecb\u3057\u3066\u540c\u3058\u8868\u3068\u9023\u7d50\u524a\u9664\u3055\u308c\u308b\u8868\u306b\u306a\u308a\u3001\u305d\u306e\u3088\u3046\u306a\u95a2\u4fc2\u306f\u540c\u3058\u524a\u9664\u898f\u5247\u3092\u6301\u3064\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059 (NO ACTION\u3001RESTRICT \u307e\u305f\u306f CASCADE)\u3002) 

XCL39.S=\u5916\u90e8\u30ad\u30fc\u306e\u524a\u9664\u898f\u5247\u306f CASCADE \u306b\u306f\u3067\u304d\u307e\u305b\u3093\u3002 (\u81ea\u5df1\u53c2\u7167\u5236\u7d04\u304c\u3001SET NULL\u3001NO ACTION \u307e\u305f\u306f RESTRICT \u306e\u524a\u9664\u898f\u5247\u306b\u5b58\u5728\u3057\u307e\u3059\u3002) 
XCL40.S=\u5916\u90e8\u30ad\u30fc\u306e\u524a\u9664\u898f\u5247\u306f CASCADE \u306b\u306f\u3067\u304d\u307e\u305b\u3093\u3002 (\u305d\u306e\u95a2\u4fc2\u306b\u3088\u308a\u3001\u5faa\u74b0\u304c\u69cb\u6210\u3055\u308c\u3001\u305d\u306e\u7d50\u679c\u3068\u3057\u3066\u305d\u306e\u8868\u306f\u5faa\u74b0\u3068\u9023\u7d50\u524a\u9664\u3055\u308c\u308b\u3082\u306e\u306b\u306a\u308a\u307e\u3059\u3002 \u305d\u306e\u5faa\u74b0\u306b\u3042\u308b\u65e2\u5b58\u306e\u524a\u9664\u898f\u5247\u306e 1 \u3064\u306f CASCADE \u3067\u306f\u306a\u3044\u306e\u3067\u3001\u524a\u9664\u898f\u5247\u304c CASCADE \u3067\u306a\u3044\u5834\u5408\u306f\u3053\u306e\u95a2\u4fc2\u304c\u5b9a\u7fa9\u53ef\u80fd\u306b\u306a\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002)
XCL41.S=\u5916\u90e8\u30ad\u30fc\u306e\u524a\u9664\u898f\u5247\u306f CASCADE \u306b\u306f\u3067\u304d\u307e\u305b\u3093\u3002 (\u305d\u306e\u95a2\u4fc2\u306b\u3088\u308a\u3001\u5225\u306e\u8868\u304c\u3001\u7570\u306a\u308b\u524a\u9664\u898f\u5247\u3092\u6301\u3064\u8907\u6570\u306e\u30d1\u30b9\u3042\u308b\u3044\u306f\u3001SET NULL \u3068\u7b49\u3057\u3044\u524a\u9664\u898f\u5247\u3092\u6301\u3064\u8907\u6570\u306e\u30d1\u30b9\u3092\u4ecb\u3057\u3066\u540c\u3058\u8868\u3068\u9023\u7d50\u524a\u9664\u3055\u308c\u308b\u3082\u306e\u306b\u306a\u308a\u307e\u3059\u3002) 
XCL42.S="CASCADE"
XCL43.S="SET NULL"
XCL44.S="RESTRICT"
XCL45.S="NO ACTION"
XCL46.S="SET DEFAULT"

XCL47.S=''{0}'' \u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30d0\u30fc\u30b8\u30e7\u30f3 {1} \u304b\u3089\u30d0\u30fc\u30b8\u30e7\u30f3 {2} \u4ee5\u964d\u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

XCL48.S= TRUNCATE TABLE \u306f ''{0}'' \u3067\u306f\u8a31\u3055\u308c\u307e\u305b\u3093\u3002\u3053\u306e\u8868\u306e\u30e6\u30cb\u30fc\u30af/\u4e3b\u30ad\u30fc\u5236\u7d04\u304c\u4ed6\u306e\u8868\u304b\u3089\u306e\u4f7f\u7528\u53ef\u80fd\u306b\u3055\u308c\u305f\u5916\u90e8\u30ad\u30fc\u5236\u7d04\u306b\u3088\u3063\u3066\u53c2\u7167\u3055\u308c\u308b\u304b\u3089\u3067\u3059\u3002 
XCL49.S= TRUNCATE TABLE \u306f\u4f7f\u7528\u53ef\u80fd\u306b\u3055\u308c\u305f DELETE \u30c8\u30ea\u30ac\u30fc ({1}) \u3092\u6301\u3063\u3066\u3044\u308b\u305f\u3081\u3001''{0}'' \u3067\u306f\u8a31\u3055\u308c\u307e\u305b\u3093\u3002
XCL50.S=\u524d\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304b\u3089\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002\u30a2\u30af\u30bb\u30b9\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u30fb\u30ec\u30d9\u30eb\u306f ''{0}'' \u3067\u3001\u3053\u306e\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u30fb\u30ec\u30d9\u30eb\u306f ''{1}'' \u3067\u3059\u3002


# Transaction states, matches DB2
25000=\u7121\u52b9\u306a\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u72b6\u614b\u3067\u3059\u3002

# Authorization
25501=\u30a2\u30af\u30c6\u30a3\u30d6\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u63a5\u7d9a\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
25502=\u8aad\u307f\u53d6\u308a\u5c02\u7528\u63a5\u7d9a\u3001\u30e6\u30fc\u30b6\u30fc\u3001\u307e\u305f\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5bfe\u3059\u308b\u3001SQL \u30c7\u30fc\u30bf\u5909\u66f4\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
25503=\u8aad\u307f\u53d6\u308a\u5c02\u7528\u63a5\u7d9a\u3001\u30e6\u30fc\u30b6\u30fc\u3001\u307e\u305f\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5bfe\u3059\u308b DDL \u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
25505=\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30e6\u30fc\u30b6\u30fc\u307e\u305f\u306f\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30e6\u30fc\u30b6\u30fc\u306f\u3001\u63a5\u7d9a\u306b\u5bfe\u3059\u308b\u8aad\u307f\u53d6\u308a\u5c02\u7528\u30e2\u30fc\u30c9\u3092\u4f7f\u7528\u4e0d\u53ef\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
28501=\u7121\u52b9\u306a\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u8a31\u53ef\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{0}={1}''\u3002
28502.C=\u30e6\u30fc\u30b6\u30fc\u540d ''{0}'' \u306f\u7121\u52b9\u3067\u3059\u3002 
28503=\u30e6\u30fc\u30b6\u30fc ''{0}'' \u3092\u3001\u8aad\u307f\u53d6\u308a\u5c02\u7528\u8a31\u53ef\u30ea\u30b9\u30c8\u3068\u30d5\u30eb\u30fb\u30a2\u30af\u30bb\u30b9\u8a31\u53ef\u30ea\u30b9\u30c8\u306e\u4e21\u65b9\u306b\u5165\u308c\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
28504=\u30a2\u30af\u30bb\u30b9\u30fb\u30ea\u30b9\u30c8 ''{0}'' \u3067\u30e6\u30fc\u30b6\u30fc ''{1}'' \u304c\u7e70\u308a\u8fd4\u3055\u308c\u3066\u3044\u307e\u3059\u3002
04501.C=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u63a5\u7d9a\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002


# Dependency Manager
XD003.S=\u30c7\u30a3\u30b9\u30af\u304b\u3089\u5f93\u5c5e\u95a2\u4fc2\u3092\u30ea\u30b9\u30c8\u30a2\u3067\u304d\u307e\u305b\u3093\u3002 DependableFinder = ''{0}''\u3002 \u8a73\u7d30\u60c5\u5831: ''{1}''\u3002
XD004.S=\u5f93\u5c5e\u95a2\u4fc2\u3092\u4fdd\u7ba1\u3067\u304d\u307e\u305b\u3093\u3002


#../java/com/ibm/db2j/impl/Connectivity/JDBC/Local/messages.properties
24000=\u7121\u52b9\u306a\u30ab\u30fc\u30bd\u30eb\u72b6\u614b - \u73fe\u5728\u884c\u304c\u3042\u308a\u307e\u305b\u3093\u3002

07000=\u73fe\u884c\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

# 07004 : {0} is an number {1) is fixed text OUT or INOUT
07004=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc {0} \u306f {1} \u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u3042\u308a\u3001\u5b9f\u884c\u306e\u524d\u306b CallableStatement.registerOutParameter \u306b\u767b\u9332\u3055\u308c\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

07009=\u5165\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u3042\u308a\u307e\u305b\u3093\u3002

S0022=\u5217 ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
XJ009.S=CallableStatement \u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u30b9\u30c8\u30a2\u30fc\u30c9\u30fb\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u547c\u3073\u51fa\u3057\u304b\u3001\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u4f7f\u7528\u304c\u5fc5\u8981\u3067\u3059\u3002{0}
XJ010.S=autoCommit \u304c\u30aa\u30f3\u306b\u306a\u3063\u3066\u3044\u308b\u3068\u304d\u306b\u306f\u3001savepoint \u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
XJ011.S=\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u540d\u306b NULL \u3092\u6e21\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ012.S=''{0}'' \u306f\u3059\u3067\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XJ013.S=\u540d\u524d\u4ed8\u304d\u306e\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u306b ID \u304c\u3042\u308a\u307e\u305b\u3093\u3002
XJ014.S=\u4e0d\u7279\u5b9a\u306e\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u306b\u540d\u524d\u304c\u3042\u308a\u307e\u305b\u3093\u3002
XJ016.S=\u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306f\u3001\u6e96\u5099\u6e08\u307f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XJ017.S=savepoint \u30b3\u30de\u30f3\u30c9\u306f\u3001\u30c8\u30ea\u30ac\u30fc\u30fb\u30b3\u30fc\u30c9\u5185\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XJ018.S=\u5217\u540d\u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ020.S=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u578b\u304c TYPE ''{0}'' \u306b\u5909\u63db\u53ef\u80fd\u3067\u306a\u3044\u304b\u3001java.sql.Types \u5024\u304c\u7121\u52b9\u3067\u3042\u308b\u304b\u3001\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c NULL \u3067\u3057\u305f\u3002
XJ022.S=\u30b9\u30c8\u30ea\u30fc\u30e0\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093: ''{0}''\u3002
XJ023.S=\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u8981\u6c42\u3055\u308c\u305f\u9577\u3055\u3088\u308a\u3082\u77ed\u3044\u30c7\u30fc\u30bf\u3092\u4fdd\u6301\u3057\u307e\u3057\u305f\u3002
XJ025.S=\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u306f\u8ca0\u306e\u9577\u3055\u3092\u6301\u3064\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ030.S=\u30cd\u30b9\u30c8\u3055\u308c\u305f\u63a5\u7d9a\u3067\u306f\u3001\u81ea\u52d5\u30b3\u30df\u30c3\u30c8\u3092\u30aa\u30f3\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
XJ042.S=''{0}'' \u306f\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{1}'' \u306b\u6709\u52b9\u306a\u5024\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XJ044.S=''{0}'' \u306f\u7121\u52b9\u306a\u76ee\u76db\u308a\u3067\u3059\u3002
XJ045.S=\u7121\u52b9\u3001\u307e\u305f\u306f (\u73fe\u5728) \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u5206\u96e2\u30ec\u30d9\u30eb ''{0}'' \u304c Connection.setTransactionIsolationLevel() \u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002 \u73fe\u5728\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306f\u3001java.sql.Connection.TRANSACTION_SERIALIZABLE\u3001java.sql.Connection.TRANSACTION_REPEATABLE_READ\u3001java.sql.Connection.TRANSACTION_READ_COMMITTED\u3001\u304a\u3088\u3073 java.sql.Connection.TRANSACTION_READ_UNCOMMITTED \u3067\u3059\u3002
XJ04B.S=\u30d0\u30c3\u30c1\u306b\u306f\u3001\u7d50\u679c\u30bb\u30c3\u30c8\u3092\u623b\u305d\u3046\u3068\u3059\u308b\u30b3\u30de\u30f3\u30c9\u3092\u5165\u308c\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ04C.S=CallableStatement \u30d0\u30c3\u30c1\u306b\u306f\u3001\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u5165\u308c\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ056.S=XA \u63a5\u7d9a\u306e\u5834\u5408\u3001AUTOCOMMIT ON \u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
XJ057.S=Connection \u3092\u4f7f\u3063\u3066\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u30b3\u30df\u30c3\u30c8\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30b3\u30df\u30c3\u30c8\u30fb\u30d7\u30ed\u30bb\u30b9\u306f\u3001XAResource \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XJ058.S=Connection \u3092\u4f7f\u3063\u3066\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30b3\u30df\u30c3\u30c8\u30fb\u30d7\u30ed\u30bb\u30b9\u306f\u3001XAResource \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XJ059.S=\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u307e\u3060\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u3068\u304d\u306b\u63a5\u7d9a\u3092\u30af\u30ed\u30fc\u30ba\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ05C.S=\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u4fdd\u7559\u6a5f\u80fd ResultSet.HOLD_CURSORS_OVER_COMMIT \u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
XJ061.S=''{0}'' \u30e1\u30bd\u30c3\u30c9\u306f\u3001\u30b9\u30af\u30ed\u30fc\u30eb\u30fb\u30ab\u30fc\u30bd\u30eb\u3067\u306e\u307f\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
XJ062.S=ResultSet.setFetchSize(int rows) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
XJ063.S=Statement.setMaxRows(int maxRows) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002  \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f >= 0 \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XJ064.S=setFetchDirection(int direction) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
XJ065.S=Statement.setFetchSize(int rows) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
XJ066.S=Statement.setMaxFieldSize(int max) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
XJ067.S=SQL \u30c6\u30ad\u30b9\u30c8\u30fb\u30dd\u30a4\u30f3\u30bf\u30fc\u304c NULL \u3067\u3059\u3002
XJ068.S=\u30d0\u30c3\u30c1\u51e6\u7406\u4e2d\u306b\u306f\u3001executeBatch \u3068 clearBatch \u3057\u304b\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XJ069.S=SetXXX \u30e1\u30bd\u30c3\u30c9\u306f\u3001Execute Statement Using \u306e\u5834\u5408\u306b\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XJ080.S=Execute Statement Using \u304c {1} \u3067\u306f\u306a\u304f {0} \u500b\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6e21\u3057\u307e\u3057\u305f\u3002
XJ070.S=\u8ca0\u307e\u305f\u306f\u30bc\u30ed\u306e\u4f4d\u7f6e\u5f15\u304d\u6570 ''{0}'' \u304c Blob \u307e\u305f\u306f Clob \u30e1\u30bd\u30c3\u30c9\u3067\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
XJ071.S=\u30bc\u30ed\u307e\u305f\u306f\u8ca0\u306e\u9577\u3055\u5f15\u304d\u6570 ''{0}'' \u304c Blob \u307e\u305f\u306f Clob \u30e1\u30bd\u30c3\u30c9\u3067\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
XJ072.S=NULL \u30d1\u30bf\u30fc\u30f3\u307e\u305f\u306f searchStr \u304c Blob \u307e\u305f\u306f Clob \u4f4d\u7f6e\u30e1\u30bd\u30c3\u30c9\u3067\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
XJ073.S=\u3053\u306e Blob \u307e\u305f\u306f Clob \u306e\u30c7\u30fc\u30bf\u306f\u6700\u65e9\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002 \u7406\u7531\u3068\u3057\u3066\u306f\u3001\u305d\u306e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u30b3\u30df\u30c3\u30c8\u3055\u308c\u305f\u3053\u3068\u3001\u307e\u305f\u306f\u305d\u306e\u63a5\u7d9a\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u305f\u3053\u3068\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002
XJ076.S=\u4f4d\u7f6e\u5f15\u304d\u6570 ''{0}'' \u304c Blob/Clob \u306e\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
XJ077.S=getBytes/getSubString \u3092\u4f7f\u3063\u3066 Blob/Clob \u30d1\u30bf\u30fc\u30f3\u306e\u6700\u521d\u306e\u30d0\u30a4\u30c8/\u6587\u5b57\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u3066\u3001\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
XJ082.U=BLOB/CLOB \u5024\u306f\u3001\u30e1\u30bd\u30c3\u30c9\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u307e\u305f\u306f\u53d7\u4fe1\u5074\u3068\u3057\u3066\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002

0A000.S=\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u306f\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093: {0}\u3002

XJ004.C=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
08004=\u63a5\u7d9a\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f: {0}
A020=\u7121\u52b9\u306a\u8a8d\u8a3c\u3002
08003=\u73fe\u884c\u63a5\u7d9a\u306a\u3057\u3002
XJ028.C=URL ''{0}'' \u306e\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
XJ040.C=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u3092\u59cb\u52d5\u3067\u304d\u307e\u305b\u3093\u3002\u8a73\u3057\u304f\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XJ041.C=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XJ049.C=\u6307\u5b9a\u3055\u308c\u305f\u5c5e\u6027\u306e\u4f5c\u6210\u3067\u7af6\u5408\u304c\u3042\u308a\u307e\u3059\u3002
XJ081.C=\u6307\u5b9a\u3055\u308c\u305f create/restore/recovery \u5c5e\u6027\u306b\u77db\u76fe\u304c\u3042\u308a\u307e\u3059\u3002
XJ05B.C=JDBC \u5c5e\u6027 ''{0}'' \u306f\u7121\u52b9\u306a\u5024 ''{1}'' \u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\u6709\u52b9\u5024\u306f ''{2}'' \u3067\u3059\u3002

XXXXX.C.6=\u901a\u5e38\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30af\u30ed\u30fc\u30ba\u3002

08006.D=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u304c\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3055\u308c\u307e\u3057\u305f\u3002

XJ015.M=Derby \u30b7\u30b9\u30c6\u30e0\u304c\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3055\u308c\u307e\u3057\u305f\u3002

01J01=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u306f\u4f5c\u6210\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u4ee3\u308f\u308a\u306b\u65e2\u5b58\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u63a5\u7d9a\u304c\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u3002
01J02=\u30b9\u30af\u30ed\u30fc\u30eb\u30fb\u30bb\u30f3\u30b7\u30c6\u30a3\u30d6\u30fb\u30ab\u30fc\u30bd\u30eb\u306f\u3001\u73fe\u5728\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
01J03=\u66f4\u65b0\u53ef\u80fd\u306a ResultSet \u306f\u73fe\u5728\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
01J04=\u5217 ''{1}'' \u306e\u30af\u30e9\u30b9 ''{0}'' \u306f\u3001java.io.Serializable \u307e\u305f\u306f java.sql.SQLData \u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4fdd\u7ba1\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u3053\u308c\u3089\u306e\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u306e\u3046\u3061\u306e 1 \u3064\u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
01J05=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u304c\u6210\u529f\u3057\u307e\u3057\u305f\u3002 \u4eca\u304b\u3089\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3055\u308c\u305f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002 \u4fdd\u7ba1\u3055\u308c\u305f\u6e96\u5099\u6e08\u307f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u518d\u59a5\u5f53\u6027\u691c\u67fb\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002

XJ001.U=Java \u4f8b\u5916: ''{1}: {0}''\u3002
XJ050.U=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u3001\u30d0\u30fc\u30b8\u30e7\u30f3 {0} \u304b\u3089\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30d0\u30fc\u30b8\u30e7\u30f3 {1} \u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3067\u304d\u308b\u3088\u3046\u306b\u3001JDBC \u63a5\u7d9a URL \u306b\u5c5e\u6027 ''upgrade=true'' \u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002


# org.apache.derby.database.UserUtility
#
XCZ00.S=\u4e0d\u660e\u306a\u8a31\u53ef ''{0}''\u3002
XCZ01.S=\u4e0d\u660e\u306a\u30e6\u30fc\u30b6\u30fc ''{0}''\u3002
XCZ02.S=\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{0}''=''{1}''\u3002

# SQL J Jar support
46001=URL ''{0}'' \u3092\u4f7f\u3063\u3066 JAR \u30d5\u30a1\u30a4\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

###############################################################################
#
# Text for non-exception strings
#
###############################################################################

# Log
L001=------------  \u30a8\u30e9\u30fc\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u958b\u59cb -------------\n
L002=------------  \u30a8\u30e9\u30fc\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u7d42\u308f\u308a -------------\n
L003=\n------------  \u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u30fb\u30a8\u30e9\u30fc\u30fb\u30b9\u30bf\u30c3\u30af\u306e\u958b\u59cb -------------\n
L004=\n------------  \u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u30fb\u30a8\u30e9\u30fc\u30fb\u30b9\u30bf\u30c3\u30af\u306e\u7d42\u308f\u308a -------------\n
L005=\n ------------  \u30a8\u30e9\u30fc\u30fb\u30b9\u30bf\u30c3\u30af\u306e\u958b\u59cb -------------\n
L006=\n ------------  \u30a8\u30e9\u30fc\u30fb\u30b9\u30bf\u30c3\u30af\u306e\u7d42\u308f\u308a -------------\n
L007=\u8b66\u544a: \u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u65b0\u898f\u30ed\u30b0\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002 \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u4e0d\u6574\u5408\u306e\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
L008=\u975e\u4e92\u63db\u306e\u53e4\u3044\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {0} \u3092\u524a\u9664\u3057\u307e\u3059
L009=\u53e4\u3044\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {0} \u3092\u524a\u9664\u3057\u307e\u3059
L010=\u4f4d\u7f6e {1} \u304b\u3089 {2} \u306e EOF \u307e\u3067\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u6d88\u53bb\u3057\u3066\u3044\u308b\u3068\u304d\u306b\u3001\u30d5\u30a1\u30a4\u30eb {0} \u3067\u4e0d\u5b8c\u5168\u306a\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
L011=\u30c1\u30a7\u30c3\u30af\u30dd\u30a4\u30f3\u30c8\u30fb\u30c7\u30fc\u30e2\u30f3\u304c\u6a19\u6e96\u4f8b\u5916\u3092\u30ad\u30e3\u30c3\u30c1\u3057\u307e\u3057\u305f\u3002
L012=\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u306f\u6700\u521d\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u304c\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u8868\u306b\u3042\u308a\u307e\u305b\u3093: {0}
L013=\u30ed\u30b0\u30fb\u30ec\u30b3\u30fc\u30c9\u306f\u6700\u521d\u3067\u3059\u304c\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306f\u3059\u3067\u306b\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u8868\u306b\u3042\u308a\u307e\u3059: {0}
L014=\u8aa4\u3063\u305f\u958b\u59cb\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9
L015=\u65b0\u898f\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u3066\u304a\u308a\u3001\u524a\u9664\u3067\u304d\u307e\u305b\u3093 {0}
L016=\u65b0\u898f\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {0} \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
L017={1} \u304c\u539f\u56e0\u3067\u3001\u65b0\u898f\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {0} \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
L018=\u30b7\u30b9\u30c6\u30e0\u306f\u4e0d\u6574\u5408\u306a\u72b6\u614b\u306b\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30d5\u30a1\u30a4\u30eb {0} \u304c\u6b20\u843d\u3057\u3066\u3044\u307e\u3059\u3002

# Class Manager
C000=\u30af\u30e9\u30b9 {0} \u3092\u30d5\u30a1\u30a4\u30eb {1} \u306b\u66f8\u304d\u8fbc\u307f\u307e\u3057\u305f\u3002 \u30b5\u30dd\u30fc\u30c8\u306b\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3068\u6b21\u306e\u4f8b\u5916\u60c5\u5831\u3092\u63d0\u4f9b\u3057\u3066\u304f\u3060\u3055\u3044: {2}
C001=\u30af\u30e9\u30b9 {0} \u306f JAR {1} \u306b\u4e0d\u660e\u306e\u8a3c\u660e\u66f8\u30bf\u30a4\u30d7\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002X509 \u8a3c\u660e\u66f8\u304c\u4e88\u671f\u3055\u308c\u3066\u3044\u307e\u3059\u3002
C002=JAR {1} \u306e\u30af\u30e9\u30b9 {0} \u306b\u30a2\u30af\u30bb\u30b9\u4e2d\u306b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f : {2}
C003=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 JAR {0} \u306e\u30ed\u30fc\u30c9\u4e2d\u306b\u4f8b\u5916 - {1}
C004=\u30af\u30e9\u30b9 {0} \u306b\u5bfe\u3059\u308b\u5931\u52b9\u3057\u305f\u30af\u30e9\u30b9\u30fb\u30ed\u30fc\u30c0\u30fc
C005=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30af\u30e9\u30b9\u30fb\u30ed\u30fc\u30c0\u30fc\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f - derby.database.classpath=''{0}''
C006=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 JAR {1} \u304b\u3089 {0} \u3092\u30ed\u30fc\u30c9\u3057\u307e\u3057\u305f
C007=JAR {1} \u304b\u3089\u30af\u30e9\u30b9 {0} \u3092\u30ed\u30fc\u30c9\u4e2d\u306b\u4f8b\u5916  - {2}

# RawStore Data

D001=:\n Derby \u30d0\u30fc\u30b8\u30e7\u30f3 {0}: \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {1} \u3092\n\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {2} \u4e0a\u3067\u30d6\u30fc\u30c8\u4e2d\n
D002=:\n\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {0} \u306e\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u4e2d
D004={0} \u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f
D005=\u53e4\u3044\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30b3\u30d4\u30fc\u3092 {0} \u304b\u3089 {1} \u306b\u79fb\u52d5\u3057\u307e\u3057\u305f
D006=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092 {0} \u304b\u3089 {1} \u306b\u30b3\u30d4\u30fc\u3057\u307e\u3057\u305f
D007=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ed\u30ae\u30f3\u30b0\u7528\u88c5\u7f6e\u3092\u4f7f\u7528\u3059\u308b\u3088\u3046\u306b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e service.properties \u3092\u7de8\u96c6\u3057\u307e\u3057\u305f
D008=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e service.properties \u306e\u7de8\u96c6\u30a8\u30e9\u30fc\u3002\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u306f\u30a2\u30dc\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f: {0}
D009=\u30ed\u30b0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092 {0} \u304b\u3089 {1} \u306b\u30b3\u30d4\u30fc\u3057\u307e\u3057\u305f
D010=\u30a8\u30e9\u30fc\u306e\u305f\u3081\u3001\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u304c\u30a2\u30dc\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f
D011={0} \u306b\u3042\u308b\u53e4\u3044\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30b3\u30d4\u30fc\u3092\u9664\u53bb\u3057\u307e\u3057\u305f
D012=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002\u30ed\u30b0\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f {0} \u306b\u3042\u308a\u307e\u3059\n

# Connectivity 
J004=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ID
J005=Derby \u306e\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3
J007=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u4f5c\u6210
J008=\u8a73\u7d30\u306a\u3057
J010=\u30c7\u30a3\u30b9\u30af\u4e0a\u3067\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6697\u53f7\u5316
J013=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9
J016=\u6697\u53f7\u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc
J017=\u6697\u53f7\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0
J018=\u6697\u53f7\u9375\u306e\u9577\u3055
J019=\u5916\u90e8\u6697\u53f7\u9375
J020=\u79d8\u5bc6\u6697\u53f7\u9375
J021=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u7528\u306e\u30c6\u30ea\u30c8\u30ea\u30fc
J022=\u30e6\u30fc\u30b6\u30fc\u540d
J023=\u30e6\u30fc\u30b6\u30fc\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9
J025=\u30ed\u30b0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u30fb\u30d1\u30b9
J028=\u30ed\u30fc\u30eb\u30d5\u30a9\u30ef\u30fc\u30c9\u30fb\u30ea\u30ab\u30d0\u30ea\u30fc\u306e\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30d1\u30b9
J100=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30af\u30e9\u30b9 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30af\u30e9\u30b9\u30d1\u30b9\u306b\u306f csnet.jar \u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
J101=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30af\u30e9\u30b9 {0} \u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002 {1} csnet.jar \u30d5\u30a1\u30a4\u30eb\u306e\u6574\u5408\u6027\u3092\u691c\u67fb\u3057\u3066\u304f\u3060\u3055\u3044\u3002
J102=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u59cb\u52d5\u306e\u9593\u306b\u3001\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002 {0}
J103=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002 {0}

# Authentication
A001=\u81f4\u547d\u7684: \u30b7\u30b9\u30c6\u30e0\u306e\u8a8d\u8a3c\u30b5\u30fc\u30d3\u30b9\u304c\u3042\u308a\u307e\u305b\u3093
A002=\u81f4\u547d\u7684: \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u8a8d\u8a3c\u30b5\u30fc\u30d3\u30b9\u304c\u3042\u308a\u307e\u305b\u3093
A011=\u8b66\u544a: {0} \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b LDAP \u30b5\u30fc\u30d0\u30fc/\u30db\u30b9\u30c8\u540d\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002localhost:389 \u3092\u60f3\u5b9a\u3057\u307e\u3059

I015=org.apache.derby.jdbc.EmbeddedDriver \u306f\u3001JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u767b\u9332\u3055\u308c\u3066\u3044\u307e\u305b\u3093
I024=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u5229\u7528\u4e0d\u80fd\u3067\u3059
I025=JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u306f\u5229\u7528\u4e0d\u80fd\u3067\u3059

# Import/Export
XIE01.S=\u63a5\u7d9a\u304c NULL \u3067\u3057\u305f\u3002
XIE03.S=\u505c\u6b62\u533a\u5207\u308a\u6587\u5b57\u306e\u5f8c\u306e\u3001\u5217 {1} \u306e\u884c {0} \u3067\u30c7\u30fc\u30bf\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f
XIE04.S=\u30c7\u30fc\u30bf\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
XIE05.S=\u30c7\u30fc\u30bf\u30fb\u30d5\u30a1\u30a4\u30eb\u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XIE06.S=\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u540d\u304c NULL \u3067\u3057\u305f\u3002
XIE07.S=\u30d5\u30a3\u30fc\u30eb\u30c9\u533a\u5207\u308a\u6587\u5b57\u3068\u30ec\u30b3\u30fc\u30c9\u533a\u5207\u308a\u6587\u5b57\u3092\u304a\u4e92\u3044\u306e\u30b5\u30d6\u30b9\u30c8\u30ea\u30f3\u30b0\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XIE08.S=\u6b21\u306e\u540d\u524d\u306e\u5217\u306f\u3042\u308a\u307e\u305b\u3093: {0}
XIE09.S=\u3053\u306e\u884c\u306e\u5408\u8a08\u5217\u6570: {0}
XIE0B.S=\u8868\u306e\u5217 ''{0}'' \u306e\u578b\u306f {1} \u3067\u3001\u30a4\u30f3\u30dd\u30fc\u30c8/\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u306b\u3088\u3063\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XIE0D.S=\u884c {0} \u306b\u30ec\u30b3\u30fc\u30c9\u533a\u5207\u308a\u6587\u5b57\u304c\u3042\u308a\u307e\u305b\u3093
XIE0E.S=\u884c {0} \u306e\u4e88\u671f\u3057\u306a\u3044\u5834\u6240\u3067 endOfFile \u3092\u8aad\u307f\u53d6\u308a\u307e\u3057\u305f
XIE0I.S=\u30c7\u30fc\u30bf\u3092\u30d5\u30a1\u30a4\u30eb\u306b\u66f8\u304d\u8fbc\u307f\u4e2d\u3001\u5165\u51fa\u529b\u30a8\u30e9\u30fc\u3092\u691c\u51fa\u3057\u307e\u3057\u305f
XIE0J.S=\u533a\u5207\u308a\u6587\u5b57\u304c\u7121\u52b9\u304b\u30011 \u56de\u4ee5\u4e0a\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XIE0K.S=\u30d4\u30ea\u30aa\u30c9\u304c\u6587\u5b57\u30b9\u30c8\u30ea\u30f3\u30b0\u533a\u5207\u308a\u6587\u5b57\u3068\u3057\u3066\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002
XIE0M.S=\u8868 ''{0}'' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002

# Monitor
M001=\n# *****************************************************************************\n# ***          \u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u7de8\u96c6\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002                 ***\n# *** \u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306e\u5185\u5bb9\u3092\u5909\u66f4\u3057\u305f\u5834\u5408\u3001\u30c7\u30fc\u30bf\u304c\u7834\u58ca\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002 ***\n# ********************************************************************




#  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#
#
#  DO NOT TRANSLATE MESSAGES OR TEXT BELOW THIS LINE
#
#
# ----------------------------------------------------------------------------------------------------------


