# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

01001=Une tentative de mise \u00E0 jour ou de suppression d''une ligne d\u00E9j\u00E0 supprim\u00E9e a \u00E9t\u00E9 effectu\u00E9e \: aucune ligne n''a \u00E9t\u00E9 mise \u00E0 jour ou supprim\u00E9e.
01003=Les valeurs null ont \u00E9t\u00E9 \u00E9limin\u00E9es de l''argument d''une fonction de colonne.
01006=Le privil\u00E8ge de l''utilisateur {0} n''a pas \u00E9t\u00E9 r\u00E9voqu\u00E9.
01007=R\u00F4le {0} non r\u00E9voqu\u00E9 de l'ID d'authentification {1}.
01008=AVEC OPTION ADMIN du r\u00F4le {0} non r\u00E9voqu\u00E9 de l'ID d'authentification {1}.
0100E=XX a tent\u00E9 de renvoyer un trop grand nombre d''ensembles de r\u00E9sultats. 
01500=La contrainte {0} sur la table {1} a \u00E9t\u00E9 supprim\u00E9e.
01501=La vue {0} a \u00E9t\u00E9 supprim\u00E9e.
01502=Le d\u00E9clencheur {0} sur la table {1} a \u00E9t\u00E9 supprim\u00E9.
01503=La colonne {0} de la table {1} a \u00E9t\u00E9 modifi\u00E9e par ajout d''une contrainte non nulle.
01504=Le nouvel index est un double d''un index existant \: {0}.
01505=La valeur {0} est peut-\u00EAtre tronqu\u00E9e.
01522=Le synonyme nouvellement d\u00E9fini ''{0}'' a \u00E9t\u00E9 r\u00E9solu en objet ''{1}'' qui n''est pas d\u00E9fini actuellement.
01J01=La base de donn\u00E9es ''{0}'' n''est pas cr\u00E9\u00E9e, la connexion a donc \u00E9t\u00E9 \u00E9tablie avec une base de donn\u00E9es existante.
01J02=Les curseurs sensibles au d\u00E9filement ne sont pas impl\u00E9ment\u00E9s actuellement.
01J04=La classe ''{0}'' de la colonne ''{1}'' n''impl\u00E9mente pas java.io.Serializable ou java.sql.SQLData. Des instances doivent impl\u00E9menter l''une de ces interfaces pour permettre leur enregistrement.
01J05=La mise \u00E0 niveau de la base de donn\u00E9es a abouti. La base de donn\u00E9es mise \u00E0 niveau est d\u00E9sormais pr\u00EAte \u00E0 \u00EAtre utilis\u00E9e. Echec de la revalidation des instructions pr\u00E9par\u00E9es stock\u00E9es. Pour plus de d\u00E9tails sur cet \u00E9chec, reportez-vous \u00E0 l''exception suivante.
01J06=L''\u00E9l\u00E9ment ResultSet ne peut pas \u00EAtre mis \u00E0 jour. La requ\u00EAte n''est pas qualifi\u00E9e pour g\u00E9n\u00E9rer un \u00E9l\u00E9ment ResultSet pouvant \u00EAtre mis \u00E0 jour.
01J07=L''objet ResultSetHoldability est limit\u00E9 \u00E0 ResultSet.CLOSE_CURSORS_AT_COMMIT dans le cadre d''une transaction globale.
01J08=Impossible d''ouvrir le ResultSet de type {0}. Le ResultSet de type {1} a \u00E9t\u00E9 ouvert.
01J10=Les ensembles de r\u00E9sultats sensibles au d\u00E9filement ne sont pas pris en charge par le serveur ; r\u00E9affectation des touches au curseur permettant uniquement d''avancer
01J12=Impossible d''obtenir un texte de message du serveur. Voir l''exception suivante. La proc\u00E9dure m\u00E9moris\u00E9e SYSIBM.SQLCAMESSAGE n''est pas install\u00E9e sur le serveur. Veuillez contacter votre administrateur de base de donn\u00E9es.
01J13=Le nombre de lignes renvoy\u00E9 ({0}) est trop important pour correspondre \u00E0 un entier ; la valeur renvoy\u00E9e sera tronqu\u00E9e.
01J14=L''autorisation SQL est utilis\u00E9e sans activation pr\u00E9alable de l''authentification.
02000=Aucune ligne n''a \u00E9t\u00E9 trouv\u00E9e pour FETCH, UPDATE ou DELETE ou le r\u00E9sultat d''une requ\u00EAte est une table vide.
07000=Au moins un param\u00E8tre de l''instruction en cours n''est pas initialis\u00E9.
07004=Le param\u00E8tre {0} est un param\u00E8tre de proc\u00E9dure {1} et doit \u00EAtre enregistr\u00E9 avec CallableStatement.registerOutParameter avant son ex\u00E9cution.
07009=Aucun param\u00E8tre d''entr\u00E9e.
08000.S.1=Impossible de fermer une connexion lorsqu''une transaction est active.  La transaction reste ouverte et la connexion n''a pas \u00E9t\u00E9 ferm\u00E9e.
08000=Connexion ferm\u00E9e par une interruption inconnue.
08001.C.10=Aucune connexion n''a pu \u00EAtre \u00E9tablie car le jeton de s\u00E9curit\u00E9 est plus grand que la taille maximale autoris\u00E9e par le protocole r\u00E9seau.
08001.C.11=Aucune connexion n''a pu \u00EAtre \u00E9tablie car l''ID utilisateur a une longueur \u00E9gale \u00E0 z\u00E9ro ou est plus long que le maximum autoris\u00E9 par le protocole r\u00E9seau.
08001.C.12=Aucune connexion n''a pu \u00EAtre \u00E9tablie car le mot de passe a une longueur \u00E9gale \u00E0 z\u00E9ro ou est plus long que le maximum autoris\u00E9 par le protocole r\u00E9seau.
08001.C.1=La propri\u00E9t\u00E9 requise Derby DataSource {0} n''a pas \u00E9t\u00E9 d\u00E9finie.
08001.C.2={0} \: l''erreur lors de la connexion au serveur {1} sur le port {2} a \u00E9mis le message {3}.
08001.C.3=Exception SocketException \: ''{0}''
08001.C.4=Impossible d''ouvrir le flux sur le connecteur ''{0}''.
08001.C.5=La longueur de l''ID utilisateur ({0}) se situe hors de l''intervalle de 1 \u00E0 {1}.
08001.C.6=La longueur du mot de passe ({0}) se situe hors de l''intervalle de 1 \u00E0 {1}.
08001.C.7=L''ID utilisateur ne peut pas \u00EAtre null.
08001.C.8=Le mot de passe ne peut pas \u00EAtre null.
08001.C.9=Aucune connexion n''a pu \u00EAtre \u00E9tablie car le nom de la base de donn\u00E9es ''{0}'' est plus long que la longueur maximale autoris\u00E9e par le protocole r\u00E9seau.
08003.C.1=La m\u00E9thode getConnection() est incorrecte sur un objet PooledConnection ferm\u00E9.
08003.C.2=Appel de m\u00E9thode d''objet LOB apr\u00E8s fermeture de la connexion
08003.C.3=La connexion physique sous-jacente est p\u00E9rim\u00E9e ou ferm\u00E9e.
08003=Aucune connexion en cours.
08004.C.10=Impossible de cr\u00E9er l'autorisation syst\u00E8me pour cr\u00E9er la base de donn\u00E9es ''{0}'' [{1}].
08004.C.11=L'utilisateur ''{0}'' ne dispose pas des droits requis pour cr\u00E9er la base de donn\u00E9es ''{1}'' [{2}].
08004.C.1=Un \u00E9chec d''authentification de la connexion s''est produit.  Motif \: {0}.
08004.C.2=La connexion a \u00E9t\u00E9 refus\u00E9e car la base de donn\u00E9es {0} n''a pas \u00E9t\u00E9 trouv\u00E9e.
08004.C.3=Connexion \u00E0 la base de donn\u00E9es refus\u00E9.
08004.C.4=L''utilisateur ''{0}'' ne peut pas arr\u00EAter la base de donn\u00E9es ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es est habilit\u00E9 \u00E0 effectuer cette op\u00E9ration.
08004.C.5=L''utilisateur ''{0}'' ne peut pas (r\u00E9en)coder la base de donn\u00E9es ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es est habilit\u00E9 \u00E0 effectuer cette op\u00E9ration.
08004.C.6=L''utilisateur ''{0}'' ne peut pas proc\u00E9der \u00E0 une mise \u00E0 niveau mat\u00E9rielle de la base de donn\u00E9es ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es est habilit\u00E9 \u00E0 effectuer cette op\u00E9ration.
08004.C.7=La connexion \u00E0 la base de donn\u00E9es ''{0}'' a \u00E9t\u00E9 refus\u00E9e, car celle-ci est en mode de r\u00E9plication esclave.
08004.C.8=L'utilisateur ''{0}'' ne peut pas \u00E9mettre une op\u00E9ration de r\u00E9plication sur la base de donn\u00E9es  ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es est habilit\u00E9 \u00E0 effectuer cette op\u00E9ration.
08004.C.9=L'utilisateur ''{0}'' ne dispose pas des droits requis pour arr\u00EAter le syst\u00E8me [{1}].
08004=Connexion refus\u00E9e \: {0}
08006.C.1=Une erreur s''est produite au cours de la r\u00E9initialisation de la connexion et la connexion a \u00E9t\u00E9 arr\u00EAt\u00E9e.  Pour plus d''informations, voir les exceptions en cha\u00EEne.
08006.C.2=Exception SocketException \: ''{0}''
08006.C.3=Une erreur de communication a \u00E9t\u00E9 d\u00E9tect\u00E9e \: {0}.
08006.C.4=Une erreur s''est produite au cours d''une r\u00E9initialisation de connexion diff\u00E9r\u00E9e et la connexion a \u00E9t\u00E9 ferm\u00E9e.  Pour plus d''informations, voir les exceptions en cha\u00EEne.
08006.C.5=Donn\u00E9es insuffisantes lors de la lecture depuis le r\u00E9seau \: {0} octets \u00E9taient attendus, mais seulement {1} octets ont \u00E9t\u00E9 re\u00E7us.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
08006.C.6=Tentative de mat\u00E9rialisation totale de donn\u00E9es d''objet LOB trop importantes pour la machine virtuelle Java.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
08006.C=Une erreur de protocole r\u00E9seau s''est produite et la connexion a \u00E9t\u00E9 ferm\u00E9e \: {0}
08006.D=Arr\u00EAt de la base de donn\u00E9es ''{0}''.
0A000.C.6=La commande DRDA {0} n''est pas impl\u00E9ment\u00E9e actuellement.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
0A000.S.1=La m\u00E9thode JDBC n''est pas encore impl\u00E9ment\u00E9e.
0A000.S.2=La m\u00E9thode JDBC {0} n''est pas prise en charge par le serveur. Veuillez mettre le serveur \u00E0 niveau.
0A000.S.3=La propri\u00E9t\u00E9 {0} de l''objet resultSetHoldability n''est pas prise en charge
0A000.S.4=La m\u00E9thode cancel() n''est pas pris en charge par le serveur.
0A000.S.5=Le m\u00E9canisme de s\u00E9curit\u00E9 ''{0}'' n''est pas pris en charge.
0A000.S.7=Le type de donn\u00E9es ''{0}'' n''est pas pris en charge.
0A000.S=Fonction non impl\u00E9ment\u00E9e \: {0}.
0P000.S.1=Sp\u00E9cification de r\u00F4le non valide, r\u00F4le non attribu\u00E9 \u00E0 l'utilisateur actuel ou PUBLIC \: ''{0}''.
0P000=Sp\u00E9cification de r\u00F4le non valide, le r\u00F4le n'existe pas \: ''{0}''.
10000=Une erreur a \u00E9t\u00E9 rencontr\u00E9e lors de l''\u00E9valuation de l''expression de requ\u00EAte XML pour l''op\u00E9rateur {0} \: {1}
21000=Une sous-requ\u00EAte scalaire n''est autoris\u00E9e que pour renvoyer une seule ligne.
22001=$$$Une erreur de troncature a \u00E9t\u00E9 d\u00E9tect\u00E9e lors de la tentative de r\u00E9duction de {0} ''{1}'' \u00E0 une longueur de {2}.
22003.S.1=L''ann\u00E9e ({0}) d\u00E9passe le maximum, d\u00E9fini \u00E0 ''{1}''.
22003.S.2=Les nombres d\u00E9cimaux ne peuvent comporter que 31 d\u00E9cimales maximum.
22003.S.3=Un d\u00E9passement de capacit\u00E9 s''est produit au cours de la conversion du type de donn\u00E9e num\u00E9rique de''{0}'' en {1}.
22003=La valeur r\u00E9sultante se situe hors de la fourchette admise pour le type de donn\u00E9es {0}.
22004.S.4=La longueur ({0}) d\u00E9passe la longueur maximale ({1}) autoris\u00E9e pour le type de donn\u00E9es.
22005.S.1=Conversion d''une valeur de type ''{0}'' en type ''{1}'' impossible \: le codage n''est pas pris en charge.
22005.S.2=Le convertisseur de caract\u00E8res requis n''est pas disponible.
22005.S.3=Une cha\u00EEne unicode ne peut \u00EAtre convertie en cha\u00EEne Ebcdic
22005.S.4=Type de connectivit\u00E9 JDBC non reconnu. Type \: {0}, NombreColonne \: {1}, IndexColonne \: {2}.
22005.S.5=Type de connectivit\u00E9 JDBC incorrect pour le param\u00E8tre {0}.
22005.S.6=Type de langage SQL pour Java {0} non reconnu.
22005=Une tentative d''extraction d''une valeur de donn\u00E9es de type ''{0}'' \u00E0 partir d''une valeur de donn\u00E9es de type ''{1}'' a \u00E9t\u00E9 effectu\u00E9e.
22007.S.180=La repr\u00E9sentation de la cha\u00EEne d''une valeur date/heure se situe hors de la fourchette admise.
22007.S.181=La syntaxe de la repr\u00E9sentation de la cha\u00EEne d''une valeur date/heure n''est pas correcte.
22008.S=''{0}'' est un argument non valide pour la fonction {1}.
2200L=Les valeurs attribu\u00E9es aux colonnes XML doivent \u00EAtre des noeuds de type DOCUMENT syntaxiquement corrects.
2200M=DOCUMENT XML non valide \: {0}
2200V=El\u00E9ment contextuel incorrect pour l''op\u00E9rateur {0} ; les \u00E9l\u00E9ments contextuels doivent \u00EAtre des noeuds de type DOCUMENT syntaxiquement corrects.
2200W=Erreur de s\u00E9rialisation XQuery \: Le programme a tent\u00E9 de s\u00E9rialiser un ou plusieurs noeuds d''attribut de niveau sup\u00E9rieur.
22011=Le deuxi\u00E8me ou troisi\u00E8me argument de la fonction SUBSTR se situe hors de la fourchette admise.
22012=Tentative de division par z\u00E9ro.
22013=Tentative d''extraction de la racine carr\u00E9e d''un nombre n\u00E9gatif, ''{0}''.
22014=La position de d\u00E9but pour LOCATE est incorrecte ; cette valeur doit \u00EAtre un entier positif. L''index \u00E0 partir duquel la recherche doit commencer est ''{2}''.  La cha\u00EEne \u00E0 rechercher est ''{0}''.  La cha\u00EEne dans laquelle effectuer la recherche est ''{1}''. 
22015.S.1=Conversion de donn\u00E9es incorrecte \: la conversion requise entra\u00EEnerait une perte de pr\u00E9cision de {0}
22015=La fonction ''{0}'' n''est pas autoris\u00E9e sur l''ensemble de types suivant.  Le premier op\u00E9rande est de type ''{1}''.  Le deuxi\u00E8me op\u00E9rande est de type ''{2}''.  Le troisi\u00E8me op\u00E9rande (position de d\u00E9but) est de type ''{3}''.
22018=Le format de la cha\u00EEne de caract\u00E8res n''est pas valide pour le type {0}.
22019=S\u00E9quence d''\u00E9chappement non valide, ''{0}''. Cette cha\u00EEne doit comporter un seul caract\u00E8re. Elle ne doit pas avoir la valeur null ni comporter plusieurs caract\u00E8res.
22020=Cha\u00EEne trim ''{0}'' non valide. Elle doit comprendre exactement un caract\u00E8re ou \u00EAtre NULLE. Elle ne doit pas compter plus d''un caract\u00E8re.
22025=Le caract\u00E8re d''\u00E9chappement doit \u00EAtre suivi d''un caract\u00E8re d''\u00E9chappement, ''_'' ou ''%''. Il ne peut \u00EAtre suivi d''aucun autre caract\u00E8re, ni se trouver \u00E0 la fin du masque.
22027=La fonction TRIM() int\u00E9gr\u00E9e ne prend en charge qu''un seul caract\u00E8re d''enl\u00E8vement des espaces de d\u00E9but et de fin.  Les fonctions int\u00E9gr\u00E9es LTRIM() et RTRIM() prennent en charge plusieurs caract\u00E8res d''enl\u00E8vement des espaces de d\u00E9but et de fin.
22028=La cha\u00EEne d\u00E9passe la longueur maximale de {0}.
22501=Une clause ESCAPE ayant pour valeur NULL renvoie des r\u00E9sultats non d\u00E9finis et n''est pas autoris\u00E9e.
23502=La colonne ''{0}'' ne peut pas accepter de valeur NULL.
23503={2} sur la table ''{1}'' a entra\u00EEn\u00E9 la violation de la contrainte de cl\u00E9 externe ''{0}'' pour la cl\u00E9 {3}.  L''instruction a \u00E9t\u00E9 annul\u00E9e.
23505=L''instruction a \u00E9t\u00E9 abandonn\u00E9e parce qu''elle aurait entra\u00EEn\u00E9 la duplication d''une valeur de cl\u00E9 dans une contrainte de cl\u00E9 ou d''index unique identifi\u00E9 par ''{0}'' d\u00E9finie sur ''{1}''.
23513=La contrainte de v\u00E9rification ''{1}'' a \u00E9t\u00E9 viol\u00E9e au cours de l''ex\u00E9cution d''une op\u00E9ration INSERT ou UPDATE sur la table ''{0}''.
24000=Etat du curseur non valide - pas de ligne en cours.
24501.S=Le curseur identifi\u00E9 n''est pas ouvert.
25001.S.1=\u00C9tat de transaction non valide \: transaction SQL active.
25001=Impossible de fermer une connexion tandis qu''une transaction est toujours active.
25501=Impossible de d\u00E9finir la propri\u00E9t\u00E9 en lecture seule de la connexion dans une transaction active.
25502=Une modification des donn\u00E9es SQL n''est pas autoris\u00E9e pour une connexion, un utilisateur ou une base de donn\u00E9es en lecture seule.
25503=Une DDL n''est pas autoris\u00E9e pour une connexion, un utilisateur ou une base de donn\u00E9es en lecture seule.
25505=Un utilisateur en lecture seule ou un utilisateur dans une base de donn\u00E9es en lecture seule n''est pas autoris\u00E9 \u00E0 d\u00E9sactiver le mode lecture seule sur une connexion.
28502=Le nom d''utilisateur ''{0}'' n''est pas valide. 
2D521.S.1=Param\u00E8tre setAutoCommit(true) incorrect au cours de la transaction globale.
2D521.S.2=Op\u00E9ration COMMIT ou ROLLBACK incorrecte pour l''environnement d''ex\u00E9cution de l''application. 
38000=L''exception ''{0}'' a \u00E9t\u00E9 \u00E9mise lors de l''\u00E9valuation d''une expression.
38001=La routine externe n''est pas autoris\u00E9e \u00E0 ex\u00E9cuter des instructions SQL.
38002=La routine a tent\u00E9 de modifier des donn\u00E9es, cependant elle n''a pas \u00E9t\u00E9 d\u00E9finie en ce sens (MODIFIES SQL DATA).
38004=La routine a tent\u00E9 de lire des donn\u00E9es, cependant elle n''a pas \u00E9t\u00E9 d\u00E9finie en ce sens (READS SQL DATA).
39004=Une valeur NULL ne peut pas \u00EAtre transmise \u00E0 une m\u00E9thode qui accepte un param\u00E8tre de type primitif ''{0}''.
3B001.S=Le POINT DE SAUVEGARDE {0} n''existe pas ou n''est pas actif dans la transaction en cours.
3B002.S=Le nombre maximal de points de sauvegarde a \u00E9t\u00E9 atteint. 
3B501.S=Un POINT DE SAUVEGARDE portant le nom transmis existe d\u00E9j\u00E0 dans la transaction en cours.
3B502.S=Une LIBERATION ou ANNULATION JUSQU''AU POINT DE SAUVEGARDE a \u00E9t\u00E9 indiqu\u00E9e mais le point de sauvegarde n''existe pas.
40001=Aucun verrou n''a pu \u00EAtre obtenu \u00E0 cause d''un interblocage ; le cycle de verrous et d''unit\u00E9s en attente est \:\n{0}. L''instruction SQL que le moteur de la base de donn\u00E9es a choisi de supprimer est XID \: {1}.
40XC0=Instruction supprim\u00E9e. Cela peut r\u00E9sulter de l''interception d''une erreur de gravit\u00E9 concernant la transaction dans cette instruction.
40XD0=Le conteneur a \u00E9t\u00E9 ferm\u00E9.
40XD1=Le conteneur a \u00E9t\u00E9 ouvert en mode lecture seule.
40XD2=Impossible d''ouvrir le conteneur {0} ; soit il a \u00E9t\u00E9 supprim\u00E9, soit il n''existe pas.
40XL1=Aucun verrou n''a pu \u00EAtre obtenu dans le d\u00E9lai demand\u00E9
40XL2=Aucun verrou n''a pu \u00EAtre obtenu dans le d\u00E9lai demand\u00E9.  La liste lockTable est \: {0}
40XT0=Une erreur interne a \u00E9t\u00E9 identifi\u00E9e par le module RawStore.
40XT1=Une exception a \u00E9t\u00E9 \u00E9mise au cours de la validation de la transaction.
40XT2=Une exception a \u00E9t\u00E9 \u00E9mise au cours de l''annulation d''un POINT DE SAUVEGARDE.
40XT4=Une tentative de fermeture d''une transaction toujours active a \u00E9t\u00E9 effectu\u00E9e. La transaction a \u00E9t\u00E9 abandonn\u00E9e.
40XT5=Une exception a \u00E9t\u00E9 \u00E9mise au cours d''une transaction interne.
40XT6=La base de donn\u00E9es est en \u00E9tat de repos ; impossible d''activer la transaction.  Attendez un moment qu''elle quitte cet \u00E9tat.
40XT7=Op\u00E9ration non prise en charge dans une transaction interne.
42000=Erreur de syntaxe ou violation des r\u00E8gles d''acc\u00E8s ; pour plus de d\u00E9tails, voir les autres erreurs.
42500=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur la table ''{2}''.''{3}''.
42501=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur la table ''{2}''.''{3}'' pour l''instruction GRANT.
42502=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur la colonne ''{2}'' de la table ''{3}''.''{4}''.
42503=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur la colonne ''{2}'' de la table ''{3}''.''{4}'' pour l''instruction GRANT.
42504=L''utilisateur ''{0}'' ne dispose pas de droits d''ex\u00E9cution sur {1} ''{2}''.''{3}''.
42505=L''utilisateur ''{0}'' ne dispose pas de droits d''ex\u00E9cution sur {1} ''{2}''.''{3}'' pour l''instruction GRANT.
42506=L''utilisateur ''{0}'' n''est pas propri\u00E9taire de {1} ''{2}''.''{3}''.
42507=L''utilisateur ''{0}'' ne peut pas ex\u00E9cuter l''op\u00E9ration dans le sch\u00E9ma ''{1}''.
42508=L''utilisateur ''{0}'' ne peut pas cr\u00E9er de sch\u00E9ma ''{1}''. Seul le propri\u00E9taire de la base de donn\u00E9es a pu \u00E9mettre cette instruction.
42509=La d\u00E9finition d''une op\u00E9ration d''autorisation ou de r\u00E9vocation n''est pas autoris\u00E9e sur l''objet ''{0}''.
4250A=L''utilisateur ''{0}'' ne dispose pas de droits {1} sur l''object ''{2}''.''{3}''.
4250B=Propri\u00E9t\u00E9 d''autorisation de la base de donn\u00E9es incorrecte ''{0}\={1}''.
4250C=Le ou les utilisateurs ''{0}'' ne doivent pas figurer \u00E0 la fois dans les listes d''autorisation d''acc\u00E8s en lecture seule et d''acc\u00E8s int\u00E9gral.
4250D=Le ou les utilisateurs ''{1}'' sont r\u00E9p\u00E9t\u00E9s dans la liste d''acc\u00E8s ''{0}'' ;
4250E=Erreur interne \: ID {0} incorrect dans la liste d''autorisation des instructions.
4251A=L'instruction {0} ne peut \u00EAtre \u00E9mise que par le propri\u00E9taire de la base de donn\u00E9es.
42601.S.372=L''instruction ALTER TABLE ne peut pas ajouter de colonne d''identit\u00E9 (IDENTITY) \u00E0 la table.
42601=Dans une instruction ALTER TABLE, la colonne ''{0}'' a \u00E9t\u00E9 d\u00E9finie par la valeur NOT NULL et la clause DEFAULT n''a pas \u00E9t\u00E9 sp\u00E9cifi\u00E9e ou a \u00E9t\u00E9 sp\u00E9cifi\u00E9e comme DEFAULT NUL.
42605=Le nombre d''arguments pour la fonction ''{0}'' est incorrect.
42606=Une constante hexad\u00E9cimale non valide commen\u00E7ant par ''{0}'' a \u00E9t\u00E9 d\u00E9tect\u00E9e.
42610=Les arguments de la fonction COALESCE/VALUE ne peuvent pas tous \u00EAtre des param\u00E8tres. La fonction doit disposer au minimum d''un argument qui n''est pas un param\u00E8tre.
42611=L''attribut de longueur, de pr\u00E9cision ou d''\u00E9chelle de la colonne, ou le mappage de type ''{0}'' n''est pas valide. 
42613=Pr\u00E9sence de mots cl\u00E9s multiples ou incompatibles impliquant la clause ''{0}''.
42621=Une contrainte de v\u00E9rification ou une colonne g\u00E9n\u00E9r\u00E9e d\u00E9finie par ''{0}'' n''est pas valide.
42622=Le nom ''{0}'' est trop long. La longueur maximale est ''{1}''.
42734=Le nom ''{0}'' indiqu\u00E9 dans le contexte ''{1}'' n''est pas unique.
42802=Le nombre de valeurs attribu\u00E9es n''est pas le m\u00EAme que le nombre de colonnes sp\u00E9cifi\u00E9es ou implicites.
42803=Une expression contenant la colonne ''{0}'' appara\u00EEt dans la liste SELECT et ne fait pas partie d''une clause GROUP BY.
42815.S.171=Les types de donn\u00E9es, les longueurs ou les valeurs des arguments ''{0}'' et ''{1}'' sont incompatibles.
42815.S.713=La valeur de remplacement de ''{0}'' n''est pas valide.
42818=Les comparaisons entre ''{0}'' et ''{1}'' ne sont pas prises en charge. Les types doivent \u00EAtre comparables. Les types cha\u00EEne doivent \u00E9galement disposer d''un interclassement identique. Si l'interclassement est diff\u00E9rent pour les deux cha\u00EEnes, une solution consiste \u00E0 forcer un type d'op\u00E9rande destin\u00E9 \u00E0 appliquer l'interclassement par d\u00E9faut (par ex., SELECT tablename FROM sys.systables WHERE CAST(tablename AS VARCHAR(128)) \= ''T1'').
42820=Le litt\u00E9ral \u00E0 virgule flottante ''{0}'' contient plus de 30 caract\u00E8res.
42821=Les colonnes de type ''{0}'' ne peuvent pas contenir de valeurs de type ''{1}''. 
42824=Un op\u00E9rande de LIKE n''est pas une cha\u00EEne ou le premier op\u00E9rande n''est pas une colonne.
42831=''{0}'' ne peut pas \u00EAtre une colonne de cl\u00E9 primaire ou unique car elle peut contenir des valeurs null.
42834=SET NULL ne peut \u00EAtre indiqu\u00E9 car la CLE EXTERNE ''{0}'' ne peut pas contenir de valeurs nulles.  
42837=ALTER TABLE ''{0}'' a indiqu\u00E9 des attributs pour la colonne ''{1}'' qui ne sont pas compatibles avec la colonne existante.
42846=Impossible de convertir les types ''{0}'' en ''{1}''.
42877=Un nom de colonne complet ''{0}'' n''est pas admis dans la clause ORDER BY.
42878=La clause ORDER BY d''une instruction SELECT UNION prend uniquement en charge les r\u00E9f\u00E9rences de colonne non qualifi\u00E9es et les num\u00E9ros de position des colonnes. Les autres expressions ne sont pas prises en charge pour l''instant.
42879=La clause ORDER BY peut ne pas contenir la colonne ''{0}'', car la requ\u00EAte indique DISTINCT et cette colonne ne figure pas dans les r\u00E9sultats de la requ\u00EAte.
4287A=La clause ORDER BY peut ne pas sp\u00E9cifier d''expression, car la requ\u00EAte indique DISTINCT.
42884=Une routine non autoris\u00E9e, nomm\u00E9e ''{0}'' de type ''{1}'' et comportant des arguments compatibles a \u00E9t\u00E9 trouv\u00E9e.
42886=Le param\u00E8tre ''{0}'' ''{1}'' requiert un marqueur de param\u00E8tre ''?''.
42894=La valeur DEFAULT ou la valeur de l''attribut IDENTITY n''est pas valide pour la colonne ''{0}''.
428C1=Seule une colonne d''identit\u00E9 est admise dans une table.
428EK=Le qualifiant d''une table temporaire globale d\u00E9clar\u00E9e doit obligatoirement \u00EAtre SESSION.
42903=Utilisation non valide d''une fonction d''agr\u00E9gat.
42908=L''instruction CREATE VIEW n''inclut pas de liste de colonnes.
42909=L''instruction CREATE TABLE ne comprend pas de liste de colonnes.
42915=La cl\u00E9 externe ''{0}'' n''est pas valide car ''{1}''. 
42916=Impossible de cr\u00E9er le synonyme ''{0}'' pour ''{1}'' car cette action g\u00E9n\u00E8re une cha\u00EEne de synonymes circulaire.
42939=Un objet ne peut pas \u00EAtre cr\u00E9\u00E9 avec le nom du sch\u00E9ma ''{0}''.
4293A=Il n'est pas possible de cr\u00E9er un r\u00F4le sous le nom ''{0}'' ; le pr\u00E9fixe SYS est r\u00E9serv\u00E9.
42962=Une colonne de type Long ou un param\u00E8tre ''{0}'' n''est pas autoris\u00E9 dans des tables temporaires globales d\u00E9clar\u00E9es, ni des d\u00E9finitions de proc\u00E9dure. 
42972=Une clause ON associ\u00E9e \u00E0 un op\u00E9rateur JOIN n''est pas valide.
42995=La fonction demand\u00E9e ne s''applique pas aux tables temporaires globales.
42X01=Erreur de syntaxe \: {0}.
42X02={0}.
42X03=Le nom de colonne ''{0}'' se trouve dans plusieurs tables de la liste FROM.
42X04=La colonne ''{0}'' ne se trouve dans aucune table de la liste FROM ou figure dans une sp\u00E9cification de jointure et se trouve en dehors de la port\u00E9e de cette sp\u00E9cification ou figure dans une clause HAVING mais ne se trouve pas dans la liste GROUP BY. S''il s''agit d''une instruction CREATE ou ALTER TABLE, alors ''{0}'' n''est pas une colonne de la table cible.
42X05=La table/vue ''{0}'' n''existe pas.
42X06=Nombre de colonnes de r\u00E9sultats sp\u00E9cifi\u00E9 trop \u00E9lev\u00E9 pour la table  ''{0}''.
42X07=La valeur NULL est uniquement autoris\u00E9e dans une clause VALUES \u00E0 l''int\u00E9rieur d''une instruction INSERT.
42X08=Le constructeur de la classe ''{0}'' ne peut pas \u00EAtre utilis\u00E9 en tant que table virtuelle externe \u00E9tant donn\u00E9 que la classe n''impl\u00E9mente pas ''{1}''. 
42X09=Le nom de table ou d''alias ''{0}'' est utilis\u00E9 plusieurs fois dans la liste FROM.
42X10=''{0}'' n''est pas un nom de table expos\u00E9 dans la port\u00E9e o\u00F9 il figure.
42X12=Le nom de colonne ''{0}'' figure plusieurs fois dans l''instruction CREATE TABLE.  
42X13=Le nom de colonne ''{0}'' figure plusieurs fois dans la liste des colonnes d''une instruction INSERT. 
42X14=''{0}'' n''est pas une colonne de la table ou du VTI ''{1}''.
42X15=Le nom de colonne ''{0}'' figure dans une instruction ne contenant pas de liste FROM.
42X16=Le nom de colonne ''{0}'' figure plusieurs fois dans la clause SET d''une instruction UPDATE.
42X17=Dans la liste Propri\u00E9t\u00E9s d''une clause FROM, la valeur ''{0}'' n''est pas valide en tant que sp\u00E9cification joinOrder. Seules les valeurs FIXED et UNFIXED sont valides.  
42X19=La clause WHERE ou HAVING ou la d\u00E9finition CHECK CONSTRAINT est une expression ''{0}''.  Il faut que ce soit une expression BOOLEENNE.
42X23=Le curseur {0} ne peut pas \u00EAtre mis \u00E0 jour.
42X24=La colonne {0} est r\u00E9f\u00E9renc\u00E9e dans la clause HAVING, mais elle ne figure pas dans la liste GROUP BY.
42X25=La fonction ''{0}'' n''est pas autoris\u00E9e sur le type ''{1}''.
42X26=La classe ''{0}'' de la colonne ''{1}'' n''existe pas ou est inaccessible. Cela peut se produire si la classe n''est pas publique.
42X28=La table de suppression ''{0}'' n''est pas la cible du curseur ''{1}''.
42X29=La table de mise \u00E0 jour ''{0}'' n''est pas la cible du curseur ''{1}''.
42X30=Le curseur ''{0}'' est introuvable. V\u00E9rifiez que la fonction de validation automatique est d\u00E9sactiv\u00E9e (OFF).
42X31=La colonne ''{0}'' ne se trouve pas dans la liste FOR UPDATE du curseur ''{1}''.
42X32=Le nombre de colonnes de la liste de colonnes d\u00E9riv\u00E9es doit correspondre au nombre de colonnes de la table ''{0}''.
42X33=La liste de colonnes d\u00E9riv\u00E9es contient un nom de colonne en double ''{0}''.
42X34=La liste de s\u00E9lection contient un param\u00E8tre ?.  Ce param\u00E8tre n''est pas admis.
42X35=Il n''est pas admis que les deux op\u00E9randes de ''{0}'' soient des param\u00E8tres ?.
42X36=L''op\u00E9rateur ''{0}'' ne peut pas utiliser de param\u00E8tre ? en tant qu''op\u00E9rande.
42X37=L''op\u00E9rateur unaire ''{0}'' n''est pas autoris\u00E9e sur le type ''{1}''.
42X38=''SELECT *'' est uniquement autoris\u00E9 dans les sous-requ\u00EAtes EXISTS et NOT EXISTS.
42X39=La sous-requ\u00EAte est uniquement autoris\u00E9e \u00E0 renvoyer une seule colonne.
42X40=Une instruction NOT comporte un op\u00E9rande qui n''est pas bool\u00E9en. L''op\u00E9rande de NOT doit avoir pour r\u00E9sultat TRUE, FALSE ou UNKNOWN. 
42X41=Dans la clause Propri\u00E9t\u00E9s d''une liste FROM, la propri\u00E9t\u00E9 ''{0}'' n''est pas valide (la valeur ''{1}'' a \u00E9t\u00E9 attribu\u00E9e \u00E0 la propri\u00E9t\u00E9). 
42X42=Le nom de corr\u00E9lation n''est pas admis pour la colonne ''{0}'' car elle fait partie de la liste FOR UPDATE.
42X43=Le r\u00E9sultat ResultSetMetaData renvoy\u00E9 pour la classe/objet ''{0}'' \u00E9tait NULL. L''\u00E9l\u00E9ment ResultSetMetaData doit \u00EAtre non nul pour que cette classe puisse \u00EAtre utilis\u00E9e en tant que table virtuelle externe. 
42X44=Longueur incorrecte ''{0}'' dans la sp\u00E9cification de colonne.
42X45={0} est un type non valide pour le num\u00E9ro d''argument{1} de {2}.
42X46=Il existe plusieurs fonctions nomm\u00E9es ''{0}''. Utilisez la signature compl\u00E8te ou le nom sp\u00E9cifique.
42X47=Il existe plusieurs proc\u00E9dures nomm\u00E9es ''{0}''. Utilisez la signature compl\u00E8te ou le nom sp\u00E9cifique.
42X48=La valeur ''{1}'' n''est pas une pr\u00E9cision correcte pour {0}.
42X49=La valeur ''{0}'' n''est pas un litt\u00E9ral entier valide.
42X50=Aucune m\u00E9thode correspondant \u00E0 l''appel de m\u00E9thode {0}.{1}({2}) n''a \u00E9t\u00E9 trouv\u00E9e, toutes les combinaisons de types d''objet et de types primitifs, ainsi que toutes les conversions de type possibles pour tous les param\u00E8tres que l''appel de m\u00E9thode pourrait contenir ont \u00E9t\u00E9 essay\u00E9es. La m\u00E9thode peut exister mais elle n''est pas publique ou statique ou les types de param\u00E8tre ne peuvent pas \u00EAtre convertis en appel de m\u00E9thode.
42X51=La classe ''{0}'' n''existe pas ou est inaccessible. Cela peut se produire si la classe n''est pas publique.
42X52=L''appel de la m\u00E9thode (''{0}'') \u00E0 l''aide d''un r\u00E9cepteur de type primitif Java ''{1}'' n''est pas autoris\u00E9.
42X53=Le pr\u00E9dicat LIKE peut uniquement avoir les op\u00E9randes ''CHAR'' ou ''VARCHAR''. Le type ''{0}'' n''est pas admis.
42X54=La m\u00E9thode Java ''{0}'' comporte un caract\u00E8re ? en tant que r\u00E9cepteur.  Ce caract\u00E8re n''est pas admis.
42X55=Le nom de table ''{1}'' doit \u00EAtre le m\u00EAme que ''{0}''.
42X56=Le nombre de colonnes de la liste des colonnes de vue doit correspondre au nombre de colonnes de l''expression de requ\u00EAte sous-jacente dans la d\u00E9finition de vue pour ''{0}''.
42X57=La m\u00E9thode getColumnCount() pour la table virtuelle externe ''{0}'' a renvoy\u00E9 une valeur non valide ''{1}''.  Les valeurs valides sont \u00E9gales ou sup\u00E9rieures \u00E0 1. 
42X58=Le nombre de colonnes situ\u00E9es \u00E0 gauche et \u00E0 droite de l''\u00E9l\u00E9ment {0} doit \u00EAtre identique.
42X59=Le nombre de colonnes de chaque constructeur VALUES doit \u00EAtre le m\u00EAme.
42X60=Valeur non valide ''{0}'' pour la propri\u00E9t\u00E9 insertMode sp\u00E9cifi\u00E9e pour la table ''{1}''.
42X61=Les types ''{0}'' et ''{1}'' ne sont pas compatibles avec {2}.
42X62=''{0}'' n''est pas autoris\u00E9 dans le sch\u00E9ma ''{1}''.
42X63=La clause USING n''a pas renvoy\u00E9 de r\u00E9sultats. Aucun param\u00E8tre ne peut \u00EAtre d\u00E9fini. 
42X64=Dans la liste Propri\u00E9t\u00E9s, la valeur non valide ''{0}'' a \u00E9t\u00E9 indiqu\u00E9e pour la propri\u00E9t\u00E9 useStatistics. Les seules valeurs valides sont TRUE ou FALSE. 
42X65=L''index ''{0}'' n''existe pas.
42X66=Le nom de colonne ''{0}'' figure plusieurs fois dans l''instruction CREATE INDEX.
42X68=Aucune zone ''{0}'' appartenant \u00E0 la classe ''{1}'' n''a \u00E9t\u00E9 trouv\u00E9e.  Il est possible que cette zone existe, mais qu''elle ne soit pas publique, ou que la classe n''existe pas ou qu''elle ne soit pas publique.
42X69=Il n''est pas permis de r\u00E9f\u00E9rencer une zone (''{0}'') \u00E0 l''aide d''une expression de r\u00E9f\u00E9rencement du type primitif Java ''{1}''.
42X70=Le nombre de colonnes sp\u00E9cifi\u00E9 dans la liste de colonnes de la table ne correspond pas au nombre de colonnes indiqu\u00E9 dans l''expression de requ\u00EAte sous-jacente figurant dans la d\u00E9finition de table de ''{0}''.
42X71=Type de donn\u00E9es ''{0}'' non valide pour la colonne ''{1}''.
42X72=Aucune zone statique ''{0}'' appartenant \u00E0 la classe ''{1}'' n''a \u00E9t\u00E9 trouv\u00E9e.  Il est possible que la zone existe mais elle n''est pas publique ou statique ou la classe n''existe pas ou n''est pas publique.  
42X73=La r\u00E9solution de m\u00E9thode pour la signature {0}.{1}({2}) \u00E9tait ambigu\u00EB. (Plus d''une m\u00E9thode correspondait \u00E0 la requ\u00EAte.)
42X74=Syntaxe de l''instruction CALL incorrecte.
42X75=Aucun constructeur ayant la signature {0}({1}) n''a \u00E9t\u00E9 trouv\u00E9.  Il est possible que les types de param\u00E8tres ne puissent pas \u00EAtre convertis en appel de m\u00E9thode.
42X76=Une colonne au moins, ''{0}'', de la cl\u00E9 primaire ajout\u00E9e peut avoir une valeur null. Aucune colonne d''une cl\u00E9 primaire ne peut avoir une valeur nulle.
42X77=La position de la colonne ''{0}'' est en dehors des limites pour l''expression de requ\u00EAte.
42X78=La colonne ''{0}'' ne figure pas dans le r\u00E9sultat de l''expression de requ\u00EAte.
42X79=Le nom de colonne ''{0}'' figure plusieurs fois dans le r\u00E9sultat de l''expression de requ\u00EAte.
42X80=La clause VALUES doit contenir au moins un \u00E9l\u00E9ment. Les \u00E9l\u00E9ments vides ne sont pas admis. 
42X82=La clause USING a renvoy\u00E9 plusieurs lignes. Seuls les ResultSets comportant une seule ligne sont autoris\u00E9s.
42X83=Les contraintes s''appliquant \u00E0 la colonne  ''{0}'' n\u00E9cessitent que cette derni\u00E8re contienne \u00E0 la fois des valeurs nulles et des valeurs non nulles.
42X84=L''index ''{0}'' a \u00E9t\u00E9 cr\u00E9\u00E9 pour appliquer la contrainte ''{1}''.  Il ne peut \u00EAtre supprim\u00E9 que par la suppression de la contrainte.
42X85=La contrainte ''{0}''doit obligatoirement se trouver dans le m\u00EAme sch\u00E9ma que la table ''{1}''.
42X86=Echec de l''op\u00E9ration ALTER TABLE. Il n''existe aucune contrainte ''{0}'' sur la table ''{1}''. 
42X87=Au moins une expression de r\u00E9sultat (THEN ou ELSE) de l''expression ''{0}'' ne doit pas \u00EAtre un caract\u00E8re ''?''. 
42X88=Un conditionnel comporte un op\u00E9rande non bool\u00E9en. L''op\u00E9rande d''un conditionnel doit avoir pour r\u00E9sultat TRUE, FALSE ou UNKNOWN.  
42X89=Les types ''{0}'' et ''{1}'' ne sont pas compatibles. Aucun de ces deux types ne peut \u00EAtre affect\u00E9 \u00E0 l''autre.  
42X90=Plus d''une contrainte de cl\u00E9 primaire est indiqu\u00E9e pour la table ''{0}''.
42X91=Le nom de contrainte ''{0}'' figure plusieurs fois dans l''instruction CREATE TABLE. 
42X92=Le nom de colonne ''{0}'' figure plusieurs fois dans la liste de de colonnes d''une contrainte.
42X93=La table ''{0}'' contient une d\u00E9finition de contrainte avec la colonne ''{1}'', laquelle ne se trouve pas dans la table.
42X94={0} ''{1}'' n''existe pas.
42X96=Le chemin d''acc\u00E8s aux classes de la base de donn\u00E9es contient un fichier jar inconnu ''{0}''.
42X98=Les param\u00E8tres ne sont pas autoris\u00E9s dans une d\u00E9finition VIEW.
42X99=Les param\u00E8tres ne sont pas autoris\u00E9s dans une d\u00E9finition TABLE.
42Y00=La classe ''{0}'' n''impl\u00E9mente pas org.apache.derby.iapi.db.AggregateDefinition et par cons\u00E9quent ne peut pas \u00EAtre utilis\u00E9e en tant qu''expression d''agr\u00E9gat.
42Y01=La contrainte ''{0}'' n''est pas valide.
42Y03=''{0}'' n''est pas reconnu comme fonction ou proc\u00E9dure.
42Y04=Impossible de cr\u00E9er une proc\u00E9dure ou une fonction dont le NOM EXTERNE est ''{0}'' car il ne s''agit pas d''une liste dont les \u00E9l\u00E9ments sont s\u00E9par\u00E9s par un point. Le format attendu est <chemin d''acc\u00E8s java complet>.<nom m\u00E9thode>.
42Y05=Aucune cl\u00E9 externe n''a pour nom ''{0}''.
42Y07=Le sch\u00E9ma ''{0}'' n''existe pas
42Y08=Les contraintes de cl\u00E9 externe ne sont pas autoris\u00E9es sur les tables syst\u00E8me.
42Y09=Les m\u00E9thodes void sont uniquement autoris\u00E9es dans une instruction CALL.
42Y10=Un constructeur de table qui ne se trouve pas dans une instruction INSERT contient tous les param\u00E8tres ? dans l''une de ses colonnes.  Pour chaque colonne, au moins l''une des lignes doit contenir un non-param\u00E8tre.
42Y11=Une sp\u00E9cification de jointure est requise avec la clause ''{0}''.
42Y12=La clause ON d''un \u00E9l\u00E9ment JOIN est une expression ''{0}''.  Il faut que ce soit une expression BOOLEENNE.
42Y13=Le nom de colonne ''{0}'' figure plusieurs fois dans l''instruction CREATE VIEW.
42Y16=Aucune m\u00E9thode statique publique ''{0}'' n''a \u00E9t\u00E9 trouv\u00E9e dans la classe ''{1}''. La m\u00E9thode peut exister mais elle n''est pas publique ou elle n''est pas statique. 
42Y22=L''agr\u00E9gat {0} ne peut pas fonctionner sur le type {1}.
42Y23=Informations sur le type JDBC incorrectes renvoy\u00E9es pour la colonne {0}.
42Y24=La vue ''{0}'' ne peut pas \u00EAtre mise \u00E0 jour. (Les vues ne peuvent pas \u00EAtre mises \u00E0 jour actuellement.) 
42Y25=''{0}'' est une table syst\u00E8me.  Les utilisateurs ne sont pas autoris\u00E9s \u00E0 modifier le contenu de cette table.
42Y26=Les agr\u00E9gats ne sont pas autoris\u00E9s dans la liste GROUP BY.
42Y27=Les param\u00E8tres ne sont pas autoris\u00E9s dans l''action du d\u00E9clencheur.
42Y29=La liste SELECT d''une requ\u00EAte non group\u00E9e contient au moins une expression non valide. Lorsque la liste SELECT contient au moins un agr\u00E9gat, toutes les entr\u00E9es doivent \u00EAtre des expressions d''agr\u00E9gat valides.
42Y30=La liste SELECT d''une requ\u00EAte group\u00E9e contient au moins une expression non valide. Si une liste SELECT comporte un \u00E9l\u00E9ment GROUP BY, la liste ne peut contenir que des expressions de regroupement et des expressions d''agr\u00E9gat valides.  
42Y32=La classe d''agr\u00E9gateur ''{0}'' pour l''agr\u00E9gat ''{1}'' sur le type {2} n''impl\u00E9mente pas com.ibm.db2j.aggregates.Aggregator. 
42Y33=L''agr\u00E9gat {0} contient un ou plusieurs agr\u00E9gats.
42Y34=Le nom de colonne ''{0}'' correspond \u00E0 plusieurs colonnes de r\u00E9sultats dans la table ''{1}''.
42Y35=La r\u00E9f\u00E9rence de colonne ''{0}'' n''est pas valide. Lorsque la liste SELECT contient au moins un agr\u00E9gat, toutes les entr\u00E9es doivent \u00EAtre des expressions d''agr\u00E9gat valides.  
42Y36=La r\u00E9f\u00E9rence de colonne ''{0}'' n''est pas valide.  Pour une liste SELECT comportant un \u00E9l\u00E9ment GROUP BY, la liste ne peut contenir que des expressions de regroupement et des expressions d''agr\u00E9gat valides.  
42Y37=''{0}'' est de type Java primitif et ne peut pas \u00EAtre utilis\u00E9 avec cet op\u00E9rateur.
42Y38=insertMode \= replace n''est pas autoris\u00E9 sur une insertion lorsque la table cible, ''{0}'', est r\u00E9f\u00E9renc\u00E9e dans l''\u00E9l\u00E9ment SELECT.
42Y39=''{0}'' ne peut pas figurer dans une d\u00E9finition CHECK CONSTRAINT car il pourrait renvoyer des r\u00E9sultats non d\u00E9terministes.
42Y40=''{0}'' figure plusieurs fois dans la liste de colonnes UPDATE OF pour le d\u00E9clencheur ''{1}''.
42Y41=''{0}'' ne peut pas \u00EAtre appel\u00E9 directement via EXECUTE STATEMENT parce qu''il fait partie d''un d\u00E9clencheur.
42Y42=L''\u00E9chelle ''{1}'' n''est pas une \u00E9chelle valide pour un \u00E9l\u00E9ment {0}.
42Y43=L''\u00E9chelle ''{0}'' n''est pas une \u00E9chelle valide avec une pr\u00E9cision de ''{1}''.
42Y44=Cl\u00E9 non valide ''{0}'' indiqu\u00E9e dans la liste des propri\u00E9t\u00E9s d''une liste FROM. Les cl\u00E9s respectant minuscules et majuscules actuellement prises en charge sont ''{1}''. 
42Y45=Le VTI ''{0}'' ne peut pas \u00EAtre li\u00E9 parce qu''il s''agit d''un VTI de d\u00E9clencheur sp\u00E9cial et que cette instruction ne fait pas partie d''une action de d\u00E9clencheur ou d''une clause WHEN.
42Y46=Liste Propri\u00E9t\u00E9s non valide dans la liste FROM.  Il n''existe aucun index ''{0}'' sur la table ''{1}''.
42Y48=Liste Propri\u00E9t\u00E9s non valide dans la liste FROM.  Soit il n''existe aucune contrainte nomm\u00E9e ''{0}''sur la table ''{1}'', soit la contrainte ne poss\u00E8de pas d''index de secours.
42Y49=Plusieurs valeurs sont indiqu\u00E9es pour la cl\u00E9 de propri\u00E9t\u00E9 ''{0}''. 
42Y50=La liste Propri\u00E9t\u00E9s pour la table ''{0}'' peut contenir des valeurs pour l''index ou pour la contrainte, mais pas pour les deux.
42Y55=''{0}'' ne peut pas \u00EAtre ex\u00E9cut\u00E9 sur ''{1}'' parce qu''il n''existe pas.
42Y56=Strat\u00E9gie de jointure non valide ''{0}'' indiqu\u00E9e dans la liste des propri\u00E9t\u00E9s sur la table ''{1}''. Les valeurs actuellement prises en charge pour une strat\u00E9gie de jointure sont \: ''hash'' et ''nestedloop''.
42Y58=L''exception NumberFormatException s''est produite lors de la conversion de la valeur ''{0}'' pour l''\u00E9l\u00E9ment de substitution d''optimiseur ''{1}''.
42Y59=Valeur non valide, ''{0}'', indiqu\u00E9e pour l''\u00E9l\u00E9ment de substitution hashInitialCapacity. La valeur doit \u00EAtre sup\u00E9rieure \u00E0 0.
42Y60=Valeur non valide, ''{0}'', indiqu\u00E9e pour l''\u00E9l\u00E9ment de substitution de hashLoadFactor. La valeur doit \u00EAtre sup\u00E9rieure \u00E0 0 et inf\u00E9rieure ou \u00E9gale \u00E0 1.0.
42Y61=Valeur non valide, ''{0}'', indiqu\u00E9e pour l''\u00E9l\u00E9ment de substitution hashMaxCapacity. La valeur doit \u00EAtre sup\u00E9rieure \u00E0 0.
42Y62=''{0}'' n''est pas autoris\u00E9 sur ''{1}'' parce qu''il s''agit d''une vue.
42Y63=Une jointure par hachage n\u00E9cessite un pr\u00E9dicat equijoin optimisable sur une colonne dans l''index ou le segment de m\u00E9moire s\u00E9lectionn\u00E9.  Un pr\u00E9dicat equijoin optimisable n''existe dans aucune colonne de la table ou de l''index ''{0}''. Utilisez l''\u00E9l\u00E9ment de substitution d''optimiseur ''index'' pour sp\u00E9cifier cet index ou ce segment de m\u00E9moire sur la table ''{1}''.
42Y64=La valeur bulkFetch de ''{0}'' n''est pas valide. La valeur minimale de bulkFetch est 1.
42Y65=bulkFetch n''est pas autoris\u00E9 sur les jointures ''{0}''.
42Y66=bulkFetch n''est pas autoris\u00E9 sur les curseurs pouvant \u00EAtre mis \u00E0 jour. 
42Y67=Le sch\u00E9ma ''{0}'' ne peut pas \u00EAtre supprim\u00E9.
42Y69=Aucun plan d''ex\u00E9cution valide n''a \u00E9t\u00E9 trouv\u00E9 pour cette instruction. Cela peut s''expliquer de l''une des deux fa\u00E7ons suivantes \: soit vous avez sp\u00E9cifi\u00E9 une strat\u00E9gie de jointure par hachage alors que les jointures par hachage ne sont pas autoris\u00E9es (pas d''equijoin optimisable), soit vous essayez de joindre deux tables virtuelles externes dont chacune fait r\u00E9f\u00E9rence \u00E0 l''autre, de sorte que l''instruction ne peut pas \u00EAtre \u00E9valu\u00E9e.  
42Y70=L''utilisateur a indiqu\u00E9 un ordre de jointure non admis. Cela peut \u00EAtre d\u00FB au fait qu''une colonne de jointure d''une table interne est transmise en tant que param\u00E8tre \u00E0 une table virtuelle externe.
42Y71=La proc\u00E9dure ou la fonction syst\u00E8me ''{0}'' ne peut pas \u00EAtre supprim\u00E9e.
42Y82=L''instruction pr\u00E9par\u00E9e stock\u00E9e ''{0}'' g\u00E9n\u00E9r\u00E9e par le syst\u00E8me ne peut pas \u00EAtre supprim\u00E9e \u00E0 l''aide de l''instruction DROP STATEMENT. Elle fait partie d''un d\u00E9clencheur. 
42Y83=Une valeur NULL non typ\u00E9e n''est pas autoris\u00E9e en tant qu''argument pour l''agr\u00E9gat {0}.  Affectez la valeur NULL \u00E0 un type appropri\u00E9.
42Y84=''{0}'' peut ne pas figurer dans une d\u00E9finition DEFAULT.
42Y85=Le mot cl\u00E9 DEFAULT n''est pas autoris\u00E9 dans une clause VALUES lorsque cette clause figure dans une instruction INSERT.
42Y90=FOR UPDATE n''est pas autoris\u00E9 dans ce type d''instruction.  
42Y91=La clause USING n''est pas autoris\u00E9e dans un EXECUTE STATEMENT pour une action de d\u00E9clencheur.
42Y92=Les d\u00E9clencheurs {0} peuvent uniquement faire r\u00E9f\u00E9rence aux variables/tables de transition {1}.
42Y93=Clause REFERENCING incorrecte \: un seul nom est autoris\u00E9 pour chaque type de variable/table de transition.
42Y94=Un op\u00E9rateur AND ou OR poss\u00E8de un op\u00E9rande non bool\u00E9en. Les op\u00E9randes de AND et OR doivent avoir pour r\u00E9sultat TRUE, FALSE ou UNKNOWN.  
42Y95=L''op\u00E9rateur ''{0}'' ayant comme type d''op\u00E9rande de gauche ''{1}'' et comme type d''op\u00E9rande de droite ''{2}'' n''est pas prise en charge.
42Y96.U=UNKNOWN
42Y97=Caract\u00E8re d''\u00E9chappement non valide \u00E0 la ligne ''{0}'', colonne ''{1}''.
42Y98.U="{0}" d\u00E9tect\u00E9 \u00E0 la ligne {1}, colonne {2}
42Y99.U=Erreur lexicale \u00E0 la ligne {0}, colonne {1}. Exception rencontr\u00E9e \: {2}
42Z00.U=Appel de m\u00E9thode Java ou r\u00E9f\u00E9rence de zone
42Z01.U=UNTYPED
42Z02=Plusieurs agr\u00E9gats DISTINCT ne sont pas pris en charge \u00E0 ce stade.
42Z07=Les agr\u00E9gats ne sont pas autoris\u00E9s dans la clause ON.
42Z08=Une op\u00E9ration d''insertion/remplacement globale n''est pas autoris\u00E9e  sur ''{0}'' parce qu''il contient un d\u00E9clencheur activ\u00E9 ({1}).
42Z09.U=le COLUMN DEFAULT pour
42Z11.U=flux
42Z15=Type non valide indiqu\u00E9 pour la colonne ''{0}''. Le type d''une colonne ne peut pas \u00EAtre modifi\u00E9.  
42Z16=Seule la longueur des colonnes de type VARCHAR peut \u00EAtre modifi\u00E9e. 
42Z17=Longueur non valide indiqu\u00E9e pour la colonne ''{0}''. La longueur doit \u00EAtre sup\u00E9rieure \u00E0 la longueur de colonne actuelle.
42Z18=La colonne ''{0}'' fait partie d''une contrainte de cl\u00E9 externe ''{1}''. Pour modifier la longueur de cette colonne, vous devez d''abord supprimer la contrainte, ex\u00E9cuter ALTER TABLE, puis recr\u00E9er la contrainte.
42Z19=La colonne ''{0}'' a \u00E9t\u00E9 r\u00E9f\u00E9renc\u00E9e par au moins une contrainte de cl\u00E9 externe ''{1}''. Pour modifier la longueur de cette colonne, vous devez d''abord supprimer les contraintes faisant r\u00E9f\u00E9rence, ex\u00E9cuter ALTER TABLE, puis recr\u00E9er la contrainte. 
42Z20=La colonne ''{0}'' ne peut pas accepter de valeur NULL. Elle fait partie d''une cl\u00E9 primaire ou d''une contrainte d''unicit\u00E9 qui ne peuvent pas contenir de colonnes ayant une valeur nulle.
42Z21=Incr\u00E9ment non valide indiqu\u00E9 pour l''identit\u00E9 de la colonne ''{0}''. L''incr\u00E9ment ne peut pas \u00EAtre z\u00E9ro.  
42Z22=Type non valide indiqu\u00E9 pour la colonne IDENDITY ''{0}''. Les seuls types valides pour les colonnes d''identit\u00E9 sont BIGINT, INT et SMALLINT.
42Z23=Tentative de modification d''une colonne d''identit\u00E9 ''{0}''. 
42Z24=Un d\u00E9passement de la valeur IDENDITY est survenu pour la colonne ''{1}'' dans la table ''{0}''.
42Z25=ERREUR INTERNE - Compteur d''identit\u00E9. Une mise \u00E0 jour a \u00E9t\u00E9 appel\u00E9e sans argument avec la valeur en cours \= NULL.
42Z26=Une colonne,  ''{0}'', associ\u00E9e \u00E0 une valeur d''identit\u00E9 par d\u00E9faut ne peut pas prendre la valeur NULL.
42Z27=Une colonne pouvant prendre la valeur NULL, ''{0}'', ne peut pas \u00EAtre modifi\u00E9e pour prendre une valeur d''identit\u00E9 par d\u00E9faut.
42Z30.U=temps pass\u00E9 dans ce ResultSet \=
42Z31.U=temps pass\u00E9 dans ce ResultSet et plus bas \=
42Z32.U=r\u00E9partition de la dur\u00E9e totale \: 
42Z33.U=dur\u00E9e du constructeur (millisecondes) \=
42Z34.U=dur\u00E9e d''ouverture (millisecondes) \=
42Z35.U=dur\u00E9e next (millisecondes) \=
42Z36.U=dur\u00E9e de fermeture (millisecondes) \=
42Z37.U=Aucun
42Z38.U=Aucune information de positionnement n''est disponible parce que ce ResultSet n''a jamais \u00E9t\u00E9 ouvert.
42Z39.U=Exception impr\u00E9vue {0} lors de l''extraction du positionneur.
42Z40.U={0} sur les premi\u00E8res {1} colonne(s).
42Z41.U=S\u00E9mantique des valeurs NULL ordonn\u00E9es dans les colonnes suivantes \: 
42Z42.U=ID de colonne
42Z43.U=Op\u00E9rateur
42Z44.U=Valeurs NULL ordonn\u00E9es
42Z45.U=Valeur de retour inconnue
42Z46.U=Inverser la fen\u00EAtre des r\u00E9sultats de la comparaison
42Z47.U=L''extraction du plan de requ\u00EAte sous forme de cha\u00EEne n''est pas prise en charge actuellement pour {0}
42Z48.U=Id de colonne[{0}][{1}]
42Z50=ERREUR INTERNE \: Impossible de g\u00E9n\u00E9rer du code pour {0}.
42Z53=ERREUR INTERNE \: le type d''activation \u00E0 g\u00E9n\u00E9rer pour le choix du noeud {0} est inconnu.
42Z54.U=Cette exception arr\u00EAte l''instruction apr\u00E8s l''analyse syntaxique - aucun autre traitement n''est requis.
42Z55.U=L''ex\u00E9cution a \u00E9t\u00E9 arr\u00EAt\u00E9e apr\u00E8s l''analyse syntaxique par l''indicateur de d\u00E9bogage StopAfterParsing.
42Z56.U=L''ex\u00E9cution a \u00E9t\u00E9 arr\u00EAt\u00E9e apr\u00E8s la liaison par l''indicateur de d\u00E9bogage StopAfterBinding.
42Z57.U=L''ex\u00E9cution a \u00E9t\u00E9 arr\u00EAt\u00E9e apr\u00E8s l''optimisation par l''indicateur de d\u00E9bogage StopAfterOptimizing.
42Z58.U=L''ex\u00E9cution a \u00E9t\u00E9 arr\u00EAt\u00E9e apr\u00E8s la g\u00E9n\u00E9ration par l''indicateur de d\u00E9bogage StopAfterGenerating.
42Z60={0} est interdit, sauf si la propri\u00E9t\u00E9 de base de donn\u00E9es {1} a pour valeur ''{2}''.
42Z70=La liaison directement une valeur XML n''est pas admise. Utilisez XMLPARSE.
42Z71=Les valeurs XML ne sont pas admises dans les ensembles de r\u00E9sultats de niveau sup\u00E9rieur. Utilisez XMLSERIALIZE.
42Z72=Le ou les mots cl\u00E9s SQL/XML ''{0}'' \u00E0 la ligne {1}, colonne {2} sont manquants.
42Z73=Type cible non valide pour XMLSERIALIZE \: ''{0}''.
42Z74=Fonction XML non prise en charge \: ''{0}''.
42Z75=L''expression de requ\u00EAte XML doit \u00EAtre un litt\u00E9ral cha\u00EEne.
42Z76=Les \u00E9l\u00E9ments contextuels multiples ne sont pas autoris\u00E9s.
42Z77=L''\u00E9l\u00E9ment contextuel doit avoir pour type ''XML''; ''{0}'' n''est pas autoris\u00E9.
42Z79=Impossible de d\u00E9terminer le type de param\u00E8tre associ\u00E9 \u00E0 XMLPARSE \: essayez d''utiliser un param\u00E8tre CAST.
42Z80.U=s\u00E9rialisable
42Z81.U=lecture valid\u00E9e
42Z82.U=exclusif
42Z83.U=partage instantan\u00E9
42Z84.U=partager
42Z85.U=table
42Z86.U=ligne
42Z87.U=partager la table
42Z88.U=partager la ligne
42Z90=La classe ''{0}'' ne renvoie pas d''ensemble de ResultSet pouvant \u00EAtre mis \u00E0 jour.
42Z91=sous-requ\u00EAte
42Z92=lecture reproductible
42Z93=Les contraintes ''{0}'' et ''{1}'' poss\u00E8dent le m\u00EAme ensemble de colonnes, ce qui n''est pas autoris\u00E9.. 
42Z97=Le changement de nom de la colonne ''{0}'' entra\u00EEnera la rupture de la contrainte de v\u00E9rification ''{1}''.
42Z99=Une cha\u00EEne ou un litt\u00E9ral hex ne peut pas d\u00E9passer 64 Ko.
42Z9A=lecture non valid\u00E9e
42Z9B=L''interface VTI (Virtual Table Interface) externe ne prend pas en charge les colonnes BLOB ou CLOB. ''{0}'' colonne ''{1}''. 
42Z9D.S.1=Les proc\u00E9dures modifiant les donn\u00E9es SQL ne sont pas autoris\u00E9es dans les d\u00E9clencheurs BEFORE.
42Z9D=Les instructions ''{0}'' ne sont pas admises dans les d\u00E9clencheurs ''{1}''.
42Z9E=La contrainte ''{0}'' n''est pas une contrainte {1}.
42Z9F=Trop d''index ({0}) pour la table {1}. La limite est {2}.  
42ZA0=Instruction trop complexe. Essayez de r\u00E9\u00E9crire la requ\u00EAte afin de la simplifier. L''\u00E9limination de nombreuses expressions en double ou la rupture de la requ\u00EAte et le stockage des r\u00E9sultats interm\u00E9diaires dans une table temporaire permettent souvent de r\u00E9soudre cette erreur.
42ZA1=Langage SQL incorrect dans le lot \: ''{0}''.
42ZA2=L''op\u00E9rande du pr\u00E9dicat LIKE dot\u00E9 du type {0} et de l''interclassement {1} est incompatible avec l''op\u00E9rande du motif LIKE de type {2} et d''interclassement {3}.
42ZA3=La table disposera du type d''interclassement {0}, lequel diff\u00E8re de l''interclassement du sch\u00E9ma {1} ; cette op\u00E9ration n''est donc pas prise en charge.
42ZB1=Le style de param\u00E8tre DERBY_JDBC_RESULT_SET est uniquement admis pour les fonctions de table.
42ZB2=Les fonctions de table peuvent uniquement avoir le style de param\u00E8tre DERBY_JDBC_RESULT_SET.
42ZB3=XML n'est pas admis comme type de donn\u00E9es d'une colonne renvoy\u00E9e par une fonction de table.
42ZB4=''{0}''.{1}'' n'identifie pas une fonction de table.
42ZB5=La classe ''{0}'' impl\u00E9mente VTICosting mais ne fournit pas de constructeur no-arg public.
43X00.U=Connect\u00E9 \u00E0
43X01.U=Num\u00E9ro de sous-requ\u00EAte de d\u00E9but
43X02.U=Tout ResultSet
43X03.U=Nombre d''ouvertures
43X04.U=Lignes affich\u00E9es
43X05.U=Ensemble de r\u00E9sultats source
43X06.U=Num\u00E9ro de sous-requ\u00EAte de fin
43X07.U=nombre de lignes estim\u00E9 par l''optimiseur
43X08.U=co\u00FBt estim\u00E9 par l''optimiseur
43X09.U=secondes
43X10.U=Total
43X11.U=Noeud
43X12.U={0} non impl\u00E9ment\u00E9 actuellement pour {1}
43X13.U=Supprimer ResultSet \u00E0 l''aide de
43X14.U=verrouillage des tables
43X15.U=verrouillage des lignes
43X16.U=mise en diff\u00E9r\u00E9
43X17.U=Lignes supprim\u00E9es
43X18.U=Index mis \u00E0 jour
43X19.U=Supprimer
43X20.U=ResultSet d''agr\u00E9gat scalaire distinct
43X21.U=Lignes entr\u00E9es
43X22.U=Agr\u00E9gat scalaire distinct
43X23.U=ResultSet d''analyse distincte pour {0} en utilisant {1} {2}
43X24.U=contrainte
43X25.U=index
43X26.U=ResultSet d''analyse distincte pour {0}
43X27.U=au niveau d''isolement {0} \u00E0 l''aide du verrouillage {1}
43X28.U=informations d''analyse
43X29.U=La colonne distincte est le num\u00E9ro de colonne
43X30.U=Les colonnes distinctes sont les num\u00E9ros de colonne
43X31.U=Taille de la table de hachage
43X32.U=Lignes filtr\u00E9es
43X33.U=dur\u00E9e next en millisecondes/ligne
43X34.U=position de d\u00E9but
43X35.U=position d''arr\u00EAt
43X36.U=qualifiants d''analyse
43X37.U=qualifiants next
43X38.U=sur {0} \u00E0 l''aide de {1}
43X39.U=Analyse distincte
43X40.U=Informations de tri
43X41.U=ResultSet d''agr\u00E9gat regroup\u00E9
43X42.U=Poss\u00E8de un agr\u00E9gat distinct
43X43.U=Par ordre de tri
43X44.U=Agr\u00E9gat regroup\u00E9
43X45.U=Jointure Exists par hachage
43X46.U=ResultSet de jointure Exists par hachage
43X47.U=Jointure par hachage
43X48.U=ResultSet de jointure par hachage
43X49.U=Jointure externe gauche par hachage
43X50.U=ResultSet de jointure externe gauche par hachage
43X51.U=ResultSet d''analyse du hachage pour {0} en utilisant {1} {2}
43X52.U=ResultSet d''analyse du hachage pour {0}
43X53.U=La cl\u00E9 de hachage est le num\u00E9ro de colonne
43X54.U=Les cl\u00E9s de hachage sont les num\u00E9ros de colonne
43X55.U=Analyse du hachage
43X56.U=Sous-requ\u00EAtes associ\u00E9es
43X57.U=ResultSet de table de hachage
43X58.U=Table de hachage
43X59.U=tous
43X60.U=ResultSet de la ligne de base vers la ligne d''index pour {0}
43X61.U=Colonnes accessible \u00E0 partir du segment de m\u00E9moire
43X62.U=pour {0}
43X63.U=Ligne de base vers ligne d''index
43X64.U=mode d''insertion \: insertion globale
43X65.U=mode d''insertion \: normal (impossible d''effectuer une insertion globale car la table est non vide)
43X66.U=mode d''insertion \: normal
43X67.U=Ins\u00E9rer ResultSet \u00E0 l''aide de
43X68.U=Lignes ins\u00E9r\u00E9es
43X69.U=Ins\u00E9rer
43X70.U=Joindre
43X71.U=ResultSet de derni\u00E8re analyse de l''index des cl\u00E9s pour {0} en utilisant l''index {1}
43X72.U=au niveau d''isolement {0} \u00E0 l''aide du verrouillage {1} choisi par l''optimiseur
43X73.U=Analyse de table
43X74.U=Analyse d''index
43X75.U=sur {0}
43X76.U=ResultSet mat\u00E9rialis\u00E9
43X77.U=dur\u00E9e de cr\u00E9ation du conglom\u00E9rat temporaire (millisecondes)
43X78.U=dur\u00E9e d''extraction du conglom\u00E9rat temporaire (millisecondes)
43X79.U=Lignes vues de la gauche
43X80.U=Lignes vues de la droite
43X81.U=Lignes renvoy\u00E9es
43X82.U=Ensemble de r\u00E9sultats de gauche
43X83.U=Ensemble de r\u00E9sultats de droite
43X84.U=Jointure Exists en boucle imbriqu\u00E9e
43X85.U=ResultSet de jointure Exists en boucle imbriqu\u00E9e
43X86.U=Jointure en boucle imbriqu\u00E9e
43X87.U=ResultSet de jointure en boucle imbriqu\u00E9e
43X88.U=Lignes de droite vides renvoy\u00E9es
43X89.U=Jointure externe gauche en boucle imbriqu\u00E9e
43X90.U=ResultSet de jointure externe gauche en boucle imbriqu\u00E9e
43X91.U=ResultSet normalis\u00E9
43X92.U=ResultSet \u00E0 valeur unique
43X93.U=ResultSet de projection-limitation
43X94.U=limitation
43X95.U=projection
43X96.U=dur\u00E9e de limitation (millisecondes)
43X97.U=dur\u00E9e de projection (millisecondes)
43X98.U=Limitation-projection
43X99.U=ResultSet de ligne
43Y00.U=ResultSet d''agr\u00E9gat scalaire
43Y01.U=Optimisation de cl\u00E9 d''index
43Y02.U=Agr\u00E9gat scalaire
43Y03.U=ResultSet insensible au d\u00E9filement
43Y04.U=Nombre de lectures \u00E0 partir de la table de hachage
43Y05.U=Nombre d''\u00E9critures dans la table de hachage
43Y06.U=ResultSet de tri
43Y07.U=Eliminer les \u00E9l\u00E9ments en double
43Y08.U=Tri
43Y09.U=ResultSet d''analyse d''index pour {0} en utilisant {1} {2}
43Y10.U=ResultSet d''analyse de table pour {0}
43Y11.U=Verrouillage effectif utilis\u00E9 \: verrouillage au niveau de la table
43Y12.U=Taille d''extraction
43Y13.U=qualifiants
43Y14.U=ResultSet d''union
43Y15.U=Union
43Y16.U=ResultSet de mise \u00E0 jour utilisant le verrouillage {0}
43Y17.U=Lignes mises \u00E0 jour
43Y18.U=Mettre \u00E0 jour
43Y19.U=ResultSet de VTI pour {0}
43Y20.U=VTI
43Y21.U=Sous-requ\u00EAtes mat\u00E9rialis\u00E9es
43Y22.U=Nom de l''instruction
43Y23.U=Texte de l''instruction
43Y24.U=Dur\u00E9e de l''analyse
43Y25.U=Dur\u00E9e de la liaison
43Y26.U=Dur\u00E9e de l''optimisation
43Y27.U=Dur\u00E9e de la g\u00E9n\u00E9ration
43Y28.U=Dur\u00E9e de la compilation
43Y29.U=Dur\u00E9e de l''ex\u00E9cution
43Y30.U=Horodatage du d\u00E9but de la compilation
43Y31.U=Horodatage de la fin de la compilation
43Y32.U=Horodatage du d\u00E9but de l''ex\u00E9cution
43Y33.U=Horodatage de la fin de l''ex\u00E9cution
43Y44.U=Texte du plan d''ex\u00E9cution de l''instruction
43Y45.U=Phase d''ex\u00E9cution 100%, {0} secondes
43Y46.U=Ins\u00E9rer le ResultSet du VTI
43Y47.U=Supprimer le ResultSet du VTI
43Y49.U=Ins\u00E9rer le VTI
43Y50.U=Supprimer le VTI
43Y51.U=Supprimer le ResultSet en cascade
43Y52.U=Supprimer le ResultSet en cascade \u00E0 l''aide de
43Y53.U=Actions de r\u00E9f\u00E9rentiel dans des tables d\u00E9pendantes
43Y54.U=D\u00E9but de l''action de r\u00E9f\u00E9rentiel dans un num\u00E9ro de table d\u00E9pendante
43Y55.U=Fin de l''action de r\u00E9f\u00E9rentiel dans un num\u00E9ro de table d\u00E9pendante
43Y56.U=Les valeurs de substitution d''optimiseur fournies par l''utilisateur pour {0} sont {1}
43Y57.U=Les substitutions d''optimiseur fournies par l''utilisateur pour effectuer une jointure sont {0}
43Y58.U=ResultSet Intersect
43Y59.U=Intersect
43Y60.U=ResultSet Except
43Y61.U=Except
44X00.U=Nom du type SQL
44X05.U=erreur suivante
46001=Exception lors de l''acc\u00E8s au fichier jar \u00E0 l''aide de l''URL ''{0}''.
46J01=La signature de m\u00E9thode Java a un format non valide.
46J02=La signature de m\u00E9thode Java contient un nombre incorrect ({0}) de param\u00E8tres, valeur {1} attendue.
54002=Une constante de cha\u00EEne commen\u00E7ant par ''{0}'' est trop longue.
54004=L''instruction SELECT contient trop d''\u00E9l\u00E9ments dans la liste select, ORDER BY ou GROUP BY.
54006=La longueur r\u00E9sultant de l''op\u00E9ration {0} est sup\u00E9rieure \u00E0 {1}.
54008=L''instruction CREATE INDEX sp\u00E9cifie un trop grand nombre de colonnes (le maximum est 16).
54011=Trop de colonnes ({0}) ont \u00E9t\u00E9 sp\u00E9cifi\u00E9es pour la table ou la vue {1}. La limite est {2}.
54023=Le nombre de param\u00E8tres maximal admis pour une proc\u00E9dure a \u00E9t\u00E9 d\u00E9pass\u00E9. La limite est de {0} et le nombre de param\u00E8tres pour la proc\u00E9dure {1} est {2}.
54038=La profondeur maximale de d\u00E9clencheurs imbriqu\u00E9s a \u00E9t\u00E9 d\u00E9pass\u00E9e.
57017.C=Aucune conversion n''est disponible pour la page de code source, {0}, vers la page de code cible, {1}.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.10=Exception de protocole r\u00E9seau \: seule l''une des longueurs VCM ou VCS peut \u00EAtre sup\u00E9rieure \u00E0 0.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.11=La connexion a \u00E9t\u00E9 ferm\u00E9e car le codage n''est pas pris en charge.
58009.C.12=Exception de protocole r\u00E9seau \: le point de code effectif, {0}, ne correspond pas au point de code pr\u00E9vu, {1}.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.13=Exception de protocole r\u00E9seau \: l''ensemble de gestionnaires de donn\u00E9es r\u00E9parties contient moins de 4 octets de donn\u00E9es.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.14=Exception de protocole r\u00E9seau \: pile de collecte non vide \u00E0 la fin de l''analyse syntaxique de la cha\u00EEne d''ID identiques.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.15=Exception de protocole r\u00E9seau \: longueur DSS non nulle \u00E0 la fin de l''analyse syntaxique de la cha\u00EEne d''ID identiques.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.16=Exception de protocole r\u00E9seau \: Le segment DDS suivant et le segment actuel de la cha\u00EEne DDS ont un ID identiques.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.17=Exception de protocole r\u00E9seau \: fin de flux pr\u00E9matur\u00E9e lors de la lecture d''InputStream, param\u00E8tre n\u00B0{0}.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.18=Exception de protocole r\u00E9seau \: FDOCA LID incorrect.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.19=Exception de protocole r\u00E9seau \: SECTKN non renvoy\u00E9.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.20=Exception de protocole r\u00E9seau \: seule l''une des valeurs NVCM ou NVCS peut \u00EAtre non nulle.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.21=Exception de protocole r\u00E9seau \: la longueur SCLDTA, {0}, est incorrecte pour RDBNAM.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.7=Exception de protocole r\u00E9seau \: la longueur SCLDTA, {0}, est incorrecte pour RDBCOLID.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.8=Exception de protocole r\u00E9seau \: la longueur SCLDTA, {0}, est incorrecte pour PKGID.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58009.C.9=Exception de protocole r\u00E9seau \: la longueur PKGNAMCSN, {0}, n''est pas valide \u00E0 SQLAM {1}.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58010.C=Une erreur de protocole r\u00E9seau s''est produite.  Impossible d''\u00E9tablir une connexion car le gestionnaire {0} de niveau {1} n''est pas pris en charge par le serveur. 
58014.C=La commande du gestionnaire de donn\u00E9es r\u00E9parties 0x{0} n''est pas prise en charge.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58015.C=L''objet du gestionnaire de donn\u00E9es r\u00E9parties 0x{0} n''est pas pris en charge.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58016.C=Le param\u00E8tre du gestionnaire de donn\u00E9es r\u00E9parties 0x{0} n''est pas pris en charge.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
58017.C=La valeur du param\u00E8tre du gestionnaire de donn\u00E9es r\u00E9parties 0x{0} n''est pas pris en charge.  Une variable h\u00F4te en entr\u00E9e ne se situe peut-\u00EAtre pas dans l''intervalle pris en charge par le serveur.  La connexion a \u00E9t\u00E9 ferm\u00E9e.
A001=FATAL \: Aucun service d''authentification n''existe pour le syst\u00E8me
A002=FATAL \: Aucun service d''authentification n''existe pour la base de donn\u00E9es
A011=AVERTISSEMENT \: Aucun nom de serveur LDAP/d''h\u00F4te n''est mentionn\u00E9 dans la propri\u00E9t\u00E9 {0} ; adoption par d\u00E9faut du syst\u00E8me h\u00F4te local\:389
A020=Authentification non valide.
C000=La classe {0} a \u00E9t\u00E9 enregistr\u00E9e dans le fichier {1}. Indiquez le fichier et les informations suivantes relatives \u00E0 l''exception au support technique \: {2}
C001=La classe {0} a un type de certificat inconnu dans le fichier JAR {1} ; le certificat X509 est escompt\u00E9.
C002=Exception de s\u00E9curit\u00E9 \u00E9mise lors de l''acc\u00E8s \u00E0 la classe {0} dans le fichier JAR {1} \: {2}
C003=Exception lors du chargement du fichier JAR de la base de donn\u00E9es {0} - {1}
C004=Chargeur de classe p\u00E9rim\u00E9 pour la classe {0}
C005=Chargeur de classe de la base de donn\u00E9es d\u00E9marr\u00E9 - derby.database.classpath\=''{0}''
C006={0} a \u00E9t\u00E9 charg\u00E9 \u00E0 partir du fichier JAR de la base de donn\u00E9es {1}
C007=Exception lors du chargement de la classe {0} \u00E0 partir du fichier JAR {1} - {2}
D001=\:\n Amor\u00E7age de Derby version {0} \: instance {1}\nsur le r\u00E9pertoire de base de donn\u00E9es {2} {3} \n
D002=\:\nArr\u00EAt de l''instance {0}
D004=La sauvegarde de la base de donn\u00E9es situ\u00E9e \u00E0 l''emplacement {0}, vers l''emplacement {1}, a commenc\u00E9.
D005=l''ancienne copie de sauvegarde a \u00E9t\u00E9 d\u00E9plac\u00E9e de {0} vers {1}
D006=La sauvegarde du segment de donn\u00E9es vers l''emplacement {0} est termin\u00E9e. 
D007=la base de donn\u00E9es service.properties a \u00E9t\u00E9 \u00E9dit\u00E9e pour utiliser l''unit\u00E9 de journalisation par d\u00E9faut
D008=erreur lors de l''\u00E9dition de la base de donn\u00E9es service.properties, abandon de la sauvegarde \: {0}
D009=le r\u00E9pertoire de journalisation a \u00E9t\u00E9 copi\u00E9 de {0} dans {1}
D010=Sauvegarde abandonn\u00E9e en raison d''une erreur
D011=l''ancienne copie de sauvegarde situ\u00E9e \u00E0 {0} a \u00E9t\u00E9 supprim\u00E9e
D012=Sauvegarde termin\u00E9e, l''instant de journalisation est situ\u00E9 \u00E0 {0} \n
D013=AVERTISSEMENT \: La base de donn\u00E9es est initialis\u00E9e avec {0}\={1}. Lorsque ce mode est utilis\u00E9, il est possible que la base de donn\u00E9es ne puisse pas \u00EAtre restaur\u00E9e, que des transactions valid\u00E9es soient perdues et que la base de donn\u00E9es soit dans un \u00E9tat incoh\u00E9rent. Utilisez ce mode uniquement lorsque ces cons\u00E9quences sont acceptables  \n
D014=en mode LECTURE SEULE
I015=org.apache.derby.jdbc.EmbeddedDriver n''est pas enregistr\u00E9 aupr\u00E8s du gestionnaire de pilotes JDBC.
I024=La base de donn\u00E9es n''est pas disponible.
I025=Pilote JDBC non disponible
I026=Echec de l''enregistrement du pilote JDBC avec java.sql.DriverManager \: {0}
J004=identit\u00E9 de la base de donn\u00E9es
J005=arr\u00EAter Derby
J007=cr\u00E9er une base de donn\u00E9es
J008=aucun d\u00E9tail
J010=chiffrer la base de donn\u00E9es sur disque
J013=mettre la base de donn\u00E9es \u00E0 niveau
J016=fournisseur de service cryptographique
J017=algorithme de cryptographie
J018=longueur de la cl\u00E9 de cryptographie
J019=cl\u00E9 de cryptographie externe
J020=cl\u00E9 de cryptographie secr\u00E8te
J021=territoire de la base de donn\u00E9es
J022=nom d''utilisateur
J023=mot de passe de l''utilisateur
J025=chemin d''acc\u00E8s du r\u00E9pertoire du fichier journal
J028=chemin de sauvegarde pour r\u00E9cup\u00E9ration aval
J031=interclassement pour les types de donn\u00E9es caract\u00E8res
J100=Impossible de trouver la classe de serveur de r\u00E9seau, {0}. Votre chemin d''acc\u00E8s aux classes doit contenir le fichier derbynet.jar.
J101=Impossible de charger la classe du serveur de r\u00E9seau, {0}. {1}  V\u00E9rifiez l''int\u00E9grit\u00E9 du fichier derbynet.jar.
J102=Une exception a \u00E9t\u00E9 \u00E9mise au cours du d\u00E9marrage du serveur de r\u00E9seau. {0}
J103=Une exception a \u00E9t\u00E9 \u00E9mise lors de l''arr\u00EAt du serveur de r\u00E9seau. {0}
J104=Cet objet est d\u00E9j\u00E0 ferm\u00E9.
J105=La pr\u00E9cision d\u00E9passe 31 chiffres \!
J106=Provoqu\u00E9 par une exception
J107=Erreur pour l''\u00E9l\u00E9ment de traitement par lot \#
J108=Le gestionnaire de s\u00E9curit\u00E9 n''autorise pas l''acc\u00E8s \u00E0 la propri\u00E9t\u00E9 syst\u00E8me {0}.
J109=Configuration client TCP/IP incorrecte d\u00E9tect\u00E9e.  Impossible de d\u00E9terminer l''adresse IP de votre h\u00F4te local \: ''{0}''.  Assurez-vous que votre machine client poss\u00E8de une adresse IP correctement configur\u00E9e.
J110=M\u00E9canisme de s\u00E9curit\u00E9 non pris en charge
J111=Mot de passe manquant
J112=ID utilisateur absent
J113=ID utilisateur ou mot de passe incorrects
J114=ID utilisateur r\u00E9voqu\u00E9
J115=Nouveau mot de passe incorrect
J116=Erreur irr\u00E9parable du service de s\u00E9curit\u00E9 locale
J117=SECTKN absent sur ACCSEC lorsqu''il est requis, ou incorrect
J118=Mot de passe expir\u00E9
J120=Non d\u00E9fini
J121=L''utilisateur n''est pas autoris\u00E9 \u00E0 acc\u00E9der \u00E0 la base de donn\u00E9es
J122=Une commande demandant des services de la base de donn\u00E9es a \u00E9t\u00E9 \u00E9mise avant celle demandant un acc\u00E8s \u00E0 la base de donn\u00E9es (ACCRDB)
J123=La commande requise a rencontr\u00E9 une condition non impl\u00E9ment\u00E9e et sp\u00E9cifique \u00E0 l''impl\u00E9mentation, pour laquelle n''existait aucun message structur\u00E9
J124=La commande d''acc\u00E8s \u00E0 la base de donn\u00E9es relationnelle (ACCRDB) ne peut \u00EAtre \u00E9mise car un acc\u00E8s \u00E0 la base de donn\u00E9es est en cours
J125=Une erreur de non-concordance de descripteur a \u00E9t\u00E9 d\u00E9tect\u00E9e.
J126=Une erreur de protocole de conversation a \u00E9t\u00E9 d\u00E9tect\u00E9e.  Motif \: 0x{0}.
J127=La m\u00E9thode parseSQLDIAGGRP n''est pas encore impl\u00E9ment\u00E9e
J128=Le curseur n''est pas ouvert
J129=Une commande Open Query a \u00E9t\u00E9 \u00E9mise pour une requ\u00EAte d\u00E9j\u00E0 ouverte
J130=Une erreur de description FDOCA incorrecte a \u00E9t\u00E9 d\u00E9tect\u00E9e
J131=Une erreur de syntaxe du flux de donn\u00E9es PROTOCOL a \u00E9t\u00E9 d\u00E9tect\u00E9e. Motif \: 0x{0}. Tenter une connexion en texte simple \u00E0 un serveur dot\u00E9 de la fonction SSL ?
J132=Le nom d''utilisateur pour la connexion
J133=Le mot de passe de l''utilisateur pour la connexion
J134=La propri\u00E9t\u00E9 maxStatements ne peut pas avoir de valeurs n\u00E9gatives \: {0}
L001=----------- DEBUT MESSAGE D''ERREUR ------------\n
L002=----------  FIN MESSAGE D''ERREUR -------------\n
L003=\n------------  DEBUT PILE D''ERREURS D''ARRET -----------\n
L004=\n------------  FIN PILE D''ERREURS D''ARRET -----------\n
L005=\n------------  DEBUT PILE D''ERREURS ----------\n
L006=\n------------  FIN PILE D''ERREURS ----------\n
L007=AVERTISSEMENT \: Fichier journal introuvable, cr\u00E9ation d''un nouveau fichier journal. Possibilit\u00E9 d''incoh\u00E9rences dans la base de donn\u00E9es.
L008=Suppression d''un ancien fichier journal incompatible {0}
L009=Suppression d''un ancien fichier journal {0}
L010=Enregistrement de journal incomplet d\u00E9tect\u00E9 dans le fichier {0} ; effacement du fichier journal de la position {1} jusqu''au signal eof \u00E0 la position {2}.
L011=Le d\u00E9mon des points de contr\u00F4le a intercept\u00E9 une exception standard.
L012=l''enregistrement de journal n''est pas premier, mais la transaction n''est pas dans la table de transaction \: {0}
L013=l''enregistrement de journal est premier, mais la transaction est d\u00E9j\u00E0 dans la table de transaction \: {0}
L014=Instant du d\u00E9part incorrect
L015=le nouveau fichier journal existe et ne peut pas \u00EAtre supprim\u00E9 {0}
L016=impossible de cr\u00E9er de nouveau fichier journal {0}
L017=impossible de cr\u00E9er de nouveau fichier journal {0} en raison de {1}
L018=Le syst\u00E8me peut se trouver dans un \u00E9tat incoh\u00E9rent ; fichier manquant {0}
L020=AVERTISSEMENT \: La base de donn\u00E9es a \u00E9t\u00E9 initialis\u00E9e au moins une fois avec {0}\={1}. Lorsque ce mode est utilis\u00E9, il est possible que la base de donn\u00E9es ne puisse pas \u00EAtre restaur\u00E9e, que des transactions valid\u00E9es soient perdues et que la base de donn\u00E9es soit dans un \u00E9tat incoh\u00E9rent. Des erreurs inattendues peuvent se produire.\n
L021=AVERTISSEMENT \: La base de donn\u00E9es a \u00E9t\u00E9 pr\u00E9c\u00E9demment initialis\u00E9e ou est actuellement initialis\u00E9e avec {0} ayant comme valeur {1}. Ce mode {0}\={1} ne garantit pas la capacit\u00E9 de reprise et peut \u00EAtre \u00E0 l''origine de l''erreur d''initialisation.\n
M001=\n\# *********************************************************************************\n\# ***                Veuillez ne PAS \u00E9diter ce fichier.                 ***\n\# *** LA MODIFICATION DE SON CONTENU PEUT ENTRAINER UNE ALTERATION DES DONNEES. ***\n\# *********************************************************************************
R001=----  MESSAGE D'ERREUR DEBUT DE REPLICATION ({0}) ----
R002=--------------------  MESSAGE D'ERREUR FIN DE REPLICATION ---------------------
R003=R\u00F4le esclave de r\u00E9plication d\u00E9marr\u00E9 pour la base de donn\u00E9es ''{0}''.
R004=Le r\u00F4le esclave de r\u00E9plication a \u00E9t\u00E9 arr\u00EAt\u00E9 pour la base de donn\u00E9es ''{0}''.
R005=L'esclave de r\u00E9plication a rencontr\u00E9 une erreur fatale pour la base de donn\u00E9es ''{0}''. La r\u00E9plication sera arr\u00EAt\u00E9e.
R006=Perte de la connexion avec le ma\u00EEtre de r\u00E9plication de la base de donn\u00E9es ''{0}''.
R007=R\u00F4le ma\u00EEtre de r\u00E9plication d\u00E9marr\u00E9 pour la base de donn\u00E9es ''{0}''.
R008=R\u00F4le ma\u00EEtre de r\u00E9plication arr\u00EAt\u00E9 pour la base de donn\u00E9es ''{0}''.
R009=Une erreur s'est produite lors de l'exp\u00E9dition du journal.
R010=Le ma\u00EEtre de r\u00E9plication essaie de se reconnecter \u00E0 l'esclave pour la base de donn\u00E9es ''{0}''.
R011=La base de donn\u00E9es esclave de r\u00E9plication ''{0}'' \u00E9coute les connexions \u00E0 partir du ma\u00EEtre sur ''{1} \:{2}''.
R012=Descripteur de connexion de r\u00E9plication invalide.
R013=Message de r\u00E9plication ({0}) \: {1}
R020=Basculement effectu\u00E9 avec succ\u00E8s pour la base de donn\u00E9es ''{0}''.
S0022=La colonne ''{0}'' est introuvable.
X0A00.S=La liste de s\u00E9lection mentionne la colonne ''{0}'' deux fois. Ceci n''est pas autoris\u00E9 dans les requ\u00EAtes contenant des clauses GROUP BY ou HAVING. Essayez d''attribuer un nom unique \u00E0 l''une des colonnes en conflit.
X0X02.S=La table ''{0}'' ne peut pas \u00EAtre verrouill\u00E9e en mode ''{1}''.
X0X03.S=Etat de transaction non valide - la conservation du curseur requiert le m\u00EAme niveau d''isolement
X0X05.S=La table/vue ''{0}'' n''existe pas.
X0X07.S=Impossible de supprimer le fichier jar ''{0}'' car il se trouve sur votre derby.database.classpath ''{0}''.
X0X0D.S=Longueur du tableau de colonnes ''{0}'' invalide. Pour renvoyer les cl\u00E9s g\u00E9n\u00E9r\u00E9es, le tableau de colonnes doit avoir une longueur de 1 et ne doit contenir que la colonne d'identit\u00E9.
X0X0E.S=La table ''{1}'' n''est pas dot\u00E9e d''une colonne \u00E0 g\u00E9n\u00E9ration automatique \u00E0 la position de colonne ''{0}''.
X0X0F.S=La table ''{1}'' n''est pas dot\u00E9e d''une colonne \u00E0 g\u00E9n\u00E9ration automatique intitul\u00E9e ''{0}''.
X0X10.S=La clause USING a renvoy\u00E9 plusieurs lignes ; seuls les ResultSets d''une seule ligne sont autoris\u00E9s.
X0X11.S=La clause USING n''a pas renvoy\u00E9 de r\u00E9sultats ; aucun param\u00E8tre ne peut \u00EAtre d\u00E9fini. 
X0X13.S=Le fichier Jar ''{0}'' n''existe pas dans le sch\u00E9ma ''{1}''.
X0X57.S=Une tentative de placement d''une valeur Java de type ''{0}'' dans une valeur SQL a \u00E9t\u00E9 effectu\u00E9e alors qu''il n''existe pas de type SQL correspondant.  La valeur Java est probablement le r\u00E9sultat d''un appel de m\u00E9thode ou de l''acc\u00E8s \u00E0 une zone.
X0X60.S=Un curseur ayant pour nom ''{0}'' existe d\u00E9j\u00E0.
X0X61.S=Les valeurs pour la colonne ''{4}'' dans l''index ''{0}'' et la table ''{1}.{2}'' ne correspondent pas \u00E0 l''emplacement de ligne {3}.  La valeur dans l''index est ''{5}'', tandis que la valeur dans la table de base est ''{6}''.  La cl\u00E9 d''index compl\u00E8te, qui comprend l''emplacement de ligne est ''{7}''.  L''intervention sugg\u00E9r\u00E9e consiste \u00E0 recr\u00E9er l''index.
X0X62.S=Incoh\u00E9rence d\u00E9tect\u00E9e entre la table ''{0}'' et l''index ''{1}''.  Erreur lors de la tentative d''extraction de l''emplacement de ligne ''{2}'' \u00E0 partir de la table.  La cl\u00E9 d''index compl\u00E8te, qui comprend l''emplacement de ligne est ''{3}''. L''intervention sugg\u00E9r\u00E9e consiste \u00E0 recr\u00E9er l''index.
X0X63.S=Exception d''E/S ''{0}''.
X0X67.S=Les colonnes de type ''{0}'' ne peuvent pas \u00EAtre utilis\u00E9es dans CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT ou DISTINCT parce que les comparaisons ne sont pas prises en charge pour ce type.
X0X81.S={0} ''{1}'' n''existe pas.
X0X85.S=L''index ''{0}'' n''a pas \u00E9t\u00E9 cr\u00E9\u00E9 parce que ''{1}'' n''est pas un type d''index valide.
X0X86.S=0 est une valeur de param\u00E8tre incorrecte pour ResultSet.absolute(int row).
X0X87.S=ResultSet.relative(int row) ne peut pas \u00EAtre appel\u00E9e lorsque le curseur n''est pas positionn\u00E9 sur une ligne.
X0X95.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre ex\u00E9cut\u00E9e sur l''objet ''{1}'' parce qu''il existe un ResultSet ouvert d\u00E9pendant de cet objet.
X0X99.S=L''index ''{0}'' n''existe pas.
X0Y16.S=''{0}'' n''est pas une vue.  S''il s''agit d''une table, utilisez plut\u00F4t DROP TABLE.
X0Y23.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre effectu\u00E9e sur l''objet ''{1}'' car VIEW ''{2}'' d\u00E9pend de cet objet.
X0Y24.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre effectu\u00E9e sur l''objet ''{1}''car STATEMENT ''{2}'' d\u00E9pend de cet objet.
X0Y25.S=L''op\u00E9ration ''{0}'' ne peut pas \u00EAtre effectu\u00E9e sur l''objet ''{1}'' car {2} ''{3}'' d\u00E9pend de cet objet.
X0Y26.S=L''index ''{0}'' doit se trouver dans le m\u00EAme sch\u00E9ma que la table ''{1}''.
X0Y28.S=L''index ''{0}'' ne peut pas \u00EAtre cr\u00E9\u00E9 sur une table syst\u00E8me ''{1}''.  Les utilisateurs ne peuvent pas cr\u00E9er d''index sur les tables syst\u00E8me.
X0Y32.S={0} ''{1}'' existe d\u00E9j\u00E0 dans {2} ''{3}''.
X0Y38.S=Impossible de cr\u00E9er l''index ''{0}'' car la table ''{1}'' n''existe pas.
X0Y41.S=La contrainte ''{0}'' n''est pas valide car la table r\u00E9f\u00E9renc\u00E9e {1} ne comporte aucune cl\u00E9 primaire.  Vous pouvez soit ajouter une cl\u00E9 primaire \u00E0 {1} soit sp\u00E9cifier explicitement les colonnes d''une contrainte unique \u00E0 laquelle cette cl\u00E9 externe fait r\u00E9f\u00E9rence. 
X0Y42.S=La contrainte ''{0}'' n''est pas valide \: les types des colonnes de cl\u00E9s externes ne correspondent pas aux types des colonnes r\u00E9f\u00E9renc\u00E9es.
X0Y43.S=La contrainte ''{0}'' n''est pas valide \: le nombre de colonnes de {0} ({1}) ne correspond pas au nombre de colonnes de la cl\u00E9 r\u00E9f\u00E9renc\u00E9 ({2}).
X0Y44.S=La contrainte ''{0}'' n''est pas valide \: aucune contrainte de cl\u00E9 unique ou primaire de la table ''{1}'' ne correspond au nombre et aux types des colonnes de la cl\u00E9 externe.
X0Y45.S=La contrainte de cl\u00E9 externe ''{0}'' ne peut pas \u00EAtre ajout\u00E9e ni activ\u00E9e dans la table {1} parce qu''une ou plusieurs cl\u00E9s externes ne poss\u00E8dent pas de cl\u00E9s r\u00E9f\u00E9renc\u00E9es correspondantes.  
X0Y46.S=La contrainte ''{0}'' n''est pas valide \: la table r\u00E9f\u00E9renc\u00E9e {1} n''existe pas.
X0Y54.S=Le sch\u00E9ma ''{0}'' ne peut pas \u00EAtre supprim\u00E9 parce qu''il n''est pas vide.
X0Y55.S=Le nombre de lignes de la table de base ne correspond pas au nombre de lignes d''au moins 1 des index de la table. L''index''{0}'' de la table ''{1}.{2}'' comprend {3} lignes mais la table de base en comprend {4}.  L''intervention sugg\u00E9r\u00E9e consiste \u00E0 recr\u00E9er l''index.
X0Y56.S=''{0}'' n''est pas autoris\u00E9 sur la table syst\u00E8me ''{1}''.
X0Y57.S=Une colonne n''acceptant pas de valeurs NULL ne peut pas \u00EAtre ajout\u00E9e \u00E0 la table ''{0}'' \u00E9tant donn\u00E9 que la table contient au moins une ligne. Les colonnes n''acceptant pas de valeurs NULL peuvent uniquement \u00EAtre ajout\u00E9es \u00E0 des tables vides.
X0Y58.S=La tentative d''ajout d''une contrainte de cl\u00E9 primaire \u00E0 la table ''{0}'' a \u00E9chou\u00E9 parce que la table contient d\u00E9j\u00E0 une contrainte de ce type.  Une table ne peut avoir qu''une seule contrainte de cl\u00E9 primaire.
X0Y59.S=La tentative d''ajout ou d''activation d''une ou plusieurs contraintes sur la table ''{1}'' a \u00E9chou\u00E9 parce que la table contient {2} ligne(s) qui violent la ou les contraintes de v\u00E9rification suivantes \: {0}.
X0Y63.S=La commande sur la table ''{0}'' n''a pas abouti car des donn\u00E9es NULL dans une ou plusieurs colonnes d''index/de contrainte de cl\u00E9 primaire ou unique. Toutes les colonnes d''une cl\u00E9 d''index primaire ou unique ne doivent pas comporter de valeurs non nulles.  
X0Y66.S=Impossible d''\u00E9mettre une validation dans une connexion imbriqu\u00E9e dont la connexion parent contient une op\u00E9ration en attente.
X0Y67.S=Impossible d''\u00E9mettre une annulation dans une connexion imbriqu\u00E9e dont la connexion parent contient une op\u00E9ration en attente.
X0Y68.S={0} ''{1}'' existe d\u00E9j\u00E0.
X0Y69.S={1} n''est pas pris en charge dans le d\u00E9clencheur {0}.
X0Y70.S=INSERT, UPDATE et DELETE ne sont pas autoris\u00E9s sur la table {1} parce que le d\u00E9clencheur {0} est actif.
X0Y71.S=La manipulation de transaction, telle que SET ISOLATION, n''est pas autoris\u00E9e parce que le d\u00E9clencheur {0} est actif.
X0Y72.S=Une op\u00E9ration d''insertion/remplacement globale n''est pas autoris\u00E9e  sur ''{0}'' parce qu''il contient un d\u00E9clencheur activ\u00E9 ({1}).
X0Y77.S=Impossible d''\u00E9mettre une instruction SET TRANSACTION ISOLATION sur une transaction globale qui est en cours car cela entra\u00EEnerait implicitement la validation de la transaction globale.
X0Y78.S.1=La m\u00E9thode {0}.executeQuery() ne peut \u00EAtre appel\u00E9e car plusieurs ensembles de r\u00E9sultats ont \u00E9t\u00E9 renvoy\u00E9s.  Utilisez {1}.execute() pour obtenir plusieurs r\u00E9sultats.
X0Y78.S.2=La m\u00E9thode {0}.executeQuery() a \u00E9t\u00E9 appel\u00E9e, mais aucun ensemble de r\u00E9sultats n''a \u00E9t\u00E9 renvoy\u00E9. Utilisez la m\u00E9thode {1}.executeUpdate() pour les \u00E9l\u00E9ments qui ne sont pas des requ\u00EAtes.
X0Y78.S=Statement.executeQuery() ne peut pas \u00EAtre appel\u00E9e avec une instruction qui renvoie un nombre de lignes.
X0Y79.S=Statement.executeUpdate() ne peut pas \u00EAtre appel\u00E9e avec une instruction qui renvoie un ResultSet.
X0Y80.S=Echec de l''op\u00E9ration ALTER sur la table ''{0}''. Des donn\u00E9es NULL ont \u00E9t\u00E9 trouv\u00E9es dans la colonne ''{1}''.
X0Y83.S=AVERTISSEMENT \: Lors de la suppression d''une ligne d''une table, la ligne d''index correspondant \u00E0 la ligne de la table de base {0} n''a pas \u00E9t\u00E9 trouv\u00E9e dans l''index avec l''ID de conglom\u00E9rat {1}.  Ce probl\u00E8me a \u00E9t\u00E9 corrig\u00E9 automatiquement dans le cadre de l''op\u00E9ration de suppression.
XBCA0.S=Impossible de cr\u00E9er un objet avec la cl\u00E9 {1} dans la {0}. L''objet existe d\u00E9j\u00E0 dans la cache. 
XBCM1.S=Erreur de liaison Java \u00E9mise au cours du chargement de la classe g\u00E9n\u00E9r\u00E9e {0}.
XBCM2.S=Impossible de cr\u00E9er une instance de la classe g\u00E9n\u00E9r\u00E9e {0}.
XBCM3.S=La m\u00E9thode {1}() n''existe pas dans la classe g\u00E9n\u00E9r\u00E9e {0}.
XBCM4.S=Limite(s) du format de fichier de la classe Java d\u00E9pass\u00E9e(s) \: {1} dans la classe g\u00E9n\u00E9r\u00E9e {0}.
XBCX0.S=Exception provenant du fournisseur de chiffrement. Pour plus de d\u00E9tails, reportez-vous \u00E0 l''exception suivante.
XBCX1.S=Initialisation du code de chiffrement dans un mode non admis ; ce mode doit \u00EAtre soit ENCRYPT, soit DECRYPT.
XBCX2.S=Initialisation du code de chiffrement avec un mot de passe d''amor\u00E7age trop court. Le mot de passe doit comporter au moins {0}.    
XBCX5.S=Impossible de modifier le mot de passe d''amor\u00E7age pour lui affecter la valeur null.
XBCX6.S=Impossible de modifier le mot de passe d''amor\u00E7age en un type s\u00E9rialisable qui ne soit pas de type cha\u00EEne.
XBCX7.S=Format incorrect pour modifier le mot de passe d''amor\u00E7age.  Le format suivant doit \u00EAtre utilis\u00E9 \: ancien_motdepasse_amor\u00E7age, nouveau_motdepasse_amor\u00E7age.
XBCX8.S=Impossible de modifier le mot de passe d''amor\u00E7age pour une base de donn\u00E9es non chiffr\u00E9e.
XBCX9.S=Impossible de modifier le mot de passe d''amor\u00E7age pour une base de donn\u00E9es en lecture seule.  
XBCXA.S=Mot de passe d''amor\u00E7age incorrect.
XBCXB.S=Remplissage de chiffrement incorrect ''{0}'' ou remplissage non sp\u00E9cifi\u00E9. Vous devez utiliser ''NoPadding'' (pas de remplissage).
XBCXC.S=L''algorithme de chiffrement ''{0}'' n''existe pas. V\u00E9rifiez que le fournisseur choisi ''{1}'' prend en charge cet algorithme.
XBCXD.S=L''algorithme de chiffrement ne peut pas \u00EAtre modifi\u00E9 une fois que la base de donn\u00E9es est cr\u00E9\u00E9e.
XBCXE.S=Le fournisseur de chiffrement ne peut pas \u00EAtre modifi\u00E9 une fois que la base de donn\u00E9es est cr\u00E9\u00E9e.
XBCXF.S=La classe ''{0}'' qui repr\u00E9sente le fournisseur de chiffrement est introuvable.
XBCXG.S=Le fournisseur de chiffrement ''{0}'' n''existe pas.
XBCXH.S=L''algorithme de chiffrement ''{0}'' n''est pas au format correct. Le format correct est algorithme/modeCommentaires/PasdeRemplissage.
XBCXI.S=Le mode commentaires ''{0}'' n''est pas pris en charge. Les modes commentaires pris en charge sont CBC, CFB, OFB et ECB.
XBCXJ.S=L''application utilise une version de Java Cryptography Extension (JCE) ant\u00E9rieure \u00E0 1.2.1.  Effectuez la mise \u00E0 niveau vers JCE 1.2.1 puis recommencez l''op\u00E9ration.    
XBCXK.S=La cl\u00E9 de chiffrement donn\u00E9e ne concorde pas avec celle qui est utilis\u00E9e lors de la cr\u00E9ation de la base de donn\u00E9es. V\u00E9rifiez que vous utilisez la cl\u00E9 de chiffrement correcte et faites une nouvelle tentative. 
XBCXL.S=La proc\u00E9dure de v\u00E9rification de la cl\u00E9 de chiffrement n''a pas abouti. Cette situation peut \u00EAtre due au fait qu''une erreur s''est produite lors de l''acc\u00E8s au fichier appropri\u00E9 pour la proc\u00E9dure de v\u00E9rification.  Pour plus de d\u00E9tails, reportez-vous \u00E0 l''exception suivante.  
XBCXM.S=La longueur de la cl\u00E9 de chiffrement externe doit \u00EAtre un nombre pair.
XBCXN.S=La cl\u00E9 de chiffrement externe contient un ou plusieurs caract\u00E8res interdits. Les caract\u00E8res autoris\u00E9s pour un nombre hexad\u00E9cimal sont 0 \u00E0 9, a \u00E0 f et A \u00E0 F.
XBCXO.S=Impossible de chiffrer la base de donn\u00E9es lorsqu''une transaction globale est dans l''\u00E9tat pr\u00E9par\u00E9.
XBCXP.S=Impossible de chiffrer \u00E0 nouveau la base de donn\u00E9es avec un nouveau mot de passe d''amor\u00E7age ou une cl\u00E9 de chiffrement externe lorsqu''une transaction est dans l''\u00E9tat pr\u00E9par\u00E9.
XBCXQ.S=Impossible de configurer une base de donn\u00E9es en lecture seule pour le chiffrement.
XBCXR.S=Impossible de chiffrer \u00E0 nouveau une base de donn\u00E9es avec un nouveau mot de passe d''amor\u00E7age ou une cl\u00E9 de chiffrement externe.
XBCXS.S=Impossible de configurer une base de donn\u00E9es pour le chiffrement lorsque la base de donn\u00E9es est en mode d''archivage de journaux.
XBCXT.S=Impossible de chiffrer \u00E0 nouveau une base de donn\u00E9es avec un nouveau mot de passe d''amor\u00E7age ou une cl\u00E9 de chiffrement externe lorsque la base de donn\u00E9es est en mode d''archivage de journaux.
XBCXU.S=Echec du chiffrement d''une base de donn\u00E9es non chiffr\u00E9e \: {0}
XBCXV.S=Echec du chiffrement d''une base de donn\u00E9es chiffr\u00E9e avec une nouvelle cl\u00E9 ou un nouveau mot de passe \: {0}
XBM01.D=Echec du d\u00E9marrage d\u00FB \u00E0 une exception. Pour plus de d\u00E9tails, reportez-vous \u00E0 l''exception suivante. 
XBM02.D=Echec du d\u00E9marrage en raison d''une fonctionnalit\u00E9 absente pour {0}. Assurez-vous que votre chemin de classes contient les logiciels Derby appropri\u00E9s.
XBM03.D=La valeur ''{0}'' fournie pour l''attribut d''interclassement est incorrecte, la valeur attendue \u00E9tant UCS_BASIC ou TERRITORY_BASED.
XBM04.D=La prise en charge de la fonction d'interclassement n'est pas disponible \u00E0 partir de la JVM pour le param\u00E8tre r\u00E9gional de la base de donn\u00E9es ''{0}''.
XBM05.D=Echec du d\u00E9marrage en raison d''informations absentes sur la version du produit pour {0}.
XBM06.D=Echec du d\u00E9marrage. Il est impossible d''acc\u00E9der \u00E0 une base de donn\u00E9es chiffr\u00E9e sans le mot de passe d''amor\u00E7age appropri\u00E9.  
XBM07.D=Echec du d\u00E9marrage. Le mot de passe d''amor\u00E7age doit avoir une longueur maximale de huit octets.
XBM08.D=Impossible d''instancier la classe {0} StorageFactory {1}.
XBM0G.D=Echec du d\u00E9marrage du moteur de chiffrement. Assurez-vous que vous ex\u00E9cutez Java 2 et que vous avez t\u00E9l\u00E9charg\u00E9 un fournisseur de chiffrement tel que jce et que vous l''avez plac\u00E9 dans votre chemin de classes. 
XBM0H.D=Impossible de cr\u00E9er le r\u00E9pertoire {0}.
XBM0I.D=Impossible de supprimer le r\u00E9pertoire {0}.
XBM0J.D=Le r\u00E9pertoire {0} existe d\u00E9j\u00E0.
XBM0K.D=Sous-protocole inconnu pour le nom de la base de donn\u00E9es {0}.
XBM0L.D=La classe de m\u00E9thode d''authentification sp\u00E9cifi\u00E9e {0} n''impl\u00E9mente pas l''interface d''authentification {1}.
XBM0M.D=Une erreur s''est produite lors de la cr\u00E9ation d''une instance de la classe de m\u00E9thode d''authentification {0}.
XBM0N.D=Echec de l''enregistrement du pilote JDBC dans java.sql.DriverManager. Pour plus de d\u00E9tails, reportez-vous \u00E0 l''exception suivante. 
XBM0P.D=Le fournisseur de services est en lecture seule. L''op\u00E9ration n''est pas autoris\u00E9e. 
XBM0Q.D=Fichier {0} introuvable. Assurez-vous que la copie de sauvegarde est la bonne et qu''elle n''est pas alt\u00E9r\u00E9e.
XBM0R.D=Impossible de supprimer le fichier {0}.  
XBM0S.D=Impossible de renommer le fichier ''{0}'' en ''{1}''
XBM0T.D=Sous-protocole ambigu pour le nom de la base de donn\u00E9es {0}.   
XBM0U.S=Aucune classe n''a \u00E9t\u00E9 enregistr\u00E9e pour l''identificateur {0}.
XBM0V.S=Une exception a \u00E9t\u00E9 \u00E9mise lors du chargement de la classe {1} enregistr\u00E9e pour l''identificateur {0}.
XBM0W.S=Une exception a \u00E9t\u00E9 \u00E9mise lors de la cr\u00E9ation d''une instance de la classe {1} enregistr\u00E9e pour l''identificateur {0}.
XBM0X.D=La description d''environnement du territoire fournie ''{0}'' n''est pas valide ; ln[_CO[_variant]] doit \u00EAtre indiqu\u00E9\nln\=code de langue ISO-639 en minuscules et en deux lettres, CO\=codes pays ISO-3166 en majuscules et en deux lettres, voir java.util.Locale.
XBM0Y.D=Le r\u00E9pertoire de sauvegarde de la base de donn\u00E9es {0} est introuvable. Assurez-vous que le chemin de sauvegarde indiqu\u00E9 est correct.
XBM0Z.D=Impossible de copier le fichier ''{0}'' dans ''{1}''. Assurez-vous que l''espace est suffisant et que les droits d''acc\u00E8s sont corrects. 
XCL01.S=L''ensemble de r\u00E9sultats ne renvoie pas de lignes. L''op\u00E9ration {0} n''est pas autoris\u00E9e. 
XCL05.S=L''activation est ferm\u00E9e, l''op\u00E9ration {0} n''est pas autoris\u00E9e.
XCL07.S=Le curseur ''{0}'' est ferm\u00E9. V\u00E9rifiez que la fonction de validation automatique est d\u00E9sactiv\u00E9e (OFF).
XCL08.S=Le curseur ''{0}'' ne se trouve pas sur une ligne.
XCL09.S=Une activation qui ne correspond pas \u00E0 l''instruction pr\u00E9par\u00E9e (PreparedStatement) a \u00E9t\u00E9 transmise \u00E0 la m\u00E9thode ''{0}''.
XCL10.S=Une instruction pr\u00E9par\u00E9e (PreparedStatement) a \u00E9t\u00E9 recompil\u00E9e et les param\u00E8tres ont chang\u00E9. Si vous utilisez JDBC, vous devez de nouveau pr\u00E9parer l''instruction.  
XCL12.S=Une tentative de placement d''une valeur de donn\u00E9es de type ''{0}'' dans une valeur de donn\u00E9es de type ''{1}'' a \u00E9t\u00E9 effectu\u00E9e.
XCL13.S=La position de param\u00E8tre ''{0}'' est en dehors des limites.  Le nombre de param\u00E8tres pour cette instruction pr\u00E9par\u00E9e est ''{1}''.
XCL14.S=La position de colonne ''{0}'' est en dehors des limites.  Le nombre de colonnes de ce ResultSet est ''{1}''.
XCL15.S=Une exception ClassCastException s''est produite lors de l''appel de la m\u00E9thode compareTo() sur un objet ''{0}''.  Le param\u00E8tre pour compareTo() est de classe ''{1}''.
XCL16.S.0=L''\u00E9l\u00E9ment ResultSet n''est pas ouvert. L''op\u00E9ration ''{0}'' n''est pas autoris\u00E9e. V\u00E9rifiez que la fonction de validation automatique est d\u00E9sactiv\u00E9e (OFF).
XCL16.S.1=L''\u00E9l\u00E9ment ResultSet n''est pas ouvert.  V\u00E9rifiez que la fonction de validation automatique est d\u00E9sactiv\u00E9e (OFF).
XCL17.S=Instruction non autoris\u00E9e dans cette base de donn\u00E9es.
XCL18.S=Le flux de valeurs de la colonne du r\u00E9sultat ne peut pas \u00EAtre extrait deux fois
XCL19.S=Ligne manquante dans la table ''{0}'' pour la cl\u00E9 ''{1}''.
XCL20.S=Les catalogues dont le niveau de version est ''{0}'' ne peuvent pas \u00EAtre mis \u00E0 niveau vers le niveau de version ''{1}''.
XCL21.S=Vous essayez d''ex\u00E9cuter une instruction de d\u00E9finition de donn\u00E9es (CREATE, DROP ou ALTER) tandis que vous pr\u00E9parez une instruction diff\u00E9rente. Cette op\u00E9ration n''est pas admise. Cette situation peut se produire si vous ex\u00E9cutez une instruction de d\u00E9finition de donn\u00E9es \u00E0 partir d''un initialiseur statique d''une classe Java qui est en cours d''utilisation depuis une instruction SQL.
XCL22.S=Le param\u00E8tre {0} ne peut pas \u00EAtre enregistr\u00E9 en tant que param\u00E8tre OUT car il s''agit d''un param\u00E8tre IN. 
XCL23.S=Le type SQL num\u00E9ro ''{0}'' n''est pas un type pris en charge par registerOutParameter().
XCL24.S=Le param\u00E8tre {0} semble \u00EAtre un param\u00E8tre de sortie, mais il n''a pas \u00E9t\u00E9 d\u00E9sign\u00E9 ainsi par registerOutParameter().  S''il ne s''agit pas d''un param\u00E8tre de sortie, alors il doit \u00EAtre d\u00E9fini sur le type {1}.
XCL25.S=Le param\u00E8tre {0} ne peut pas \u00EAtre enregistr\u00E9 pour \u00EAtre de type {1} parce qu''il est mapp\u00E9 vers le type {2} et qu''ils sont incompatibles.
XCL26.S=Le param\u00E8tre {0} n''est pas un param\u00E8tre de sortie.
XCL27.S=Les param\u00E8tres de sortie en renvoi ne peuvent pas \u00EAtre d\u00E9finis.
XCL30.S=Une exception d''E/S a \u00E9t\u00E9 \u00E9mise lors de la lecture d''un ''{0}'' \u00E0 partir d''un InputStream.
XCL31.S=Instruction ferm\u00E9e.
XCL33.S=La table ne peut pas \u00EAtre d\u00E9finie comme \u00E9tant d\u00E9pendante de la table {0} en raison des limitations de la r\u00E8gle de suppression. (La relation est auto-r\u00E9f\u00E9renc\u00E9e et ce type de relation est d\u00E9j\u00E0 associ\u00E9 \u00E0 la r\u00E8gle de suppression SET NULL.) 
XCL34.S=La table ne peut pas \u00EAtre d\u00E9finie comme \u00E9tant d\u00E9pendante de la table {0} en raison des limitations de la r\u00E8gle de suppression. La relation engendre un cycle de deux ou plusieurs tables qui \u00E9tablit une d\u00E9pendance en cas de suppression entre chaque table (toutes les autres r\u00E8gles de suppression du cycle sont en CASCADE).  
XCL35.S=La table ne peut pas \u00EAtre d\u00E9finie comme \u00E9tant d\u00E9pendante de la table {0} en raison des limitations de la r\u00E8gle de suppression. Dans le cadre de la relation, une d\u00E9pendance en cas de suppression s''\u00E9tablit entre cette table et la table indiqu\u00E9e en vertu de plusieurs relations et la r\u00E8gle de suppression de la relation existante est SET NULL.  
XCL36.S=La r\u00E8gle de suppression de la cl\u00E9 externe doit \u00EAtre {0}. La contrainte r\u00E9f\u00E9rentielle est auto-r\u00E9f\u00E9renc\u00E9e et une contrainte de ce type est d\u00E9j\u00E0 associ\u00E9e \u00E0 la r\u00E8gle de suppression indiqu\u00E9e (NO ACTION, RESTRICT ou CASCADE).
XCL37.S=La r\u00E8gle de suppression de la cl\u00E9 externe doit \u00EAtre {0}. La contrainte r\u00E9f\u00E9rentielle est auto-r\u00E9f\u00E9renc\u00E9e et la table est d\u00E9pendante dans le cadre d''une relation avec la r\u00E8gle de suppression CASCADE.
XCL38.S=la r\u00E8gle de suppression de la cl\u00E9 externe doit \u00EAtre {0}. Dans le cadre de la relation, une d\u00E9pendance en cas de suppression est \u00E9tablie entre cette table et une table identique en vertu de plusieurs relations qui doivent \u00EAtre associ\u00E9es \u00E0 la m\u00EAme r\u00E8gle de suppression (NO ACTION, RESTRICT ou CASCADE). 
XCL39.S=La r\u00E8gle de suppression de la cl\u00E9 primaire ne peut pas \u00EAtre CASCADE. Une contrainte auto-r\u00E9f\u00E9renc\u00E9e associ\u00E9e \u00E0 une r\u00E8gle de suppression SET NULL, NO ACTION ou RESTRICT existe d\u00E9j\u00E0. 
XCL40.S=La r\u00E8gle de suppression de la cl\u00E9 primaire ne peut pas \u00EAtre CASCADE. La relation engendre un cycle \u00E9tablissant une d\u00E9pendance en cas de suppression de la table avec elle-m\u00EAme. Etant donn\u00E9 que l''une des r\u00E8gles de suppression du cycle n''est pas CASCADE, cette relation peut \u00EAtre d\u00E9finie. 
XCL41.S=la r\u00E8gle de suppression de la cl\u00E9 primaire ne peut pas \u00EAtre CASCADE. Dans le cadre de la relation, une d\u00E9pendance en cas de suppression est \u00E9tablie entre une autre table et la m\u00EAme table par le biais de plusieurs chemins associ\u00E9s \u00E0 des r\u00E8gles de suppression diff\u00E9rentes ou \u00E0 une r\u00E8gle de suppression SET NULL.) 
XCL42.S=CASCADE
XCL43.S=SET NULL
XCL44.S=RESTRICT
XCL45.S=NO ACTION
XCL46.S=SET DEFAULT
XCL47.S=L''utilisation de ''{0}'' requiert que la base de donn\u00E9es soit mise \u00E0 niveau de la version {1} vers la version {2} ou ult\u00E9rieure.
XCL48.S=L''instruction TRUNCATE TABLE n''est pas autoris\u00E9e sur ''{0}'' parce que sur cette table, des contraintes de cl\u00E9s uniques/primaires sont r\u00E9f\u00E9renc\u00E9s par des contraintes de cl\u00E9s externes activ\u00E9es \u00E0 partir d''autres tables. 
XCL49.S=L''instruction TRUNCATE TABLE n''est pas autoris\u00E9e sur ''{0}'' parce qu''elle contient un d\u00E9clencheur DELETE activ\u00E9 ({1}).
XCL50.S=La mise \u00E0 niveau de la base de donn\u00E9es \u00E0 partir d''une version ant\u00E9rieure n''est pas prise en charge.  Le niveau de version de la base de donn\u00E9es est ''{0}'' et celui du logiciel est ''{1}''.    
XCL51.S=La fonction demand\u00E9e ne peut pas faire r\u00E9f\u00E9rence \u00E0 des tables du sch\u00E9ma SESSION.
XCL52.S=Cette instruction a \u00E9t\u00E9 annul\u00E9e ou interrompue.
XCL53=Flux ferm\u00E9
XCW00.D=Mise \u00E0 niveau de ''{0}'' vers ''{1}'' non prise en charge.
XCXA0.S=Identificateur non valide.
XCXB0.S=Chemin d''acc\u00E8s aux classes de base de donn\u00E9es non valide \: ''{0}''.
XCXC0.S=Liste d''ID non valide.
XCXE0.S=Vous essayez d''effectuer une op\u00E9ration qui utilise le territoire de la base de donn\u00E9es, mais cette derni\u00E8re ne poss\u00E8de pas encore de territoire.
XCY00.S=Valeur non valide pour la propri\u00E9t\u00E9 ''{0}''\=''{1}''.
XCY02.S=La modification de propri\u00E9t\u00E9 demand\u00E9e n''est pas prise en charge ''{0}''\=''{1}''.
XCY03.S=La propri\u00E9t\u00E9 requise ''{0}'' n''a pas \u00E9t\u00E9 d\u00E9finie.
XCY04.S=Syntaxe non valide pour les substitutions d''optimiseurs. La syntaxe devrait \u00EAtre la suivante \: -- DERBY-PROPERTIES NomDePropri\u00E9t\u00E9 \= valeur [, NomDePropri\u00E9t\u00E9 \= valeur]*
XCZ00.S=Droit d''acc\u00E8s ''{0}'' inconnu.
XCZ01.S=Utilisateur inconnu ''{0}''.
XCZ02.S=Param\u00E8tre non valide ''{0}''\=''{1}''.
XD003.S=Impossible de restaurer la d\u00E9pendance \u00E0 partir du disque. DependableFinder \= ''{0}''. Informations suppl\u00E9mentaires \: ''{1}''.
XD004.S=Impossible de stocker les d\u00E9pendances.
XIE01.S=La connexion \u00E9tait nulle.
XIE03.S=Donn\u00E9es trouv\u00E9es sur la ligne {0} pour la colonne {1} apr\u00E8s le d\u00E9limiteur d''arr\u00EAt.  
XIE04.S=Fichier de donn\u00E9es introuvable \: {0}
XIE05.S=Le fichier de donn\u00E9es ne peut pas \u00EAtre null. 
XIE06.S=Le nom de l''entit\u00E9 \u00E9tait nul.
XIE07.S=Les s\u00E9parateurs de zone et d''enregistrements ne peuvent pas \u00EAtre des sous-cha\u00EEnes les uns des autres. 
XIE08.S=Il n''existe aucune colonne nomm\u00E9e \: {0}.  
XIE09.S=Le nombre total de colonnes dans la ligne est \: {0}.  
XIE0B.S=La colonne ''{0}'' de la table est de type {1} et n''est pas pris en charge par les fonctions d''importation et d''exportation.   
XIE0D.S=Impossible de trouver le s\u00E9parateur d''enregistrement sur la ligne {0}.
XIE0E.S=Fin de fichier lue en un point inattendu de la ligne {0}.
XIE0I.S=Une exception d''E/S s''est produite lors de l''\u00E9criture de donn\u00E9es dans le fichier.
XIE0J.S=Un d\u00E9limiteur n''est pas valide ou est utilis\u00E9 plusieurs fois.
XIE0K.S=Le point a \u00E9t\u00E9 sp\u00E9cifi\u00E9 comme d\u00E9limiteur de cha\u00EEne de caract\u00E8res.
XIE0M.S=La table ''{0}'' n''existe pas.  
XIE0N.S=Une cha\u00EEne hexad\u00E9cimale ''{0}'' non valide a \u00E9t\u00E9 d\u00E9tect\u00E9e dans le fichier d''importation.
XIE0P.S=Le fichier de donn\u00E9es lob {0} r\u00E9f\u00E9renc\u00E9 dans le fichier d''importation est introuvable.
XIE0Q.S=Le nom du fichier de donn\u00E9es lob ne peut pas \u00EAtre nul. 
XIE0R.S=Erreur d''importation sur la ligne {0} du fichier {1} \: {2} 
XIE0S.S=L''op\u00E9ration d''exportation n''a pas eu lieu, car le fichier de sortie sp\u00E9cifi\u00E9 ({0}) existe d\u00E9j\u00E0. Pour des raisons de s\u00E9curit\u00E9 et pour \u00E9viter tout risque accidentel d''endommager un fichier, la proc\u00E9dure d''exportation n''\u00E9crase pas un fichier existant, m\u00EAme si le processus dispose des droits d''\u00E9criture sur le fichier en question. Soit vous modifiez le nom du fichier de sortie dans les arguments de la proc\u00E9dure d''exportation afin qu''il diff\u00E8re de tout fichier existant, soit vous supprimez le fichier existant avant de recommencer l''op\u00E9ration d''exportation.
XIE0T.S=L''op\u00E9ration d''exportation n''a pas eu lieu, car le fichier auxiliaire d''objet volumineux sp\u00E9cifi\u00E9 ({0}) existe d\u00E9j\u00E0. Pour des raisons de s\u00E9curit\u00E9 et pour \u00E9viter tout risque accidentel d''endommager un fichier, la proc\u00E9dure d''exportation n''\u00E9crase pas un fichier existant, m\u00EAme si le processus dispose des droits d''\u00E9criture sur le fichier en question. Soit vous modifiez le nom du fichier auxiliaire d''objet volumineux dans les arguments de la proc\u00E9dure d''exportation afin qu''il diff\u00E8re de tout fichier existant, soit vous supprimez le fichier existant avant de recommencer l''op\u00E9ration d''exportation.
XJ001.U=Exception Java \: ''{1}\: {0}''.
XJ004.C=Impossible de trouver la base de donn\u00E9es ''{0}''.
XJ008.S=Impossible d''annuler ou d''\u00E9diter un point de sauvegarde en mode valider automatiquement.
XJ009.S=Utilisation de CallableStatement requise pour un appel de proc\u00E9dure stock\u00E9e ou l''utilisation de param\u00E8tres de sortie \: {0}
XJ010.S=Impossible de g\u00E9n\u00E9rer un point de sauvegarde lorsque autoCommit est activ\u00E9.
XJ011.S=Impossible de transmettre une valeur null comme nom du point de sauvegarde.
XJ012.S=''{0}'' est d\u00E9j\u00E0 ferm\u00E9.
XJ013.S=Aucun ID pour les points de sauvegarde nomm\u00E9s.
XJ014.S=Aucun nom pour les points de sauvegarde dont le nom n''est pas indiqu\u00E9.
XJ015.M=Arr\u00EAt du syst\u00E8me Derby.
XJ016.S=La m\u00E9thode ''{0}'' n''est pas autoris\u00E9e sur une instruction pr\u00E9par\u00E9e.
XJ017.S=Aucune commande savepoint autoris\u00E9e dans le code de d\u00E9clenchement.
XJ018.S=Le nom de colonne ne peut pas \u00EAtre nul.
XJ020.S=Le type d''objet n''est pas convertible en TYPE ''{0}'', la valeur java.sql.Types est incorrecte ou l''objet \u00E9tait null.
XJ021.S=Ce type n''est pas pris en charge.
XJ022.S=Impossible de d\u00E9finir le flux \: ''{0}''.
XJ023.S=Le flux en entr\u00E9e ne comprenait pas exactement la m\u00EAme quantit\u00E9 de donn\u00E9es que la longueur requise.
XJ025.S=La longueur du flux en entr\u00E9e ne peut pas \u00EAtre n\u00E9gative.
XJ028.C=L''URL ''{0}'' n''est pas au format correct.
XJ030.S=Impossible de d\u00E9finir AUTOCOMMIT sur ON dans une connexion imbriqu\u00E9e.
XJ040.C=Echec du d\u00E9marrage de la base de donn\u00E9es ''{0}'' ; pour plus de d\u00E9tails, voir l''exception suivante.
XJ041.C=Echec de la cr\u00E9ation de la base de donn\u00E9es ''{0}'' ; pour plus de d\u00E9tails, voir l''exception suivante.
XJ042.S=''{0}'' n''est pas une valeur admise pour la propri\u00E9t\u00E9 ''{1}''.
XJ044.S=''{0}'' est une \u00E9chelle non valide.
XJ045.S=Un niveau d''isolement non valide ou non pris en charge (actuellement), ''{0}'', a \u00E9t\u00E9 transmis \u00E0 Connection.setTransactionIsolation(). Les valeurs actuellement prises ne charge sont java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED et java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
XJ049.C=Des attributs de cr\u00E9ation incompatibles ont \u00E9t\u00E9 sp\u00E9cifi\u00E9s.
XJ04B.S=Le fichier de commandes ne peut pas contenir de commande qui essaye de renvoyer un ensemble de r\u00E9sultats.
XJ04C.S=Le fichier de commandes CallableStatement ne peut pas contenir de param\u00E8tres de sortie.
XJ050.U=La base de donn\u00E9es n\u00E9cessite une mise \u00E0 niveau de la version {0}. D\u00E9finissez l''attribut ''upgrade\=true'' sur l''URL de connexion JDBC pour permettre une mise \u00E0 niveau en version {1}.
XJ056.S=Impossible de d\u00E9finir AUTOCOMMIT sur ON dans une connexion XA.
XJ057.S=Impossible de valider une transaction globale qui utilise la connexion ; le traitement de la validation doit passer par l''interface XAResource.
XJ058.S=Impossible d''annuler une transaction globale qui utilise la connexion ; le traitement de la validation doit passer par l''interface XAResource.
XJ059.S=Impossible de fermer une connexion tandis qu''une transaction globale est toujours active.
XJ05B.C=L''attribut JDBC ''{0}'' a une valeur incorrecte ''{1}'', les valeurs valides sont ''{2}''.
XJ05C.S=Impossible de d\u00E9finir la conservation de ResultSet.HOLD_CURSORS_OVER_COMMIT pour une transaction globale.
XJ061.S=La m\u00E9thode ''{0}'' est uniquement autoris\u00E9e sur les curseurs de d\u00E9filement.
XJ062.S=Valeur de param\u00E8tre non admise ''{0}'' pour ResultSet.setFetchSize(int rows).
XJ063.S=Valeur de param\u00E8tre non admise ''{0}'' pour Statement.setMaxRows(int maxRows).  La valeur du param\u00E8tre doit \u00EAtre >\= 0.
XJ064.S=Valeur de param\u00E8tre non admise ''{0}'' pour setFetchDirection(int direction).
XJ065.S=Valeur de param\u00E8tre non admise ''{0}'' pour Statement.setFetchSize(int rows).
XJ066.S=Valeur de param\u00E8tre non admise ''{0}'' pour Statement.setMaxFieldSize(int max).
XJ067.S=Le pointeur de texte SQL est nul.
XJ068.S=Seuls executeBatch et clearBatch sont autoris\u00E9s au milieu d''un fichier de commandes.
XJ069.S=Aucune m\u00E9thode SetXXX autoris\u00E9e avec l''instruction d''ex\u00E9cution USING.
XJ070.S=Un argument de position n\u00E9gatif ou \u00E9gal \u00E0 z\u00E9ro ''{0}'' a \u00E9t\u00E9 transmis dans une m\u00E9thode Blob ou Clob.
XJ071.S=Un argument de longueur n\u00E9gatif ''{0}'' est pass\u00E9 dans une m\u00E9thode BLOB ou CLOB.
XJ072.S=Un sch\u00E9ma ou un searchStr nul a \u00E9t\u00E9 transmis dans une m\u00E9thode de position BLOB ou CLOB.
XJ073.S=Les donn\u00E9es de data de ce BLOB ou CLOB ne sont plus disponibles.  La transaction de BLOB/CLOB peut avoir \u00E9t\u00E9 valid\u00E9e ou sa connexion est ferm\u00E9e.
XJ074.S=Valeur de param\u00E8tre ''{0}'' incorrecte pour le param\u00E8tre Statement.setQueryTimeout(int secondes).
XJ076.S=L''argument de position ''{0}'' d\u00E9passe la taille du BLOB/CLOB.
XJ077.S=Une exception s''est produite lors de la tentative de lecture du premier octet/caract\u00E8re du sch\u00E9ma BLOB/CLOB en utilisant getBytes/getSubString.
XJ078.S=Le d\u00E9calage ''{0}'' est soit inf\u00E9rieur \u00E0 z\u00E9ro, soit trop important pour le BLOB/CLOB actuel.
XJ079.S=La longueur ''{0}'' indiqu\u00E9e d\u00E9passe la taille du BLOB/CLOB.
XJ080.S=L''instruction d''ex\u00E9cution USING a transmis {0} param\u00E8tres et non {1}.
XJ081.C=Des attributs de cr\u00E9ation/restauration/r\u00E9cup\u00E9ration incompatibles ont \u00E9t\u00E9 sp\u00E9cifi\u00E9s.
XJ081.S=Valeur non valide ''{0}'' transmise en tant que param\u00E8tre ''{1}'' \u00E0 la m\u00E9thode ''{2}''
XJ082.U=Les valeurs BLOB/CLOB ne sont pas autoris\u00E9es en tant que param\u00E8tres de m\u00E9thode ou r\u00E9cepteur.
XJ083.U=''{0}'' n''est pas admis car le ResultSet n''est pas un ResultSet pouvant \u00EAtre mis \u00E0 jour. 
XJ084.U=La colonne ne correspond pas \u00E0 une colonne de la table de base. Impossible d''\u00E9mettre {0} sur cette colonne.
XJ085.S=Le flux a d\u00E9j\u00E0 \u00E9t\u00E9 lu et la fin du fichier atteinte, donc le flux ne peut pas \u00EAtre r\u00E9utilis\u00E9.
XJ086.S=Il est impossible d''appeler cette m\u00E9thode quand le curseur n''est pas sur la ligne d''insertion ou si l''acc\u00E8s concurrent de ce ResultSet est CONCUR_READ_ONLY.
XJ087.S=La somme des valeurs position(''{0}'') et length(''{1}'') est sup\u00E9rieure \u00E0 la taille de l''objet LOB.
XJ088.S=Op\u00E9ration incorrecte \: m\u00E9thode wasNull() appel\u00E9e sans donn\u00E9es extraites.
XJ090.S=Param\u00E8tre incorrect \: l''agenda est null.
XJ091.S=Argument incorrect \: l''index de param\u00E8tre {0} n''est pas un param\u00E8tre OUT ou INOUT.
XJ093.S=La longueur de BLOB/CLOB, {0}, est trop importante.  La longueur ne peut d\u00E9passer {1}.
XJ094.S=Cet objet est d\u00E9j\u00E0 ferm\u00E9.
XJ095.S=Une tentative d''ex\u00E9cution d''une action privil\u00E9gi\u00E9e a \u00E9chou\u00E9.
XJ096.S=Aucun regroupement de ressources n''a \u00E9t\u00E9 d\u00E9tect\u00E9 dans le module {0} pour {1}
XJ097.S=Impossible d''annuler ou d''\u00E9diter un point de sauvegarde qui n''a pas \u00E9t\u00E9 cr\u00E9\u00E9 par cette connexion.
XJ098.S=La valeur de cl\u00E9s auto-g\u00E9n\u00E9r\u00E9es {0} est incorrecte
XJ099.S=L''objet Reader/Stream ne contient pas de caract\u00E8re de longueur
XJ100.S=L''\u00E9chelle fournie par la m\u00E9thode registerOutParameter ne correspond pas \u00E0 la m\u00E9thode d''acc\u00E8s setter. Perte possible de pr\u00E9cision \!
XJ102.S=Impossible d''ex\u00E9cuter une insertion \u00E0 l''emplacement actuel.
XJ103.S=Le nom de table ne peut pas \u00EAtre null
XJ104.S=La longueur de cl\u00E9 partag\u00E9e est incorrecte \: {0}.
XJ105.S=La longueur de la cl\u00E9 DES est incorrecte \: longueur attendue {0}, longueur obtenue {1}.
XJ106.S=Pas de remplissage 
XJ107.S=Mauvais remplissage
XJ108.S=Taille de bloc non conforme
XJ110.S=Le nom de la table principale ne peut pas \u00EAtre null
XJ111.S=Le nom de la table externe ne peut pas \u00EAtre null
XJ112.S=Exception de s\u00E9curit\u00E9 rencontr\u00E9e \: pour plus d''informations, voir l''exception suivante.
XJ113.S=Impossible d''ouvrir le fichier {0} \: {1}
XJ114.S=Nom de curseur incorrect ''{0}''
XJ115.S=Impossible d''ouvrir le resultSet avec la stabilit\u00E9 {0} requise.
XJ116.S=Impossible d''ajouter plus de {0} \u00E0 un lot unique.
XJ117.S=Le traitement par lots des requ\u00EAtes est interdit de fa\u00E7on \u00E0 permettre la conformit\u00E9 \u00E0 la sp\u00E9cification J2EE.
XJ118.S=Le traitement par lots des requ\u00EAtes est requis sur une instruction qui n''est pas une requ\u00EAte.
XJ121.S=Op\u00E9ration incorrecte \u00E0 l''emplacement actuel du curseur.
XJ122.S=Aucune m\u00E9thode de mise \u00E0 jour XXX n''a \u00E9t\u00E9 appel\u00E9e sur cette ligne.
XJ123.S=Cette m\u00E9thode doit \u00EAtre appel\u00E9e pour mettre \u00E0 jour les valeurs de la ligne actuelle ou de la ligne d''insertion.
XJ124.S=Mise \u00E0 jour de la colonne impossible.
XJ125.S=Cette m\u00E9thode ne doit \u00EAtre appel\u00E9e que sur les objets ResultSet qu''il est possible de faire d\u00E9filer (les objets de type TYPE_SCROLL_INSENSITIVE).
XJ126.S=Cette m\u00E9thode ne doit pas \u00EAtre appel\u00E9e sur les curseurs dynamiques sensibles.
XJ128.S=D\u00E9sencapsulation impossible pour ''{0}''
XJ200.S=Nombre maximum de sections {0} d\u00E9pass\u00E9
XJ202.S=Nom de curseur ''{0}'' incorrect.
XJ203.S=Le nom de curseur ''{0}'' est d\u00E9j\u00E0 utilis\u00E9
XJ204.S=Impossible d''ouvrir l''ensemble de r\u00E9sultats avec la stabilit\u00E9 {0} requise.
XJ206.S=Le texte SQL ''{0}'' n''a pas de jeton.
XJ207.S=La m\u00E9thode executeQuery ne peut pas \u00EAtre utilis\u00E9e pour la mise \u00E0 jour.
XJ208.S=Echec de lot non atomique.  Le lot a \u00E9t\u00E9 soumis, mais au moins une exception s''est produite sur un membre individuel du lot. Utilisez la m\u00E9thode getNextException() pour extraire les exceptions pour des \u00E9l\u00E9ments sp\u00E9cifiques trait\u00E9s par lot.
XJ209.S=La proc\u00E9dure m\u00E9moris\u00E9e requise n''est pas install\u00E9e sur le serveur.
XJ210.S=Le nom du module de chargemment pour la proc\u00E9dure m\u00E9moris\u00E9e sur le serveur est introuvable.
XJ211.S=Une exception de rupture de cha\u00EEne irr\u00E9cup\u00E9rable s''est produite au cours du traitement par lot. Le lot s''est termin\u00E9 de mani\u00E8re non atomique.
XJ212.S=Syntaxe d''attribut incorrecte \: {0}
XJ213.C=Le format d''un nombre de la propri\u00E9t\u00E9 de connexion NiveauDeTrace est incorrect.
XJ214.S=Une erreur d''entr\u00E9e/sortie s''est produite lors d''un appel de m\u00E9thode free() sur un objet CLOB ou BLOB.
XJ215.S=Vous ne pouvez pas appeler d''autres m\u00E9thodes java.sql.Clob/java.sql.Blob apr\u00E8s avoir appel\u00E9 la m\u00E9thode free() ou apr\u00E8s avoir valid\u00E9 ou restaur\u00E9 la transaction Blob/Clob.
XJ216.S=La longueur de cet objet BLOB/CLOB n''est pas encore disponible. Lorsque vous acc\u00E9dez \u00E0 un objet BLOB ou CLOB en tant que flux, sa longueur est disponible seulement apr\u00E8s le traitement complet du flux.
XJ217.S=Le localisateur fourni pour cet objet CLOB/BLOB est incorrect
XK000.S=Impossible de recharger la strat\u00E9gie de s\u00E9curit\u00E9 \: {0}
XML00=Echec de la localisation de l''interface de programme d''application ou des classes d''impl\u00E9mentation ''{0}''.  Les op\u00E9rations XML ne sont pas autoris\u00E9es, sauf si ces classes figurent dans votre chemin de classes.
XML01=Exception inattendue rencontr\u00E9e lors du traitement de XML \: {0}
XN001.S=La r\u00E9initialisation de la connexion n''est pas autoris\u00E9e \u00E0 l''int\u00E9rieur d''une unit\u00E9 de travail.
XN002.U=SECTKN non renvoy\u00E9.
XN008.S=Le traitement de la requ\u00EAte a \u00E9t\u00E9 arr\u00EAt\u00E9 en raison d''une erreur sur le serveur.
XN009.S=Erreur d''obtention de la longueur de l''objet BLOB/CLOB, l''exception est la suivante.
XN010.S=Le nom de la proc\u00E9dure ne peut pas \u00EAtre null.
XN011.S=La longueur du nom de la proc\u00E9dure {0} ne se situe pas dans l''intervalle valide de 1 \u00E0 {1}.
XN012.S=Sur les plateformes {0}, XA prend en charge la version {1} et les versions ult\u00E9rieures ; il s''agit de la version {2}
XN013.S=Orientation de d\u00E9filement incorrecte.
XN014.S=Erreur de protocole r\u00E9seau \: une exception d''entr\u00E9e/sortie a \u00E9t\u00E9 rencontr\u00E9e, param\u00E8tre n\u00B0{0}.  Les donn\u00E9es restantes ont \u00E9t\u00E9 remplies de 0x0. Message \: {1}.
XN015.S=Erreur de protocole r\u00E9seau \: la taille d\u00E9finie de l''InputStream, param\u00E8tre n\u00B0{0}, est inf\u00E9rieure \u00E0 la longueur r\u00E9elle de l''InputStream.
XN016.S=Erreur de protocole r\u00E9seau \: une erreur a \u00E9t\u00E9 rencontr\u00E9e lors de la v\u00E9rification de la longueur du flux, param\u00E8tre n\u00B0{0}.  Message \: {1}.
XN017.S=Erreur de protocole r\u00E9seau \: fin de flux pr\u00E9matur\u00E9e, param\u00E8tre n\u00B0{0}.  Les donn\u00E9es restantes ont \u00E9t\u00E9 remplies de 0x0.
XN018.S=Erreur de protocole r\u00E9seau \: la taille d\u00E9finie de l''objet Reader, param\u00E8tre n\u00B0{0}, est inf\u00E9rieure \u00E0 la longueur r\u00E9elle de Reader.
XN019.S=Erreur lors de l''ex\u00E9cution d''un {0}, le serveur a renvoy\u00E9 {1}.
XRE00=Ce module LogFactory ne prend pas en charge la r\u00E9plication.
XRE01=Le journal re\u00E7u du ma\u00EEtre est corrompu.
XRE02=Le ma\u00EEtre et l'esclave sont de versions diff\u00E9rentes. Impossible de poursuivre la r\u00E9plication.
XRE03=Erreur de r\u00E9plication inattendue. Voir derby.log pour plus d'informations.
XRE04.U.1=Impossible d'\u00E9tablir une connexion avec l'homologue de la base de donn\u00E9es r\u00E9pliqu\u00E9e ''{0}'' \u00E0 l'adresse ''{1}\:{2}''.
XRE04.U.2=Perte de la connexion de la base de donn\u00E9es r\u00E9pliqu\u00E9e ''{0}''.
XRE05=Les fichiers journaux sur le ma\u00EEtre et l'esclave ne sont pas synchronis\u00E9s pour la base de donn\u00E9es r\u00E9pliqu\u00E9e ''{0}''. L'instant journal du ma\u00EEtre est {1}\:{2}, tandis que l'instant journal de l'esclave est {3}\:{4}. FATAL pour la r\u00E9plication - la r\u00E9plication sera arr\u00EAt\u00E9e.
XRE06=Les tentatives de connexion \u00E0 l'esclave de r\u00E9plication pour la base de donn\u00E9es {0} ont d\u00E9pass\u00E9 le d\u00E9lai d'attente sp\u00E9cifi\u00E9.
XRE07=Impossible d'ex\u00E9cuter l'op\u00E9ration car la base de donn\u00E9es n'est pas en mode ma\u00EEtre de r\u00E9plication.
XRE08=Le mode esclave de r\u00E9plication a d\u00E9marr\u00E9 avec succ\u00E8s pour la base de donn\u00E9es ''{0}''. Connexion refus\u00E9e car la base de donn\u00E9es est en mode esclave de r\u00E9plication. 
XRE09=Impossible de d\u00E9marrer le mode esclave de r\u00E9plication pour la base de donn\u00E9es ''{0}''. La base de donn\u00E9es a d\u00E9j\u00E0 \u00E9t\u00E9 amorc\u00E9e. 
XRE10=Conflit entre les attributs sp\u00E9cifi\u00E9s. Pour conna\u00EEtre les attributs admis avec l'attribut de r\u00E9plication ''{0}'', voir le manuel de r\u00E9f\u00E9rence.
XRE11=Impossible d'effectuer l'op\u00E9ration ''{0}'' car la base de donn\u00E9es ''{1}'' n'a pas \u00E9t\u00E9 amorc\u00E9e.
XRE12=Erreur du protocole r\u00E9seau de r\u00E9plication pour la base de donn\u00E9es ''{0}''. Type de message attendu ''{1}'', mais type re\u00E7u ''{2}''.
XRE20.D=Basculement effectu\u00E9 avec succ\u00E8s pour la base de donn\u00E9es ''{0}'', la base de donn\u00E9es a \u00E9t\u00E9 ferm\u00E9e.
XRE21=Une erreur s'est produite pendant le basculement de la base de donn\u00E9es ''{0}'' ; la tentative de basculement a \u00E9t\u00E9 abandonn\u00E9e.
XRE22=Le ma\u00EEtre de r\u00E9plication a d\u00E9j\u00E0 \u00E9t\u00E9 amorc\u00E9 pour la base de donn\u00E9es ''{0}''
XRE23=Impossible de d\u00E9marrer le ma\u00EEtre de r\u00E9plication car des op\u00E9rations non enregistr\u00E9es sont en cours d'ex\u00E9cution. D\u00E9bloquez pour permettre aux op\u00E9rations non enregistr\u00E9es de s'ex\u00E9cuter jusqu'au bout et red\u00E9marrez la r\u00E9plication.
XRE40=Impossible d'ex\u00E9cuter l'op\u00E9ration car la base de donn\u00E9es n'est pas en mode esclave de r\u00E9plication.
XRE41=Op\u00E9ration de r\u00E9plication ''failover'' ou ''stopSlave'' refus\u00E9e sur la base de donn\u00E9es esclave car la connexion avec le ma\u00EEtre est active. Emettez plut\u00F4t l'op\u00E9ration ''failover'' ou '''stopMaster'' sur la base de donn\u00E9es ma\u00EEtre.
XRE42=Arr\u00EAt de la base de donn\u00E9es r\u00E9pliqu\u00E9e ''{0}''.
XRE43=Erreur inattendue lors de la tentative d'arr\u00EAt du mode esclave de r\u00E9plication. Pour arr\u00EAter le mode esclave de r\u00E9plication, utilisez l'op\u00E9ration ''stopSlave'' ou ''failover''.
XSAI2.S=Le conglom\u00E9rat ({0}) demand\u00E9 n''existe pas.
XSAI3.S=Fonction non impl\u00E9ment\u00E9e.
XSAJ0.U=Type d''analyse
XSAJ1.U=Nombre de pages visit\u00E9es.
XSAJ2.U=Nombre de lignes visit\u00E9es.
XSAJ3.U=Nombre de lignes supprim\u00E9es visit\u00E9es.
XSAJ4.U=Nombre de lignes qualifi\u00E9es.
XSAJ5.U=Nombre de colonnes extraites.
XSAJ6.U=Ensemble binaire de colonnes extrait
XSAJ7.U=Hauteur de l''arborescence
XSAJ8.U=Type de tri
XSAJA.U=Nombre de lignes en entr\u00E9e
XSAJB.U=Nombre de lignes en sortie
XSAJC.U=Nombre d''ex\u00E9cutions de fusion
XSAJD.U=Taille des ex\u00E9cutions de fusion
XSAJE.U=Toutes
XSAJF.U=btree
XSAJG.U=heap
XSAJH.U=sort
XSAJI.U=externe
XSAJJ.U=interne
XSAM0.S=Exception d\u00E9tect\u00E9e lors de la tentative d''amor\u00E7age du module pour ''{0}''.
XSAM2.S=Aucun index ni conglom\u00E9rat ayant pour ID de conglom ''{0}'' n''est \u00E0 supprimer.
XSAM3.S=Il n''existe aucun index ni conglom\u00E9rat ayant pour ID de conglom ''{0}''.
XSAM4.S=Il n''existe aucun tri ayant pour nom ''{0}''.
XSAM5.S=L''analyse doit \u00EAtre ouverte et positionn\u00E9e par un appel de la m\u00E9thode next() avant la lancement d''autres appels.
XSAM6.S=L''enregistrement {2} de la page {1} du conteneur {0} n''a pas \u00E9t\u00E9 trouv\u00E9.
XSAS0.S=Une m\u00E9thode de l''interface de contr\u00F4leur d''analyse inad\u00E9quate pour une analyse de tri a \u00E9t\u00E9 appel\u00E9e.
XSAS1.S=Une tentative d''extraction d''une ligne avant le d\u00E9but d''un tri ou apr\u00E8s la fin d''un tri a \u00E9t\u00E9 effectu\u00E9e.
XSAS3.S=Le type d''une ligne ins\u00E9r\u00E9e dans un tri ne correspond pas au mod\u00E8le du tri.
XSAS6.S=Impossible d''acqu\u00E9rir des ressources pour le tri.
XSAX0.S=Violation du protocole XA
XSAX1.S=Une tentative de lancement d''une transaction globale avec le Xid d''une transaction globale existante a \u00E9t\u00E9 effectu\u00E9e.
XSCB0.S=Impossible de cr\u00E9er un conteneur.
XSCB1.S=Impossible de trouver le conteneur {0}.
XSCB2.S=La propri\u00E9t\u00E9 requise {0} n''a pas \u00E9t\u00E9 trouv\u00E9e dans la liste de propri\u00E9t\u00E9s fournie \u00E0 createConglomerate() pour un index secondaire btree.
XSCB3.S=Fonction non impl\u00E9ment\u00E9e.
XSCB4.S=Une m\u00E9thode sur une analyse d''ouverture btree a \u00E9t\u00E9 appel\u00E9e avant que l''analyse ne soit positionn\u00E9e sur la premi\u00E8re ligne (c''est-\u00E0-dire qu''aucun appel de next() n''a encore \u00E9t\u00E9 effectu\u00E9).  L''\u00E9tat actuel de l''analyse est ({0}).
XSCB5.S=Au cours de l''annulation logique d''une insertion ou d''une suppression btree, la ligne n''a pas pu \u00EAtre trouv\u00E9e dans l''arborescence.
XSCB6.S=Restriction \: L''enregistrement d''un index secondaire btree ne peut pas \u00EAtre mis \u00E0 jour ou ins\u00E9r\u00E9 en raison du manque d''espace sur la page.  Utilisez les param\u00E8tres derby.storage.pageSize et/ou derby.storage.pageReservedSpace pour contourner cette restriction.
XSCB7.S=Une erreur interne a \u00E9t\u00E9 d\u00E9tect\u00E9e au cours d''une analyse - current_rh est null \= {0}, la cl\u00E9 de position est null \= {1}.
XSCB8.S=Le conglom\u00E9rat btree {0} est ferm\u00E9.
XSCB9.S=R\u00E9serv\u00E9 pour les tests.
XSCG0.S=Impossible de cr\u00E9er un mod\u00E8le.
XSCH0.S=Impossible de cr\u00E9er un conteneur.
XSCH1.S=Impossible de trouver le conteneur {0}.
XSCH4.S=Impossible de cr\u00E9er de conglom\u00E9rat.
XSCH5.S=Dans une table de base, le num\u00E9ro de colonne demand\u00E9 {0} et le nombre maximum de colonnes {1} ne concordaient pas.
XSCH6.S=Le conteneur de segments de m\u00E9moire ayant l''ID de conteneur {0} est ferm\u00E9.
XSCH7.S=L''analyse n''est pas positionn\u00E9e.
XSCH8.S=Fonction non impl\u00E9ment\u00E9e.
XSDA1.S=Une tentative d''acc\u00E8s \u00E0 un emplacement situ\u00E9 en dehors des limites d''une page a \u00E9t\u00E9 effectu\u00E9e
XSDA2.S=Une tentative de mise \u00E0 jour d''un enregistrement supprim\u00E9 a \u00E9t\u00E9 effectu\u00E9e
XSDA3.S=Restriction \: L''enregistrement ne peut pas \u00EAtre mis \u00E0 jour ou ins\u00E9r\u00E9 en raison du manque d''espace sur la page. Utilisez les param\u00E8tres derby.storage.pageSize et/ou derby.storage.pageReservedSpace pour contourner cette restriction.
XSDA4.S=Une exception impr\u00E9vue a \u00E9t\u00E9 \u00E9mise
XSDA5.S=Une tentative d''annulation de la suppression d''un enregistrement non supprim\u00E9 a \u00E9t\u00E9 effectu\u00E9e.
XSDA6.S=La colonne {0} de la ligne a la valeur null alors qu''elle doit d\u00E9signer un objet.
XSDA7.S=La restauration d''un objet s\u00E9rialisable ou SQLData de classe {0} a tent\u00E9 de lire plus de donn\u00E9es que la quantit\u00E9 initialement enregistr\u00E9e
XSDA8.S=Exception au cours de la restauration d''un objet s\u00E9rialisable ou SQLData de classe {0}
XSDA9.S=Classe introuvable au cours de la restauration d''un objet s\u00E9rialisable ou SQLData de classe {0}
XSDAA.S=Horodatage {0} non valide ; il provient soit d''une page diff\u00E9rente, soit d''une impl\u00E9mentation incompatible
XSDAB.S=Impossible de d\u00E9finir un horodatage NULL
XSDAC.S=Tentative de d\u00E9placement de lignes ou de pages d''un conteneur \u00E0 un autre.
XSDAD.S=Tentative de d\u00E9placement de z\u00E9ro ligne d''une page vers une autre.
XSDAE.S=Il est uniquement possible de cr\u00E9er un descripteur d''enregistrement pour un ID de descripteur d''enregistrement sp\u00E9cial.
XSDAF.S=Utilisation d''un descripteur d''enregistrement sp\u00E9cial comme s''il s''agissait d''un descripteur d''enregistrement ordinaire.
XSDAG.S=La premi\u00E8re transaction imbriqu\u00E9e de l''allocation ne peut pas ouvrir le conteneur.
XSDAI.S=La page {0} en cours de suppression est d\u00E9j\u00E0 verrouill\u00E9e pour une suppression d''affectation.
XSDAJ.S=Exception au cours de l''\u00E9criture d''un objet s\u00E9rialisable ou SQLData
XSDAK.S=La mauvaise page a \u00E9t\u00E9 extraite pour le descripteur d''enregistrement {0}.
XSDAL.S=Le descripteur d''enregistrement {0} pointe de fa\u00E7on inattendue vers la page de d\u00E9passement.
XSDAM.S=Une exception s''est produite au cours de la restauration d''un objet SQLData de classe {0}. La classe indiqu\u00E9e ne peut pas \u00EAtre instanci\u00E9e.
XSDAN.S=Une exception s''est produite au cours de la restauration d''un objet SQLData de classe {0}. La classe indiqu\u00E9e a rencontr\u00E9 une exception d''acc\u00E8s incorrecte.
XSDB0.D=Exception inattendue sur la page en m\u00E9moire {0}
XSDB1.D=Format de page inconnu \u00E0 la page {0}
XSDB2.D=Format de conteneur inconnu au niveau du conteneur {0} \: {1}
XSDB3.D=Les informations relatives au conteneur ne peuvent pas \u00EAtre modifi\u00E9es une fois enregistr\u00E9es \:  pr\u00E9c\u00E9demment {0}, d\u00E9sormais {1}
XSDB4.D=La page {0} est en version {1}, le fichier journal contient des modifications en version {2} ; soit des enregistrements de journal de cette page sont absents, soit cette page n''a pas \u00E9t\u00E9 enregistr\u00E9e sur le disque correctement.
XSDB5.D=Le fichier journal comprend un enregistrement de modification \u00E0 la page {0}, c''est-\u00E0-dire au-del\u00E0 de la fin du conteneur.
XSDB6.D=Il est possible qu''une autre instance de Derby ait d\u00E9j\u00E0 amorc\u00E9 la base de donn\u00E9es {0}.
XSDB7.D=AVERTISSEMENT \: Derby (instance {0}) tente d''amorcer la base de donn\u00E9es {1} bien que Derby (instance {2}) soit peut-\u00EAtre encore actif.  Une seule instance de Derby peut amorcer une base de donn\u00E9es \u00E0 la fois. Une alt\u00E9ration grave et irr\u00E9m\u00E9diable peut r\u00E9sulter de cette situation et s''est peut-\u00EAtre d\u00E9j\u00E0 produite.
XSDB8.D=AVERTISSEMENT \: Derby (instance {0}) tente d''amorcer la base de donn\u00E9es {1} bien que Derby (instance {2}) soit peut-\u00EAtre encore actif.  Une seule instance de Derby peut amorcer une base de donn\u00E9es \u00E0 la fois. Une alt\u00E9ration grave et irr\u00E9m\u00E9diable peut r\u00E9sulter si 2 instances de Derby amorcent la m\u00EAme base de donn\u00E9es en m\u00EAme temps.  La propri\u00E9t\u00E9 db2j.database.forceDatabaseLock\=true a \u00E9t\u00E9 d\u00E9finie, de sorte que la base de donn\u00E9es ne s''amorcera pas tant que le fichier db.lck sera pr\u00E9sent.  Normalement, ce fichier est supprim\u00E9 lorsque la premi\u00E8re instance de Derby devant amorcer la base de donn\u00E9es est ferm\u00E9e, mais il est possible qu''il reste pr\u00E9sent suite \u00E0 certaines proc\u00E9dures d''arr\u00EAt.  Dans ce cas, il est n\u00E9cessaire de supprimer le fichier manuellement.  Il est important de v\u00E9rifier qu''aucune autre machine VM n''acc\u00E8de \u00E0 la base de donn\u00E9es tant que le fichier db.lck n''a pas \u00E9t\u00E9 supprim\u00E9 manuellement.
XSDB9.D=Le conteneur de flux {0} est alt\u00E9r\u00E9.
XSDBA.D=Echec de la tentative d''affectation de l''objet {0}.
XSDF0.S=Impossible de cr\u00E9er le fichier {0} car il existe d\u00E9j\u00E0.
XSDF1.S=Exception au cours de la cr\u00E9ation du fichier {0} pour le conteneur
XSDF2.S=Exception au cours de la cr\u00E9ation du fichier {0} pour le conteneur ; le fichier n''a pas pu \u00EAtre supprim\u00E9.  Exception \: {1}.
XSDF3.S=Impossible de cr\u00E9er le segment {0}.
XSDF4.S=Exception au cours de la suppression du fichier {0} pour le conteneur supprim\u00E9 ; le fichier n''a pas pu \u00EAtre supprim\u00E9 {1}.
XSDF6.S=Impossible de trouver la page d''allocation {0}.
XSDF7.S=Echec de l''acc\u00E8s \u00E0 la page nouvellement cr\u00E9\u00E9e {0}
XSDF8.S=Impossible de trouver la page {0} \u00E0 r\u00E9utiliser.
XSDFB.S=Op\u00E9ration non prise en charge par une base de donn\u00E9es en lecture seule
XSDFD.S=Diff\u00E9rentes lectures d''image de page lors de 2 E/S \u00E0 la page {0} ; la premi\u00E8re image pr\u00E9sente un total de contr\u00F4le incorrect, la deuxi\u00E8me image pr\u00E9sente un total de contr\u00F4le correct. Les images de page sont les suivantes \: {1} {2}
XSDFF.S=L''op\u00E9ration demand\u00E9e a \u00E9chou\u00E9 en raison d''une exception inattendue.
XSDFH.S=Impossible de sauvegarder la base de donn\u00E9es, une exception d''entr\u00E9e-sortie s''est produite lors de l''\u00E9criture vers le fichier conteneur de sauvegarde {0}.
XSDFI.S=Erreur lors de la tentative d''\u00E9criture de donn\u00E9es vers le disque dur au cours de la restauration de la base de donn\u00E9es.  V\u00E9rifiez que le disque dur de base de donn\u00E9es n''est pas plein. Si c''est le cas, effacez les fichiers superflus et retentez de vous connecter \u00E0 la base de donn\u00E9es.  Il est \u00E9galement possible que le syst\u00E8me de fichiers soit en lecture seule, que le disque soit tomb\u00E9 en panne ou qu''un autre incident soit survenu sur le support.  Le syst\u00E8me a rencontr\u00E9 une erreur lors du traitement de la page {0}.
XSDG0.D=Impossible de lire la page {0} \u00E0 partir du disque.
XSDG1.D=Impossible d''enregistrer la page {0} sur le disque. V\u00E9rifiez si le disque est satur\u00E9.
XSDG2.D=Total de contr\u00F4le non valide dans la page {0}, valeur pr\u00E9vue\={1}, version sur disque\={2}, vidage de la page \: {3}
XSDG3.D=Impossible d''acc\u00E9der aux m\u00E9tadonn\u00E9es pour le conteneur {0}
XSDG5.D=La base de donn\u00E9es n''est pas en mode cr\u00E9ation lorsque createFinished est appel\u00E9.
XSDG6.D=Le r\u00E9pertoire du segment de donn\u00E9es n''a pas \u00E9t\u00E9 trouv\u00E9 dans la sauvegarde {0} pendant la restauration. Assurez-vous que la copie de sauvegarde est la bonne et qu''elle n''est pas alt\u00E9r\u00E9e.
XSDG7.D=Le r\u00E9pertoire {0} n''a pas pu \u00EAtre supprim\u00E9 pendant la restauration. Assurez-vous que les droits d''acc\u00E8s sont corrects.
XSDG8.D=Impossible de copier le r\u00E9pertoire ''{0}'' dans ''{1}'' lors de la restauration. Assurez-vous que l''espace est suffisant et que les droits d''acc\u00E8s sont corrects. 
XSLA0.D=Impossible de vider le fichier journal sur le disque {0}.
XSLA1.D=L''enregistrement de journal a \u00E9t\u00E9 envoy\u00E9 au flux de donn\u00E9es de journalisation, mais il ne peut pas \u00EAtre appliqu\u00E9 au stockage (Objet {0}).  Des probl\u00E8mes de reprise peuvent \u00E9galement en d\u00E9couler.
XSLA2.D=Le syst\u00E8me va s''arr\u00EAter ; une exception d''E-S a \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9e lors de l''acc\u00E8s au fichier journal.
XSLA3.D=Fichier journal alt\u00E9r\u00E9 ; des donn\u00E9es non valides se trouvent dans le flux de donn\u00E9es de journalisation.
XSLA4.D=Impossible d''\u00E9crire dans le journal, ce dernier est probablement satur\u00E9.  Supprimez les fichiers inutiles.  Il est \u00E9galement possible que le syst\u00E8me de fichiers soit en lecture seule, que le disque soit tomb\u00E9 en panne ou qu''un autre incident soit survenu avec le support.  
XSLA5.D=Impossible de lire le flux de donn\u00E9es de journalisation dans le but d''annuler la transaction {0}.
XSLA6.D=Impossible de r\u00E9cup\u00E9rer la base de donn\u00E9es.
XSLA7.D=Impossible de r\u00E9p\u00E9ter l''op\u00E9ration {0} dans le fichier journal.
XSLA8.D=Impossible d''annuler la transaction {0} ; tentative de compensation de l''op\u00E9ration {1} par {2}
XSLAA.D=Une exception ant\u00E9rieure a marqu\u00E9 le stockage comme devant \u00EAtre arr\u00EAt\u00E9.
XSLAB.D=Le fichier journal {0} est introuvable ; assurez-vous que votre propri\u00E9t\u00E9 logDevice est d\u00E9finie correctement avec le s\u00E9parateur de chemin d''acc\u00E8s appropri\u00E9 pour votre plateforme.
XSLAC.D=La base de donn\u00E9es situ\u00E9e dans {0} utilise un format incompatible avec la version actuelle du logiciel ; elle a peut-\u00EAtre \u00E9t\u00E9 cr\u00E9\u00E9e ou mise \u00E0 niveau par une version ult\u00E9rieure.
XSLAD.D=L''enregistrement de journal \u00E0 l''instant {2} dans le fichier journal {3} est corrompu. La longueur pr\u00E9vue de l''enregistrement de journal est {0}, la longueur r\u00E9elle est {1}.
XSLAE.D=Aucune \u00E9criture dans le fichier de contr\u00F4le situ\u00E9 dans {0}, ni aucune mise \u00E0 jour de ce fichier ne peuvent \u00EAtre effectu\u00E9es.
XSLAF.D=Une base de donn\u00E9es en lecture seule a \u00E9t\u00E9 cr\u00E9\u00E9e avec des m\u00E9moires tampon de donn\u00E9es non valides.
XSLAH.D=Une base de donn\u00E9es en lecture seule est en cours de mise \u00E0 jour.
XSLAI.D=Impossible de consigner l''enregistrement de journal des points de contr\u00F4le.
XSLAJ.D=A la suite d''un incident, le syst\u00E8me de journalisation est marqu\u00E9 comme devant \u00EAtre arr\u00EAt\u00E9 et aucune op\u00E9ration ne peut \u00EAtre ex\u00E9cut\u00E9e jusqu''\u00E0 l''arr\u00EAt et le red\u00E9marrage du syst\u00E8me.
XSLAK.D=La base de donn\u00E9es a d\u00E9pass\u00E9 le num\u00E9ro de fichier journal le plus grand {0}.
XSLAL.D=La taille de l''enregistrement de journal {2} d\u00E9passe la taille de fichier journal maximale autoris\u00E9e {3}. Erreur d\u00E9tect\u00E9e dans le fichier journal {0}, \u00E0 la position {1}.
XSLAM.D=Impossible de v\u00E9rifier le format de la base de donn\u00E9es situ\u00E9e dans {1} en raison d''une exception d''E/S.
XSLAN.D=La base de donn\u00E9es situ\u00E9e dans {0} utilise un format incompatible avec la version actuelle du logiciel.  La base de donn\u00E9es a \u00E9t\u00E9 cr\u00E9\u00E9e ou mise \u00E0 niveau par la version {1}.
XSLAO.D=Echec de la reprise, incident inattendu {0}.
XSLAP.D=La base de donn\u00E9es {0} est en version {1}. Les bases de donn\u00E9es B\u00EAta ne peuvent pas \u00EAtre mises \u00E0 niveau.
XSLAQ.D=impossible de cr\u00E9er un fichier journal dans le r\u00E9pertoire {0}.
XSLAR.D=Impossible de copier le fichier journal ''{0}'' dans ''{1}'' lors de la restauration. Assurez-vous que l''espace est suffisant et que les droits d''acc\u00E8s sont corrects. 
XSLAS.D=Le r\u00E9pertoire du journal {0} n''a pas \u00E9t\u00E9 trouv\u00E9 dans la sauvegarde au cours de la restauration. Assurez-vous que la copie de sauvegarde est la bonne et qu''elle n''est pas alt\u00E9r\u00E9e.
XSLAT.D=Le r\u00E9pertoire des journaux ''{0}'' existe. Ce r\u00E9pertoire fait peut-\u00EAtre partie d''une autre base de donn\u00E9es. Assurez-vous que l''emplacement indiqu\u00E9 pour l''attribut logDevice est correct.
XSLB1.S=L''op\u00E9ration de journalisation {0} rencontre une erreur lors de son enregistrement dans le flux de donn\u00E9es de journalisation ; cela peut \u00EAtre d\u00FB \u00E0 une op\u00E9ration de journalisation errante ou \u00E0 la saturation de la m\u00E9moire tampon du journal interne suite \u00E0 une op\u00E9ration de journalisation trop volumineuse.
XSLB2.S=L''op\u00E9ration de journalisation {0} enregistre trop de donn\u00E9es ; elle a satur\u00E9 la m\u00E9moire tampon du journal interne.
XSLB4.S=Impossible de trouver truncationLWM {0}.
XSLB5.S=Instant de truncationLWM {1} incorrect pour le point de troncature {0}. La plage autoris\u00E9e est comprise entre {2} et {3}.
XSLB6.S=Tentative de consignation d''un enregistrement de longueur 0 ou -ve.
XSLB8.S=Tentative de r\u00E9initialisation d''une analyse \u00E0 {0}, au-del\u00E0 de sa limite de {1}.
XSLB9.S=Impossible d''\u00E9mettre d''autres modifications ; la fabrique de fichier journal a \u00E9t\u00E9 arr\u00EAt\u00E9e.
XSRS0.S=Impossible de geler la base de donn\u00E9es lorsqu''elle a d\u00E9j\u00E0 \u00E9t\u00E9 gel\u00E9e.
XSRS1.S=Impossible de sauvegarder la base de donn\u00E9es dans {0} car il ne s''agit pas d''un r\u00E9pertoire.
XSRS4.S=Erreur lors du changement de nom du fichier (au cours de la sauvegarde) de {0} en {1}.
XSRS5.S=Erreur lors de la copie du fichier (au cours de la sauvegarde) de {0} vers {1}.
XSRS6.S=Impossible de cr\u00E9er le r\u00E9pertoire de sauvegarde {0}.
XSRS7.S=La sauvegarde a intercept\u00E9 une exception inattendue.
XSRS8.S=L''unit\u00E9 de journalisation peut uniquement \u00EAtre d\u00E9finie au cours du processus de cr\u00E9ation de la base de donn\u00E9es ; elle ne peut pas \u00EAtre modifi\u00E9e \u00E0 la vol\u00E9e.
XSRS9.S=L''enregistrement {0} n''existe plus
XSRSA.S=Impossible de sauvegarder la base de donn\u00E9es lorsque des op\u00E9rations non consign\u00E9es ne sont pas valid\u00E9es. Veuillez valider les transactions contenant des op\u00E9rations qui emp\u00EAchent de sauvegarder. 
XSRSB.S=Impossible de sauvegarder une transaction contenant des op\u00E9rations non consign\u00E9es et non valid\u00E9es.
XSRSC.S=Impossible de sauvegarder la base de donn\u00E9es dans {0} car il s''agit d''un r\u00E9pertoire de base de donn\u00E9es.
XSTA2.S=Une transaction \u00E9tait d\u00E9j\u00E0 active lorsqu''une tentative d''activation d''une autre transaction a \u00E9t\u00E9 effectu\u00E9e.
XSTB0.M=Une exception a \u00E9t\u00E9 \u00E9mise au cours de l''abandon de la transaction.
XSTB2.M=Impossible de consigner les modifications de transaction ; il s''agit peut-\u00EAtre d''une tentative d''\u00E9criture dans une base de donn\u00E9es en lecture seule.
XSTB3.M=Impossible d''abandonner la transaction parce que le gestionnaire des journaux est nul, probablement en raison d''une erreur ant\u00E9rieure.
XSTB5.M=Un incident inattendu s''est produit lors la cr\u00E9ation d''une base de donn\u00E9es pour laquelle la journalisation est d\u00E9sactiv\u00E9e.
XSTB6.M=Impossible de remplacer une table de transactions par une autre tant qu''une table est d\u00E9j\u00E0 en cours d''utilisation.
XXXXX.C.6=La session de base de donn\u00E9es normale est ferm\u00E9e.
