# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

01001=Es wurde versucht, eine bereits gel\u00F6schte Zeile zu aktualisieren oder zu l\u00F6schen. Keine Zeile wurde aktualisiert oder gel\u00F6scht.
01003=Aus dem Argument einer Spaltenfunktion wurden Nullwerte eliminiert.
01006=Die Berechtigung wurde dem Benutzer {0} nicht entzogen.
01007=Rolle {0} wurde der Authentifizierungs-ID {1}nicht entzogen.
01008=WITH ADMIN OPTION von Rolle {0}wurde der Authentifizierungs-ID {1}nicht entzogen.
0100E=XX Es wurde versucht, zu viele Ergebnislisten zur\u00FCckzugeben. 
01500=Die Integrit\u00E4tsbedingung {0} in Tabelle {1} wurde gel\u00F6scht.
01501=Die Ansicht {0} wurde gel\u00F6scht.
01502=Der Ausl\u00F6ser {0} in Tabelle {1} wurde gel\u00F6scht.
01503=Die Spalte {0} in Tabelle {1} wurde durch das Hinzuf\u00FCgen einer Integrit\u00E4tsbedingung ungleich null ge\u00E4ndert.
01504=Der neue Index ist ein Duplikat eines vorhandenen Indexes\: {0}.
01505=Der Wert {0} ist m\u00F6glicherweise abgeschnitten.
01522=Das neu definierte Synonym ''{0}'' wurde in das Objekt ''{1}'' aufgel\u00F6st, das derzeit nicht definiert ist.
01J01=Die Datenbank ''{0}'' wurde nicht erstellt. Stattdessen wurde eine Verbindung zu einer vorhandenen Datenbank hergestellt.
01J02=Scroll-sensitive Cursor sind derzeit nicht implementiert.
01J04=Die Klasse ''{0}'' f\u00FCr die Spalte ''{1}'' implementiert nicht java.io.Serializable oder java.sql.SQLData. Eine dieser Schnittstellen muss von Instanzen implementiert werden, damit sie gespeichert werden k\u00F6nnen.
01J05=Das Upgrade f\u00FCr die Datenbank wurde fehlerfrei durchgef\u00FChrt. Die erweiterte Datenbank steht zur Verwendung bereit. Die gespeicherten vorbereiteten Anweisungen konnten nicht erneut ausgewertet werden. Details zu diesem Fehler enth\u00E4lt die n\u00E4chste Ausnahme.
01J06=Das ResultSet kann nicht aktualisiert werden. Die Abfrage wurde nicht f\u00FCr die Generierung eines aktualisierbaren ResultSet qualifiziert.
01J07=ResultSetHoldability wurde f\u00FCr eine globale Transaktion auf ResultSet.CLOSE_CURSORS_AT_COMMIT eingeschr\u00E4nkt.
01J08=Der ResultSet-Typ {0} kann nicht ge\u00F6ffnet werden. Es wurde der ResultSet-Typ {1} ge\u00F6ffnet.
01J10=Scroll-sensitive Ergebnislisten werden vom Server nicht unterst\u00FCtzt. Es erfolgt eine Neuzuordnung zu einem Cursor, der sich nur vorw\u00E4rts durch die Ergebnisliste bewegen kann.
01J12=Vom Server kann kein Nachrichtentext abgerufen werden. Lesen Sie die n\u00E4chste Ausnahme. Die gespeicherte Prozedur SYSIBM.SQLCAMESSAGE ist nicht auf dem Server installiert. Wenden Sie sich an den Datenbankadministrator.
01J13=Es wurden zu viele Zeilen ({0}) f\u00FCr ein Integer zur\u00FCckgegeben. Der zur\u00FCckgegebene Wert wird abgeschnitten.
01J14=Die SQL-Autorisierung wird verwendet, ohne dass zuvor die Authentifizierung aktiviert wurde.
02000=F\u00FCr FETCH, UPDATE oder DELETE wurde keine Zeile gefunden oder das Ergebnis einer Abfrage ist eine leere Tabelle.
07000=Mindestens ein Parameter der aktuellen Anweisung wurde nicht initialisiert.
07004=Der Parameter {0} ist ein {1}-Prozedurparameter und muss vor der Ausf\u00FChrung mit CallableStatement.registerOutParameter registriert werden.
07009=Keine Eingabeparameter.
08000.S.1=Eine Verbindung mit einer aktiven Transaktion kann nicht geschlossen werden. Die Transaktion bleibt offen. Die Verbindung wurde nicht geschlossen.
08000=Die Verbindung wurde von einer unbekannten Unterbrechung aufgehoben.
08001.C.10=Es konnte keine Verbindung hergestellt werden, weil das Sicherheitstoken gr\u00F6\u00DFer als f\u00FCr das Netzprotokoll maximal zul\u00E4ssig ist.
08001.C.11=Es konnte keine Verbindung hergestellt werden, weil die Benutzer-ID die L\u00E4nge null hat oder l\u00E4nger als f\u00FCr das Netzprotokoll maximal zul\u00E4ssig ist.
08001.C.12=Es konnte keine Verbindung hergestellt werden, weil das Kennwort die L\u00E4nge null hat oder l\u00E4nger als f\u00FCr das Netzprotokoll maximal zul\u00E4ssig ist.
08001.C.1=Das erforderliche Derby-DataSource-Merkmal {0} ist nicht gesetzt.
08001.C.2={0}\: Fehler beim Herstellen der Verbindung zum Server {1} am Port {2}. Nachricht\: {3}.
08001.C.3=SocketException\: ''{0}''
08001.C.4=Am Socket ''{0}'' kann kein Datenstrom ge\u00F6ffnet werden.
08001.C.5=Die L\u00E4nge der Benutzer-ID ({0}) liegt au\u00DFerhalb des g\u00FCltigen Bereichs von 1 bis {1}.
08001.C.6=Die L\u00E4nge des Kennworts ({0}) liegt au\u00DFerhalb des g\u00FCltigen Bereichs von 1 bis {1}.
08001.C.7=Die Benutzer-ID muss ungleich null sein.
08001.C.8=Das Kennwort muss ungleich null sein.
08001.C.9=Es konnte keine Verbindung hergestellt werden, weil der Datenbankname {0} l\u00E4nger als f\u00FCr das Netzprotokoll maximal zul\u00E4ssig ist.
08003.C.1=getConnection() ist f\u00FCr eine geschlossene Verbindung im Pool ung\u00FCltig.
08003.C.2=Eine LOB-Methode wurde aufgerufen, nachdem die Verbindung geschlossen wurde.
08003.C.3=Die zugrunde liegende physische Verbindung ist veraltet oder geschlossen.
08003=Keine aktuelle Verbindung.
08004.C.10=Systemberechtigung zum Erstellen von Datenbank ''{0}'' [{1}] kann nicht \u00FCberpr\u00FCft werden.
08004.C.11=Keine Berechtigung des Benutzers ''{0}'' zum Erstellen von Datenbank''{1}'' [{2}].
08004.C.1=Die Verbindung konnte nicht authentifiziert werden. Ursache\: {0}.
08004.C.2=Die Verbindung wurde zur\u00FCckgewiesen, weil die Datenbank {0} nicht gefunden wurde.
08004.C.3=Die Datenbankverbindung wurde verweigert.
08004.C.4=Benutzer ''{0}'' kann die Datenbank ''{1}'' nicht herunterfahren. Hierzu ist nur der Datenbankeigent\u00FCmer berechtigt.
08004.C.5=Benutzer ''{0}'' kann die Datenbank ''{1}'' nicht (neu) verschl\u00FCsseln. Hierzu ist nur der Datenbankeigent\u00FCmer berechtigt.
08004.C.6=Benutzer ''{0}'' kann kein Upgrade der Datenbank ''{1}'' erzwingen. Hierzu ist nur der Datenbankeigent\u00FCmer berechtigt.
08004.C.7=Verbindung mit Datenbank ''{0}'' verweigert. Die Datenbank befindet sich im Replication-Slave-Modus.
08004.C.8=Benutzer ''{0}'' kann keinen Replikationsvorgang auf Datenbank ''{1}'' ausl\u00F6sen. Hierzu ist nur der Datenbankeigent\u00FCmer berechtigt.
08004.C.9=Benutzer  ''{0}'' hat keine Berechtigung zum Herunterfahren des Systems [{1}].
08004=Zur\u00FCckgewiesene Verbindung\: {0}
08006.C.1=W\u00E4hrend des Zur\u00FCcksetzens einer Verbindung ist ein Fehler aufgetreten. Die Verbindung wurde beendet. Details finden Sie in den zugeh\u00F6rigen Ausnahmen.
08006.C.2=SocketException\: ''{0}''
08006.C.3=Es wurde ein \u00DCbertragungsfehler festgestellt. {0}
08006.C.4=W\u00E4hrend des verz\u00F6gerten Zur\u00FCcksetzens einer Verbindung ist ein Fehler aufgetreten. Die Verbindung wurde beendet. Details finden Sie in den zugeh\u00F6rigen Ausnahmen.
08006.C.5=Unzureichende Daten beim Lesen aus dem Netz. Erwartet wurden mindestens {0} Bytes, empfangen wurden jedoch nur {1} Bytes. Die Verbindung wurde beendet.
08006.C.6=Es wurde versucht, LOB-Daten vollst\u00E4ndig zu speichern, die f\u00FCr die JVM zu umfangreich sind. Die Verbindung wurde beendet.
08006.C=Es wurde ein Netzprotokollfehler gefunden. Die Verbindung wurde beendet. {0}
08006.D=Die Datenbank ''{0}'' wird heruntergefahren.
0A000.C.6=Der DRDA-Befehl {0} ist derzeit nicht implementiert. Die Verbindung wurde beendet.
0A000.S.1=Die JDBC-Methode ist noch nicht implementiert.
0A000.S.2=Die JDBC-Methode {0} wird nicht vom Server unterst\u00FCtzt. F\u00FChren Sie ein Serverupgrade durch.
0A000.S.3=Das resultSetHoldability-Merkmal {0} wird nicht unterst\u00FCtzt.
0A000.S.4=Der Server bietet keine Unterst\u00FCtzung f\u00FCr cancel().
0A000.S.5=Der Sicherheitsmechanismus ''{0}'' wird nicht unterst\u00FCtzt.
0A000.S.7=Der Datentyp ''{0}'' wird nicht unterst\u00FCtzt. 
0A000.S=Nicht implementiertes Feature\: {0}.
0P000.S.1=Ung\u00FCltige Rollenspezifikation, Rolle wurde weder aktuellem Benutzer noch PUBLIC zugewiesen\: ''{0}''.
0P000=Ung\u00FCltige Rollenspezifikation, Rolle existiert nicht\: ''{0}''.
10000=Bei der Auswertung des XML-Abfrageausdrucks f\u00FCr den Operator {0} wurde ein Fehler festgestellt\: {1}
21000=Eine skalare Unterabfrage darf nur eine Zeile zur\u00FCckgeben.
22001=Bei dem Versuch, {0} ''{1}'' auf die L\u00E4nge {2} zu k\u00FCrzen, ist ein Abschneidefehler aufgetreten.
22003.S.1=Die Jahresangabe ({0}) \u00FCberschreitet den Maximalwert ''{1}''.
22003.S.2=Eine Dezimalzahl darf nicht mehr als 31 Stellen haben.
22003.S.3=Bei der Konvertierung eines numerischen Datentyps von ''{0}'' in {1} ist es zu einem \u00DCberlauf gekommen.
22003=Der resultierende Wert liegt au\u00DFerhalb des Bereichs f\u00FCr den Datentyp {0}.
22004.S.4=Die L\u00E4nge ({0}) \u00FCberschreitet das Maximum f\u00FCr den Datentyp ({1}).
22005.S.1=Ein Wert des Typs ''{0}'' kann nicht in den Typ ''{1}'' konvertiert werden. Die Codierung wird nicht unterst\u00FCtzt.
22005.S.2=Der erforderliche Zeichenumsetzer ist nicht verf\u00FCgbar.
22005.S.3=Eine Unicode-Zeichenfolge kann nicht in eine EBCDIC-Zeichenfolge konvertiert werden.
22005.S.4=Nicht erkannter JDBC-Typ. Typ\: {0}, Spaltennummer\: {1}, Spaltenindex\: {2}
22005.S.5=Ung\u00FCltiger JDBC-Typ f\u00FCr den Parameter {0}
22005.S.6=Nicht erkannter Java-SQL-Typ {0}
22005=Es wurde versucht, einen Datenwert des Typs ''{0}'' aus einem Datenwert des Typs ''{1}'' abzurufen.
22007.S.180=Die Zeichenfolgendarstellung eines datetime-Wertes liegt au\u00DFerhalb des Bereichs.
22007.S.181=Die Syntax der Zeichenfolgendarstellung eines datetime-Wertes ist fehlerhaft.
22008.S=''{0}'' ist ein ung\u00FCltiges Argument f\u00FCr die Funktion {1}.
2200L=XML-Spalten zugeordnete Werte m\u00FCssen korrekt formatierte DOCUMENT-Knoten sein.
2200M=Ung\u00FCltiges XML DOCUMENT\: {0}
2200V=Ung\u00FCltiges Kontextelement f\u00FCr den Operator {0}. Kontextelemente m\u00FCssen korrekt formatierte DOCUMENT-Knoten sein.
2200W=XQuery-Serialisierungsfehler\: Es wurde versucht, mindestens einen ATTRIBUTE-Knoten der Ausgangsebene zu serialisieren.
22011=Das zweite oder dritte Argument der Funktion SUBSTR liegt au\u00DFerhalb des Bereichs.
22012=Es wurde eine Division durch null versucht.
22013=Es wurde versucht, die Quadratwurzel einer negativen Zahl (''{0}'') zu ziehen.
22014=Die Anfangsposition f\u00FCr LOCATE ist ung\u00FCltig. Sie muss eine positive ganze Zahl sein. Der Index, bei dem die Suche beginnen soll, ist ''{2}''. Zu suchende Zeichenfolge\: ''{0}''. Die Zeichenfolge, bei der die Suche beginnen soll, ist ''{1}''. 
22015.S.1=Ung\u00FCltige Datenkonvertierung. Bei der angeforderten Konvertierung w\u00FCrde einen Genauigkeitsverlust von {0} nach sich ziehen.
22015=Die Funktion ''{0}'' ist f\u00FCr die folgenden Typen unzul\u00E4ssig. Der erste Operand ist vom Typ ''{1}''.  Der zweite Operand ist vom Typ ''{2}''. Der dritte Operand (Anfangsposition) ist vom Typ ''{3}''.
22018=Ung\u00FCltiges Zeichenfolgenformat f\u00FCr den Typ {0}
22019=Die Escape-Zeichenfolge ''{0}'' ist ung\u00FCltig. Die Escape-Zeichenfolge muss aus genau einem Zeichen bestehen. Sie muss ungleich null sein und darf nicht mehr als ein Zeichen enthalten.
22020=Ung\u00FCltiger Trim-String ''{0}''. Der Trim-String muss exakt ein Zeichen enthalten oder den Wert NULL aufweisen. Er kann nicht mehrere Zeichen umfassen.
22025=Auf das Escape-Zeichen muss ein Escape-Zeichen ''_'' oder ''%'' folgen. Ein anderes Folgezeichen ist unzul\u00E4ssig. Das Escape-Zeichen darf auch nicht das letzte Zeichen des Musters sein.
22027=Die integrierte Funktion TRIM() unterst\u00FCtzt nur das Entfernen eines Zeichens. Die integrierten Funktionen LTRIM() und RTRIM() unterst\u00FCtzen das Entfernen mehrerer Zeichen.
22028=Die Zeichenfolge \u00FCberschreitet die maximale L\u00E4nge von {0}.
22501=Eine ESCAPE-Klausel NULL gibt nicht definierte Ergebnisse zur\u00FCck und ist unzul\u00E4ssig.
23502=Die Spalte ''{0}'' akzeptiert keinen Nullwert.
23503={2} in Tabelle ''{1}'' hat f\u00FCr Schl\u00FCssel {3} die Integrit\u00E4tsbedingung ''{0}'' f\u00FCr Fremdschl\u00FCssel verletzt. Die Anweisung wurde zur\u00FCckgesetzt.
23505=Die Anweisung wurde abgebrochen, weil sie in einer f\u00FCr ''{1}'' definierten Vorgabe f\u00FCr einen eindeutigen oder Prim\u00E4rschl\u00FCssel bzw. f\u00FCr einen von ''{0}'' bezeichneten eindeutigen Index zu einem duplizierten Schl\u00FCsselwert gef\u00FChrt h\u00E4tte.
23513=Die Bedingung ''{1}'' f\u00FCr die Integrit\u00E4tspr\u00FCfung wurde beim Ausf\u00FChren von INSERT oder UPDATE f\u00FCr Tabelle ''{0}'' verletzt.
24000=Ung\u00FCltiger Cursorstatus; keine aktuelle Zeile.
24501.S=Der angegebene Cursor ist nicht ge\u00F6ffnet.
25001.S.1=Ung\u00FCltiger Transaktionsstatus\: aktive SQL-Transaktion.
25001=Eine Verbindung kann nicht beendet werden, solange noch eine Transaktion aktiv ist.
25501=Das Schreibschutzattribut der Verbindung kann nicht in einer aktiven Transaktion gesetzt werden.
25502=F\u00FCr eine Verbindung, einen Benutzer oder eine Datenbank mit Lesezugriff sind \u00C4nderungen von SQL-Daten unzul\u00E4ssig.
25503=F\u00FCr eine Verbindung, einen Benutzer oder eine Datenbank mit Lesezugriff ist die DDL unzul\u00E4ssig.
25505=Ein Benutzer mit Lesezugriff oder der Benutzer einer schreibgesch\u00FCtzten Datenbank ist nicht berechtigt, den Schreibschutzmodus f\u00FCr eine Verbindung zu inaktivieren.
28502=Der Benutzername ''{0}'' ist ung\u00FCltig. 
2D521.S.1=setAutoCommit(true) ist f\u00FCr eine globale Transaktion ung\u00FCltig.
2D521.S.2=COMMIT oder ROLLBACK ist f\u00FCr eine Anwendungsausf\u00FChrungsumgebung ung\u00FCltig. 
38000=Bei der Auswertung eines Ausdrucks wurde die Ausnahme ''{0}'' ausgel\u00F6st.
38001=Die externe Routine ist nicht berechtigt, SQL-Anweisungen auszuf\u00FChren.
38002=Die Routine hat versucht, Daten zu modifizieren, wurde jedoch nicht als MODIFIES SQL DATA definiert.
38004=Die Routine hat versucht, Daten zu lesen, wurde jedoch nicht als READS SQL DATA definiert.
39004=An eine Methode mit einem Parameter des Primitive-Typs ''{0}'' kann kein Nullwert \u00FCbergeben werden.
3B001.S=Der Sicherungspunkt {0} ist nicht vorhanden oder in der aktuellen Transaktion nicht aktiv.
3B002.S=Die maximale Anzahl von Sicherungspunkten ist erreicht. 
3B501.S=In der aktuellen Transaktion ist bereits ein Sicherungspunkt mit dem \u00FCbergebenen Namen vorhanden.
3B502.S=Es wurde RELEASE oder ROLLBACK TO SAVEPOINT angegeben. Der Sicherungspunkt ist jedoch nicht vorhanden.
40001=Eine Sperre konnte aufgrund eines Deadlock nicht angefordert werden. Zyklus der Sperren und beantragten Sperren\:\n{0}. Die ausgew\u00E4hlte Opfertransaktion ist XID \: {1}.
40XC0=Nicht mehr verwendbare Anweisung. Die Ursache kann das Abfangen eines Transaktionsfehlers bestimmter Wertigkeit innerhalb dieser Anweisung sein.
40XD0=Der Container wurde geschlossen.
40XD1=Der Container wurde im Schreibschutzmodus ge\u00F6ffnet.
40XD2=Der Container {0} kann nicht ge\u00F6ffnet werden. Er wurde gel\u00F6scht oder ist nicht vorhanden.
40XL1=Eine Sperre konnte innerhalb der vorgegebenen Zeit nicht angefordert werden.
40XL2=Eine Sperre konnte innerhalb der vorgegebenen Zeit nicht angefordert werden. Speicherauszug der Sperrentabelle\: {0}
40XT0=Das Modul RawStore hat einen internen Fehler festgestellt.
40XT1=Beim Festschreiben der Transaktion wurde eine Ausnahme ausgel\u00F6st.
40XT2=Beim Zur\u00FCcksetzen eines Sicherungspunktes wurde eine Ausnahme ausgel\u00F6st.
40XT4=Es wurde versucht. eine noch aktive Transaktion zu schlie\u00DFen. Die Transaktion wurde abgebrochen.
40XT5=W\u00E4hrend einer internen Transaktion wurde eine Ausnahme ausgel\u00F6st.
40XT6=Die Datenbank ist stillgelegt, so dass die Transaktion nicht aktiviert werden kann. Warten Sie, bis die Datenbank vom Stilllegungsstatus in einen anderen Status wechselt.
40XT7=Die Operation wird in einer internen Transaktion nicht unterst\u00FCtzt.
42000=Syntaxfehler oder Verletzung einer Zugriffsregel. Details k\u00F6nnen Sie den zus\u00E4tzlichen Fehlernachrichten entnehmen.
42500=Der Benutzer ''{0}'' hat keine {1}-Berechtigung f\u00FCr die Tabelle ''{2}''.''{3}''.
42501=Dem Benutzer ''{0}'' wurde keine {1}-Berechtigung f\u00FCr die Tabelle ''{2}''.''{3}'' mit GRANT erteilt.
42502=Der Benutzer ''{0}'' hat keine {1}-Berechtigung f\u00FCr Spalte ''{2}'' der Tabelle ''{3}''.''{4}''.
42503=Dem Benutzer ''{0}'' wurde keine {1}-Berechtigung f\u00FCr Spalte ''{2}'' der Tabelle ''{3}''.''{4}'' mit GRANT erteilt.
42504=Der Benutzer ''{0}'' hat keine Ausf\u00FChrungsberechtigung f\u00FCr {1} ''{2}''.''{3}''.
42505=Dem Benutzer ''{0}'' wurde keine Ausf\u00FChrungsberechtigung f\u00FCr {1} ''{2}''.''{3}'' mit GRANT erteilt.
42506=Der Benutzer ''{0}'' ist nicht der Eigner von {1} ''{2}''.''{3}''.
42507=Der Benutzer ''{0}'' darf die Operation im Schema ''{1}'' nicht ausf\u00FChren.
42508=Der Benutzer ''{0}'' darf das Schema ''{1}'' nicht erstellen. Diese Anweisung kann nur vom Datenbankeigner abgesetzt werden.
42509=Die angegebene Operation GRANT oder REVOKE ist f\u00FCr das Objekt ''{0}'' nicht zul\u00E4ssig.
4250A=Dem Benutzer ''{0}'' wurde keine Berechtigung f\u00FCr das Objekt ''{2}''.''{3}'' mit {1} erteilt.
4250B=Ung\u00FCltiges Datenbankberechtigungsmerkmal ''{0}\={1}''.
4250C=Benutzer ''{0}'' d\u00FCrfen nicht gleichzeitig in Berechtigungslisten f\u00FCr Lesezugriff und Vollzugriff enthalten sein.
4250D=Benutzer ''{1}'' wiederholt in der Zugriffsliste ''{0}'';
4250E=Interner Fehler\: Ung\u00FCltige ID {0} in der Liste der Anweisungsberechtigungen.
4251A=Anweisung {0} kann nur vom Datenbankeigent\u00FCmer ausgegeben werden.
42601.S.372=Die Anweisung ALTER TABLE kann keine Spalte IDENTITY zu einer Tabelle hinzuf\u00FCgen.
42601=Die Spalte ''{0}'' wurde in einer Anweisung ALTER TABLE als NOT NULL angegeben und die Klausel DEFAULT wurde nicht oder als DEFAULT NULL angegeben.
42605=Die Anzahl der Argumente f\u00FCr die Funktion ''{0}'' ist falsch.
42606=Es wurde eine ung\u00FCltige Hexadezimalkonstante gefunden, die mit ''{0}'' beginnt.
42610=Es k\u00F6nnen nicht alle Argumente f\u00FCr die Funktion COALESCE/VALUE Parameter sein. Mindestens ein Argument darf kein Parameter sein.
42611=Das Attribut length, precision oder scale f\u00FCr die Spalte oder Typzuordnung ''{0}'' ist ung\u00FCltig. 
42613=Es liegen mehrere oder in Konflikt stehende Schl\u00FCsselw\u00F6rter mit der Klausel ''{0}'' vor.
42621=Eine mit ''{0}'' definierte Bedingung f\u00FCr die Integrit\u00E4tspr\u00FCfung oder generierte Spalte ist ung\u00FCltig.
42622=Der Name ''{0}'' ist zu lang. Die maximale L\u00E4nge liegt bei ''{1}''.
42734=Der im Kontext ''{1}'' angegebene Name ''{0}'' ist nicht eindeutig.
42802=Die Anzahl der zugeordneten Werte stimmt nicht mit der Anzahl der angegebenen oder impliziten Spalten \u00FCberein.
42803=Ein Ausdruck mit der Spalte ''{0}'' erscheint in der SELECT-Liste und ist nicht Bestandteil einer ''GROUP BY''-Klausel.
42815.S.171=Die Argumente ''{0}'' und ''{1}'' sind nach Datentyp, L\u00E4nge oder Argumentwerten inkompatibel.
42815.S.713=Der Ersatzwert f\u00FCr ''{0}'' ist ung\u00FCltig.
42818=Vergleiche zwischen ''{0}'' und ''{1}'' werden nicht unterst\u00FCtzt. Typen m\u00FCssen vergleichbar sein. String-Typen m\u00FCssen dar\u00FCber hinaus eine \u00FCbereinstimmende Kollation aufweisen. Wenn die Kollation nicht \u00FCbereinstimmt, besteht alternativ die M\u00F6glichkeit, Operanden umzuformen, um so eine Standard-Kollation zu erzwingen (z. B. SELECT tablename FROM sys.systables WHERE CAST(tablename AS VARCHAR(128)) \= ''T1'')
42820=Das Gleitkommaliteral ''{0}'' enth\u00E4lt mehr als 30 Zeichen.
42821=Spalten vom Typ ''{0}'' d\u00FCrfen keine Werte des Typs ''{1}'' enthalten. 
42824=Ein Operand von LIKE ist keine Zeichenfolge, oder der erste Operand ist keine Spalte.
42831=''{0}'' kann Nullwerte enthalten und daher keine Spalte eines Prim\u00E4rschl\u00FCssels oder eines eindeutigen Schl\u00FCssels sein.
42834=SET NULL kann nicht angegeben werden, weil der Fremdschl\u00FCssel ''{0}'' keine Nullwerte enthalten darf. 
42837=ALTER TABLE ''{0}'' gibt Attribute f\u00FCr die Spalte ''{1}'' an, die nicht mit der vorhandenen Spalte kompatibel sind.
42846=Die Typen ''{0}'' k\u00F6nnen nicht in ''{1}'' konvertiert werden.
42877=Der qualifizierte Spaltenname ''{0}'' ist in der ''ORDER BY''-Klausel nicht zul\u00E4ssig.
42878=Die ORDER BY-Klausel einer SELECT UNION-Anweisung unterst\u00FCtzt nur nicht-qualifizierte Spaltenreferenzen und Spaltenpositionsnummern. Andere Ausdr\u00FCcke werden nicht unterst\u00FCtzt.
42879=Die ORDER BY-Klausel enth\u00E4lt eventuell keine Spalte ''{0}'', die die Abfrage DISTINCT angibt und diese Spalte nicht im Abfrageergebnis erscheint.
4287A=Die ORDER BY-Klausel gibt eventuell keinen Ausdruck an, da die Abfrage DISTINCT angibt.
42884=Es wurde keine autorisierte Routine ''{0}'' des Typs ''{1}'' mit kompatiblen Argumenten gefunden.
42886=Der ''{0}''-Parameter ''{1}'' erfordert eine Parametermarke ''?''.
42894=Der DEFAULT-Wert oder der Wert des Attributs IDENTITY ist f\u00FCr die Spalte ''{0}'' ung\u00FCltig.
428C1=Pro Tabelle ist nur eine Identit\u00E4tsspalte zul\u00E4ssig.
428EK=Das Qualifikationsmerkmal f\u00FCr eine deklarierte globale tempor\u00E4re Tabelle muss SESSION sein.
42903=Ung\u00FCltige Verwendung einer Aggregatfunktion.
42908=Die Anweisung CREATE VIEW enth\u00E4lt keine Spaltenliste.
42909=Die CREATE TABLE-Anweisung enth\u00E4lt keine Spaltenliste.
42915=Der Fremdschl\u00FCssel ''{0}'' ist wegen ''{1}'' ung\u00FCltig. 
42916=Das Synonym ''{0}'' kann nicht f\u00FCr ''{1}'' erstellt werden, da dies zu einer Synonymkette in Form einer Schleife f\u00FChren w\u00FCrde.
42939=Mit dem Schemanamen ''{0}'' kann kein Objekt erstellt werden.
4293A=Es kann keine Rolle mit Namen ''{0}'' erstellt werden, das Pr\u00E4fix SYS ist reserviert.
42962=Die LOB-Spalte oder der Parameter ''{0}'' ist in deklarierten globalen tempor\u00E4ren Tabellen oder Prozedurdefinitionen nicht zul\u00E4ssig. 
42972=Eine einem JOIN-Operator zugeordnete ON-Klausel ist ung\u00FCltig.
42995=Die angeforderte Funktion ist nicht auf globale tempor\u00E4re Tabellen anwendbar.
42X01=Syntaxfehler\: {0}.
42X02={0}.
42X03=Der Spaltenname ''{0}'' findet sich in mehr als einer Tabelle der FROM-Liste.
42X04=Die Spalte ''{0}'' ist in keiner Tabelle der FROM-Liste enthalten, erscheint in einer Verkn\u00FCpfungsspezifikation und befindet sich au\u00DFerhalb des Geltungsbereichs derselben oder erscheint in einer HAVING-Klausel und ist nicht in der ''GROUP BY''-Liste enthalten. Wenn es sich um eine Anweisung CREATE oder ALTER TABLE handelt, ist ''{0}'' keine Spalte in der Zieltabelle.
42X05=Die Tabelle/Ansicht ''{0}'' ist nicht vorhanden.
42X06=F\u00FCr die Tabelle ''{0}'' wurden zu viele Ergebnisspalten angegeben.
42X07=Null ist nur in einer VALUES-Klausel innerhalb einer INSERT-Anweisung zul\u00E4ssig.
42X08=Der Konstruktor f\u00FCr die Klasse ''{0}'' kann nicht als \u00E4u\u00DFere virtuelle Tabelle verwendet werden, da die Klasse ''{1}'' nicht implementiert. 
42X09=Die Tabelle oder der Aliasname ''{0}'' wird in der FROM-Liste mehr als einmal verwendet.
42X10=''{0}'' ist kein in diesem Bereich angezeigter Tabellenname.
42X12=Der Spaltenname ''{0}'' erscheint in der Anweisung CREATE TABLE mehr als einmal. 
42X13=Der Spaltenname ''{0}'' erscheint in der Spaltenliste einer INSERT-Anweisung mehr als einmal. 
42X14=''{0}'' ist keine Spalte in der Tabelle oder in VTI ''{1}''.
42X15=Der Spaltenname ''{0}'' erscheint in einer Anweisung ohne eine FROM-Liste.
42X16=Der Spaltenname ''{0}'' erscheint mehrfach in der SET-Klausel einer UPDATE-Anweisung.
42X17=Der Wert ''{0}'' ist in der Merkmalliste einer FROM-Klausel nicht als joinOrder-Spezifikation g\u00FCltig. Es sind nur die Werte FIXED und UNFIXED g\u00FCltig.
42X19=Die WHERE- oder HAVING-Klausel oder die Definition CHECK CONSTRAINT ist ein Ausdruck des Typs ''{0}''. Es muss ein Boolescher Ausdruck sein.
42X23=Der Cursor {0} kann nicht aktualisiert werden.
42X24=Die Spalte {0} wird in der HAVING-Klausel referenziert, befindet sich aber nicht in der GROUP BY-Liste.
42X25=Die Funktion ''{0}'' ist f\u00FCr den Typ ''{1}'' nicht zul\u00E4ssig.
42X26=Die Klasse ''{0}'' f\u00FCr die Spalte ''{1}'' ist nicht vorhanden oder nicht zug\u00E4nglich. Diese Situation kann eintreten, wenn die Klasse nicht \u00F6ffentlich ist.
42X28=Die zu l\u00F6schende Tabelle ''{0}'' ist keine Zieltabelle des Cursors ''{1}''.
42X29=Die zu aktualisierende Tabelle ''{0}'' ist nicht die Zieltabelle des Cursors ''{1}''.
42X30=Der Cursor ''{0}'' wurde nicht gefunden. Pr\u00FCfen Sie, ob das automatische Festschreiben inaktiviert ist.
42X31=Die Spalte ''{0}'' ist nicht in der ''FOR UPDATE''-Liste des Cursors ''{1}'' enthalten.
42X32=Die Spaltenanzahl in der abgeleiteten Spaltenliste muss mit der Spaltenanzahl der Tabelle ''{0}'' \u00FCbereinstimmen.
42X33=Die abgeleitete Spaltenliste enth\u00E4lt zweimal den Spaltennamen ''{0}''.
42X34=Die Liste enth\u00E4lt einen ?-Parameter. Dies ist unzul\u00E4ssig.
42X35=Es ist unzul\u00E4ssig, dass beide Operanden von ''{0}'' ?-Parameter sind.
42X36=F\u00FCr den Operator ''{0}'' darf kein ?-Parameter als Operand angegeben werden.
42X37=Der un\u00E4re Operator ''{0}'' ist f\u00FCr den Typ ''{1}'' nicht zul\u00E4ssig.
42X38=''SELECT *'' ist nur in den Unterabfragen EXISTS und NOT EXISTS zul\u00E4ssig.
42X39=Eine Unterabfrage darf nur eine Spalte zur\u00FCckgeben.
42X40=Ein Operand einer NOT-Anweisung ist kein Boolescher Operand. Das Ergebnis der Auswertung f\u00FCr den Operanden von NOT muss TRUE, FALSE oder UNKNOWN sein.
42X41=Das Merkmal ''{0}'' ist in der Merkmalklausel einer FROM-Liste ung\u00FCltig. (Das Merkmal wurde auf ''{1}'' gesetzt.) 
42X42=F\u00FCr die Spalte ''{0}'' ist kein Korrelationsname zul\u00E4ssig, weil die Spalte in der ''FOR UPDATE''-Liste enthalten ist.
42X43=Die von der Klasse bzw. dem Objekt ''{0}'' zur\u00FCckgegebenen ResultSetMetaData waren Nulldaten. Die ResultSetMetaData m\u00FCssen ungleich null sein, wenn diese Klasse als \u00E4u\u00DFere virtuelle Tabelle verwendet werden soll. 
42X44=Ung\u00FCltige L\u00E4nge ''{0}'' in der Spaltenspezifikation.
42X45={0} ist ein ung\u00FCltiger Typ f\u00FCr das Argument {1} von {2}.
42X46=Es gibt mehrere Funktionen mit dem Namen ''{0}''. Verwenden Sie die vollst\u00E4ndige Signatur oder den spezifischen Namen.
42X47=Es gibt mehrere Prozeduren mit dem Namen ''{0}''. Verwenden Sie die vollst\u00E4ndige Signatur oder den spezifischen Namen.
42X48=Der Wert ''{1}'' hat eine f\u00FCr ''{0}'' nicht g\u00FCltige Genauigkeit.
42X49=Der Wert ''{0}'' ist kein g\u00FCltiges ganzzahliges Literal.
42X50=Es wurde keine mit dem Methodenaufruf {0}.{1}({2}) \u00FCbereinstimmende Methode gefunden, obwohl alle Kombinationen von Objekttypen und Primitive-Typen und alle m\u00F6glichen Typumsetzungen f\u00FCr die zul\u00E4ssigen Parameter des Methodenaufrufs versucht wurden. M\u00F6glicherweise ist die Methode vorhanden, jedoch keine \u00F6ffentliche und/oder statische Methode. Es kann auch sein, dass die Parametertypen beim Aufruf der Methode nicht konvertierbar sind.
42X51=Die Klasse ''{0}'' ist nicht vorhanden oder es kann nicht auf die Klasse zugegriffen werden. Diese Situation kann eintreten, wenn die Klasse nicht \u00F6ffentlich ist.
42X52=Das Aufrufen einer Methode (''{0}'') mit dem Java-Primitive-Typ ''{1}'' als Empf\u00E4nger ist unzul\u00E4ssig.
42X53=Das Pr\u00E4dikat LIKE kann nur mit dem Operand ''CHAR'' oder ''VARCHAR'' verwendet werden. Der Typ ''{0}'' ist unzul\u00E4ssig.
42X54=Der Empf\u00E4nger der Java-Methode ''{0}'' ist ein ?. Dies ist unzul\u00E4ssig.
42X55=Der Tabellenname ''{1}'' muss mit ''{0}'' identisch sein.
42X56=Die Spaltenanzahl in der angezeigten Spaltenliste stimmt nicht mit der Spaltenanzahl im zugrundeliegen Abfrageausdruck in der Anzeigedefinition f\u00FCr ''{0}'' \u00FCberein.
42X57=getColumnCount() f\u00FCr die \u00E4u\u00DFere virtuelle Tabelle ''{0}'' hat den ung\u00FCltigen Wert ''{1}'' zur\u00FCckgegeben. G\u00FCltige Werte sind gr\u00F6\u00DFer als oder gleich 1. 
42X58=Die Spaltenanzahl auf der linken Seite von {0} muss mit der auf der rechten Seite \u00FCbereinstimmen.
42X59=Die Spaltenanzahl muss in allen VALUES-Konstruktoren identisch sein.
42X60=F\u00FCr die Tabelle ''{1}'' wurde f\u00FCr das Merkmal insertMode der ung\u00FCltige Wert ''{0}'' angegeben.
42X61=Die Typen ''{0}'' und ''{1}'' sind nicht mit {2} kompatibel.
42X62=''{0}'' ist im Schema ''{1}'' nicht zul\u00E4ssig.
42X63=Die USING-Klausel hat keine Ergebnisse geliefert. Es k\u00F6nnen keine Parameter gesetzt werden. 
42X64=In der Merkmalliste wurde f\u00FCr das Merkmal useStatistics der ung\u00FCltige Wert ''{0}'' angegeben. Es sind nur die Werte TRUE und FALSE g\u00FCltig. 
42X65=Der Index ''{0}'' ist nicht vorhanden.
42X66=Der Spaltenname ''{0}'' erscheint in der Anweisung CREATE INDEX mehr als einmal.
42X68=Es wurde kein Feld ''{0}'', das zur Klasse ''{1}'' geh\u00F6rt, gefunden. M\u00F6glicherweise ist das Feld vorhanden, jedoch nicht \u00F6ffentlich. Es kann auch sein, dass die Klasse nicht vorhanden oder nicht \u00F6ffentlich ist.
42X69=Es ist unzul\u00E4ssig, mit einem Verweisausdruck des Java-Primitive-Typs ''{1}'' auf ein Feld (''{0}'') zu verweisen.
42X70=Die Anzahl der Spalten in der Tabellenspaltenliste entspricht nicht der Anzahl der Spalten im zu Grunde liegenden Abfrageausdruck in der Tabellendefinition f\u00FCr ''{0}''.
42X71=Ung\u00FCltiger Datentyp ''{0}'' f\u00FCr Spalte ''{1}''.
42X72=Es wurde kein statisches Feld ''{0}'', das zur Klasse ''{1}'' geh\u00F6rt, gefunden. M\u00F6glicherweise ist das Feld vorhanden, jedoch nicht \u00F6ffentlich und/oder statisch. Es kann auch sein, dass die Klasse nicht vorhanden oder nicht \u00F6ffentlich ist. 
42X73=Die Methodenaufl\u00F6sung f\u00FCr die Signatur {0}.{1}({2}) war mehrdeutig. (Es gibt keine Methode mit maximaler Spezifik.)
42X74=Ung\u00FCltige Syntax f\u00FCr Anweisung CALL.
42X75=Es wurde kein Konstruktor mit der Signatur {0}({1}) gefunden. M\u00F6glicherweise sind die Parametertypen beim Aufruf der Methode nicht konvertierbar.
42X76=F\u00FCr mindestens eine Spalte (''{0}'') des hinzuzuf\u00FCgenden prim\u00E4ren Schl\u00FCssels besteht keine Eintragspflicht. F\u00FCr alle Spalten eines Prim\u00E4rschl\u00FCssels muss Eintragspflicht gelten.
42X77=Die Spaltenposition ''{0}'' befindet sich au\u00DFerhalb des Bereichs f\u00FCr den Abfrageausdruck.
42X78=Die Spalte ''{0}'' ist nicht im Ergebnis des Abfrageausdrucks enthalten.
42X79=Der Spaltenname ''{0}'' erscheint mehr als einmal im Ergebnis des Abfrageausdrucks.
42X80=Die VALUES-Klausel muss mindestens einen Eintrag enthalten und keiner der Eintr\u00E4ge darf leer sein. 
42X82=Die USING-Klausel hat mehr als eine Zeile zur\u00FCckgegeben. Es sind nur aus einer Zeile bestehende ResultSets zul\u00E4ssig.
42X83=Die Integrit\u00E4tsbedingungen f\u00FCr die Spalte ''{0}'' erfordern, dass f\u00FCr die Spalte sowohl Eintragspflicht als auch keine Eintragspflicht gilt.
42X84=Der Index ''{0}'' wurde erstellt, um die Integrit\u00E4tsbedingung ''{1}'' durchzusetzen. Der Index kann nur gel\u00F6scht werden, wenn die Integrit\u00E4tsbedingung gel\u00F6scht wird.
42X85=Die Integrit\u00E4tsbedingung ''{0}'' muss sich in demselben Schema wie die Tabelle ''{1}'' befinden.
42X86=ALTER TABLE ist gescheitert. F\u00FCr die Tabelle ''{1}'' gibt es keine Integrit\u00E4tsbedingung ''{0}''. 
42X87=Mindestens ein Ergebnisausdruck (THEN oder ELSE) des Ausdrucks ''{0}'' muss ''?'' sein. 
42X88=Ein Bedingungsausdruck enth\u00E4lt einen nicht-Booleschen Operanden. Das Ergebnis der Auswertung f\u00FCr den Operanden eines Bedingungsausdrucks muss TRUE, FALSE oder UNKNOWN sein. 
42X89=Die Typen ''{0}'' und ''{1}'' sind untereinander nicht kompatibel. Keiner der Typen kann dem jeweils anderen zugeordnet werden. 
42X90=F\u00FCr die Tabelle ''{0}'' wurde mehr als eine Integrit\u00E4tsbedingung f\u00FCr Prim\u00E4rschl\u00FCssel angegeben.
42X91=Der Integrit\u00E4tsbedingungsname ''{0}'' erscheint in der Anweisung CREATE TABLE mehr als einmal. 
42X92=Der Spaltenname ''{0}'' erscheint mehr als einmal in der Spaltenliste einer Integrit\u00E4tsbedingung.
42X93=Die Tabelle ''{0}'' enth\u00E4lt die Definition einer Integrit\u00E4tsbedingung mit der Spalte ''{1}'', die nicht in der Tabelle ist.
42X94={0} ''{1}'' ist nicht vorhanden.
42X96=Der Datenbankklassenpfad enth\u00E4lt die unbekannte JAR-Datei ''{0}''.
42X98=In einer VIEW-Definition sind Parameter nicht zul\u00E4ssig.
42X99=Parameter sind in einer TABLE-Definition nicht zul\u00E4ssig.
42Y00=Die Klasse ''{0}'' implementiert nicht org.apache.derby.iapi.db.AggregateDefinition und kann deshalb nicht als Aggregatausdruck verwendet werden.
42Y01=Die Integrit\u00E4tsbedingung ''{0}'' ist ung\u00FCltig.
42Y03=''{0}'' wurde nicht als Funktion oder Prozedur erkannt.
42Y04=F\u00FCr die Funktion mit EXTERNAL NAME ''{0}'' kann kein Prozedur oder Funktion erstellt werden, weil keine Liste in Schreibweise mit Trennzeichen vorliegt. Das erwartete Format ist <vollst\u00E4ndiger Java-Pfad>.<Methodenname>. 
42Y05=Es gibt keinen Fremdschl\u00FCssel mit dem Namen ''{0}''.
42Y07=Das Schema ''{0}'' ist nicht vorhanden.
42Y08=F\u00FCr Systemtabellen sind Integrit\u00E4tsbedingungen f\u00FCr Fremdschl\u00FCssel unzul\u00E4ssig.
42Y09=Void-Methoden sind nur in einer CALL-Anweisung erlaubt.
42Y10=Bei einem Tabellenkonstruktor, der nicht in einer INSERT-Anweisung enthalten ist, befinden sich alle ?-Parameter in einer der Spalten. F\u00FCr jede Spalte muss mindestens eine der Zeilen einen nichtparametrischen Wert enthalten.
42Y11=F\u00FCr die Klausel ''{0}'' ist eine Verkn\u00FCpfungsspezifikation erforderlich.
42Y12=Die ON-Klausel f\u00FCr ein JOIN ist ein Ausdruck vom Typ ''{0}''. Es muss ein Boolescher Ausdruck sein.
42Y13=Der Spaltenname ''{0}'' erscheint in der Anweisung CREATE VIEW mehr als einmal.
42Y16=In der Klasse ''{1}'' wurde keine \u00F6ffentliche statische Methode ''{0}'' gefunden. M\u00F6glicherweise ist die Methode vorhanden, jedoch keine \u00F6ffentliche und/oder statische Methode.  
42Y22=Das Aggregat {0} kann nicht f\u00FCr den Typ {1} verwendet werden.
42Y23=F\u00FCr Spalte {0} wurde eine falsche JDBC-Typangabe zur\u00FCckgegeben.
42Y24=Die Ansicht ''{0}'' kann nicht aktualisiert werden. (Es ist derzeit nicht m\u00F6glich, Ansichten zu aktualisieren.) 
42Y25=''{0}'' ist eine Systemtabelle. Benutzer d\u00FCrfen den Inhalt dieser Tabelle nicht \u00E4ndern.
42Y26=Aggregate sind in der ''GROUP BY''-Liste nicht zul\u00E4ssig.
42Y27=Parameter sind in der Ausl\u00F6seaktion unzul\u00E4ssig.
42Y29=Die SELECT-Liste einer nicht gruppierten Abfrage enth\u00E4lt mindestens einen ung\u00FCltigen Ausdruck. Wenn die SELECT-Liste mindestens ein Aggregat enth\u00E4lt, m\u00FCssen alle Eintr\u00E4ge g\u00FCltige Aggregatausdr\u00FCcke sein.
42Y30=Die SELECT-Liste einer gruppierten Abfrage enth\u00E4lt mindestens einen ung\u00FCltigen Ausdruck. Eine SELECT-Liste mit GROUP BY darf nur g\u00FCltige Gruppierungsausdr\u00FCcke und g\u00FCltige Aggregatausdr\u00FCcke enthalten. 
42Y32=Die Aggregatorklasse ''{0}'' f\u00FCr das Aggregat ''{1}'' des Typs {2} implementiert nicht com.ibm.db2j.aggregates.Aggregator. 
42Y33=Das Aggregat {0} enth\u00E4lt ein oder mehrere Aggregat(e).
42Y34=Der Spaltenname ''{0}'' stimmt mit mehr als einer Ergebnisspalte in der Tabelle ''{1}'' \u00FCberein.
42Y35=Der Spaltenverweis ''{0}'' ist ung\u00FCltig. Wenn die SELECT-Liste mindestens ein Aggregat enth\u00E4lt, m\u00FCssen alle Eintr\u00E4ge g\u00FCltige Aggregatausdr\u00FCcke sein. 
42Y36=Der Spaltenverweis ''{0}'' ist ung\u00FCltig. Eine SELECT-Liste mit GROUP BY darf nur g\u00FCltige Gruppierungsausdr\u00FCcke und g\u00FCltige Aggregatausdr\u00FCcke enthalten. 
42Y37=''{0}'' ist ein Java-Primitive-Typ und kann nicht mit diesem Operator verwendet werden.
42Y38=insertMode \= replace ist f\u00FCr eine Einf\u00FCgung unzul\u00E4ssig, bei der sich SELECT auf die Zieltabelle ''{0}'' bezieht.
42Y39=''{0}'' darf nicht in einer ''CHECK CONSTRAINT''-Definition erscheinen, da dies zu unvorhersehbaren Ergebnissen f\u00FChren k\u00F6nnte.
42Y40=''{0}'' erscheint mehrfach in der Spalte UPDATE OF des Ausl\u00F6sers ''{1}''.
42Y41=''{0}'' kann nicht direkt mit EXECUTE STATEMENT aufgerufen werden, da dieses Objekt Teil eines Ausl\u00F6sers ist.
42Y42=Die Nachkommastellenangabe ''{1}'' ist keine g\u00FCltige Angabe f\u00FCr {0}.
42Y43=Die Nachkommastellenangabe ''{0}'' ist keine g\u00FCltige Angabe mit einer Genauigkeit von ''{1}''.
42Y44=In der Merkmalliste einer FROM-Liste wurde der ung\u00FCltige Schl\u00FCssel ''{0}'' angegeben. Derzeit werden folgende Schl\u00FCssel unter Beachtung der Gro\u00DF-/Kleinschreibung unterst\u00FCtzt\: ''{1}'' 
42Y45=Der VTI ''{0}'' kann nicht gebunden werden, weil es sich um einen spezifischen Ausl\u00F6ser-VTI handelt und diese Anweisung nicht zu einer Ausl\u00F6seaktion oder WHEN-Klausel geh\u00F6rt.
42Y46=Ung\u00FCltige Merkmalliste in FROM-Liste. F\u00FCr die Tabelle ''{1}'' gibt es keinen Index ''{0}''.
42Y48=Ung\u00FCltige Merkmalliste in FROM-Liste. Entweder gibt es f\u00FCr Tabelle ''{1}'' keine benannte Integrit\u00E4tsbedingung ''{0}'' oder es gibt keinen Sicherungsindex f\u00FCr die Integrit\u00E4tsbedingung.
42Y49=F\u00FCr den Merkmalschl\u00FCssel ''{0}'' wurden mehrere Werte angegeben. 
42Y50=Die Merkmalliste f\u00FCr die Tabelle ''{0}'' darf Indexwerte oder Werte f\u00FCr Integrit\u00E4tsbedingungen enthalten, jedoch nicht beide zusammen.
42Y55=''{0}'' kann nicht f\u00FCr ''{1}'' ausgef\u00FChrt werden, da dieses Objekt nicht vorhanden ist.
42Y56=In der Merkmalliste f\u00FCr die Tabelle ''{1}'' wurde die ung\u00FCltige Verkn\u00FCpfungsstrategie ''{0}'' angegeben. Derzeit werden folgende Werte als Verkn\u00FCpfungsstrategie unterst\u00FCtzt\: ''hash'' und ''nestedloop''.
42Y58=Beim Konvertieren des Wertes ''{0}'' f\u00FCr den vorrangigen Optimizer-Wert ''{1}'' ist eine NumberFormatException eingetreten.
42Y59=F\u00FCr das \u00DCberschreiben von hashInitialCapacity wurde der ung\u00FCltige Wert ''{0}'' angegeben. Der Wert muss gr\u00F6\u00DFer als 0 sein.
42Y60=F\u00FCr das \u00DCberschreiben von hashLoadFactor wurde der ung\u00FCltige Wert ''{0}'' angegeben. Der Wert muss gr\u00F6\u00DFer als  0.0 und kleiner als oder gleich 1.0 sein.
42Y61=F\u00FCr das \u00DCberschreiben von hashMaxCapacity wurde der ung\u00FCltige Wert ''{0}'' angegeben. Der Wert muss gr\u00F6\u00DFer als 0 sein.
42Y62=''{0}'' ist f\u00FCr ''{1}'' nicht zul\u00E4ssig, weil es sich um eine Ansicht handelt.
42Y63=Eine Hash-Verkn\u00FCpfung erfordert ein optimierbares equijoin-Pr\u00E4dikat f\u00FCr eine Spalte im ausgew\u00E4hlten Index oder Heap-Speicher. Die Tabelle bzw. der Index ''{0}'' enth\u00E4lt f\u00FCr keine Spalte ein optimierbares equijoin-Pr\u00E4dikat. Verwenden Sie den vorrangigen Optimizer-Wert ''index'', um einen Index oder Heap-Speicher f\u00FCr die Tabelle ''{1}'' anzugeben.
42Y64=Der bulkFetch-Wert ''{0}'' ist ung\u00FCltig. der Mindestwert f\u00FCr bulkFetch ist 1.
42Y65=bulkFetch ist f\u00FCr ''{0}''-Verkn\u00FCpfungen nicht zul\u00E4ssig.
42Y66=bulkFetch ist f\u00FCr aktualisierbare Cursor nicht zul\u00E4ssig. 
42Y67=Das Schema ''{0}'' kann nicht gel\u00F6scht werden.
42Y69=F\u00FCr diese Anweisung wurde kein g\u00FCltiger Ausf\u00FChrungsplan gefunden. Dies kann eine der beiden folgenden Ursachen haben\: Sie haben eine Hash-Verkn\u00FCpfungsstrategie angegeben, obwohl keine Hash-Verkn\u00FCpfung erlaubt ist (kein optimierbares equijoin) oder Sie versuchen, zwei externe virtuelle Tabellen zu verkn\u00FCpfen, die jeweils aufeinander verweisen, so dass die Anweisung nicht ausgewertet werden kann.
42Y70=Der Benutzer hat eine unzul\u00E4ssige Verkn\u00FCpfungsreihenfolge angegeben. Dies kann daran liegen, dass eine zu verkn\u00FCpfende Spalte einer inneren Tabelle als Parameter an eine \u00E4u\u00DFere virtuelle Tabelle \u00FCbergeben wird.
42Y71=Die Systemfunktion oder Prozedur ''{0}'' kann nicht gel\u00F6scht werden.
42Y82=Die vom System generierte gespeicherte vorbereitete Anweisung ''{0}'' kann mit DROP STATEMENT nicht gel\u00F6scht werden. Sie geh\u00F6rt zu einem Ausl\u00F6ser.
42Y83=Eine Nullangabe ohne Typ ist kein zul\u00E4ssiges Argument f\u00FCr das Aggregat {0}. Setzen Sie die Nullangabe in einen geeigneten Typ um.
42Y84=''{0}'' darf in einer DEFAULT-Definition nicht erscheinen.
42Y85=Das Schl\u00FCsselwort DEFAULT ist in einer VALUES-Klausel nur zul\u00E4ssig, wenn die VALUES-Klausel in einer INSERT-Anweisung erscheint.
42Y90=FOR UPDATE ist f\u00FCr diesen Anweisungstyp unzul\u00E4ssig. 
42Y91=Die USING-Klausel ist in EXECUTE STATEMENT f\u00FCr eine Ausl\u00F6seaktion nicht zul\u00E4ssig.
42Y92={0}-Ausl\u00F6ser k\u00F6nnen nur auf \u00DCbergangsvariablen/Tabellen des Typs {1} Bezug nehmen.
42Y93=Ung\u00FCltige REFERENCING-Klausel\: F\u00FCr jede Art von \u00DCbergangsvariable/-tabelle ist nur ein Name zul\u00E4ssig.
42Y94=Ein AND oder OR verwendet einen nicht-Booleschen Operanden. Das Ergebnis der Auswertung f\u00FCr die Operanden von AND und OR muss TRUE, FALSE oder UNKNOWN sein.
42Y95=Der Operator ''{0}'' mit dem linken Operanden vom Typ ''{1}'' und dem rechten Operanden vom Typ ''{2}'' wird nicht unterst\u00FCtzt.
42Y96.U=UNKNOWN
42Y97=Ung\u00FCltiges Escape-Zeichen in Zeile ''{0}'', Spalte ''{1}''.
42Y98.U=In Zeile {1}, Spalte {2}, wurde "{0}" gefunden
42Y99.U=Lexikalischer Fehler in Zeile {0}, Spalte {1}. Festgestellt wurde\: {2}
42Z00.U=Java-Methodenaufruf oder Feldverweis
42Z01.U=UNTYPED
42Z02=Mehrere DISTINCT-Aggregate werden zur Zeit nicht unterst\u00FCtzt.
42Z07=Aggregate sind in der ON-Klausel nicht erlaubt.
42Z08=F\u00FCr ''{0}'' gibt es einen aktivierten Ausl\u00F6ser ({1}). Eine Ersetzung durch Masseneinf\u00FCgung ist deshalb unzul\u00E4ssig.
42Z09.U=COLUMN DEFAULT f\u00FCr
42Z11.U=Datenstrom
42Z15=F\u00FCr die Spalte ''{0}'' wurde ein ung\u00FCltiger Typ angegeben. Der Typ einer Spalte kann nicht ge\u00E4ndert werden.
42Z16=Die L\u00E4nge kann nur f\u00FCr Spalten des Typs VARCHAR ge\u00E4ndert werden. 
42Z17=F\u00FCr die Spalte ''{0}'' wurde eine ung\u00FCltige L\u00E4nge angegeben. Der L\u00E4ngenwert muss gr\u00F6\u00DFer als die aktuelle Spaltenl\u00E4nge sein.
42Z18=Die Spalte ''{0}'' geh\u00F6rt zur Integrit\u00E4tsbedingung ''{1}'' f\u00FCr Fremdschl\u00FCssel. Wenn Sie die L\u00E4nge dieser Spalte \u00E4ndern m\u00F6chten, sollten Sie zun\u00E4chst die Integrit\u00E4tsbedingung l\u00F6schen. F\u00FChren Sie dann ALTER TABLE aus und erstellen Sie die Integrit\u00E4tsbedingung neu.
42Z19=Die Spalte ''{0}'' wird von mindestens einer Integrit\u00E4tsbedingung ''{1}'' f\u00FCr Fremdschl\u00FCssel referenziert. Wenn Sie die L\u00E4nge dieser Spalte \u00E4ndern m\u00F6chten, sollten Sie zun\u00E4chst die verweisenden Integrit\u00E4tsbedingungen l\u00F6schen. F\u00FChren Sie dann ALTER aus und erstellen Sie die Integrit\u00E4tsbedingungen neu.
42Z20=Die Eintragspflicht f\u00FCr die Spalte ''{0}'' kann nicht aufgehoben werden. Sie geh\u00F6rt zu einem Prim\u00E4rschl\u00FCssel oder einer eindeutigen Integrit\u00E4tsbedingung, der bzw. die keine Spalten ohne Eintragspflicht enthalten darf.
42Z21=F\u00FCr die Identit\u00E4t der Spalte ''{0}'' wurde ein ung\u00FCltiges Inkrement angegeben. Das Inkrement muss ungleich null sein. 
42Z22=F\u00FCr die Identit\u00E4tsspalte ''{0}'' wurde ein ung\u00FCltiger Typ angegeben. F\u00FCr Identit\u00E4tsspalten sind nur die Typen BIGINT, INT und SMALLINT g\u00FCltig.
42Z23=Es wurde versucht, die Identit\u00E4tsspalte ''{0}'' zu \u00E4ndern. 
42Z24=Beim Identit\u00E4tswert f\u00FCr die Spalte ''{1}'' in der Tabelle ''{0}'' ist es zu einem \u00DCberlauf gekommen.
42Z25=INTERNER FEHLER beim Identit\u00E4tsz\u00E4hler. UPDATE wurde ohne Argumente mit dem aktuellen Wert \= NULL aufgerufen.
42Z26=F\u00FCr die Spalte ''{0}'' mit einer Standardidentit\u00E4t kann die Eintragspflicht nicht aufgehoben werden.
42Z27=F\u00FCr die Spalte ''{0}'' ohne Eintragspflicht kann keine Standardidentit\u00E4t festgelegt werden.
42Z30.U=Zeit f\u00FCr dieses ResultSet \=
42Z31.U=Zeit f\u00FCr dieses ResultSet und folgende \=
42Z32.U=Aufschl\u00FCsselung der Gesamtzeit\:
42Z33.U=Konstruktorzeit (Millisekunden) \=
42Z34.U=Zeit f\u00FCr open (Millisekunden) \=
42Z35.U=Zeit f\u00FCr next (Millisekunden) \=
42Z36.U=Zeit f\u00FCr close (Millisekunden) \=
42Z37.U=Keine
42Z38.U=Es ist keine Positionierungsangabe verf\u00FCgbar, weil dieses ResultSet nie ge\u00F6ffnet wurde.
42Z39.U=Unerwartete Ausnahme {0} beim Anfordern des Positionierers.
42Z40.U={0} f\u00FCr die ersten {1} Spalten.
42Z41.U=Semantik mit Nullsortierung in den folgenden Spalten\:
42Z42.U=Spalten-ID
42Z43.U=Operator
42Z44.U=Nullsortierung
42Z45.U=Unbekannter R\u00FCckgabewert
42Z46.U=Vergleichsergebnis negieren
42Z47.U=Das Abrufen des Abfrageplans als Zeichenfolge wird derzeit f\u00FCr {0} nicht unterst\u00FCtzt
42Z48.U=ID f\u00FCr Spalte [{0}][{1}]
42Z50=INTERNER FEHLER\: F\u00FCr {0} kann kein Code generiert werden.
42Z53=INTERNER FEHLER\: Der f\u00FCr die Knotenauswahl {0} zu generierende Aktivierungstyp ist unbekannt.
42Z54.U=Diese Ausnahme stoppt die Anweisung nach der Syntaxanalyse. Es ist keine weitere Verarbeitung erforderlich.
42Z55.U=Die Ausf\u00FChrung wurde nach der Syntaxanalyse von der Debug-Markierung StopAfterParsing gestoppt.
42Z56.U=Die Ausf\u00FChrung wurde nach der Bindung von der Debug-Markierung StopAfterBinding gestoppt.
42Z57.U=Die Ausf\u00FChrung wurde nach der Optimierung von der Debug-Markierung StopAfterOptimizing gestoppt.
42Z58.U=Die Ausf\u00FChrung wurde nach der Generierung von der Debug-Markierung StopAfterGenerating gestoppt.
42Z60={0} ist nur zul\u00E4ssig, wenn das Datenbankmerkmal {1} den Wert ''{2}'' hat.
42Z70=Die direkte Bindung an einen XML-Wert ist nicht zul\u00E4ssig. Versuchen Sie, XMLPARSE zu verwenden.
42Z71=In Ergebnislisten der Ausgangsebene sind keine XML-Werte zul\u00E4ssig. Versuchen Sie, XMLSERIALIZE zu verwenden.
42Z72=Fehlende SQL/XML-Schl\u00FCsselw\u00F6rter ''{0}'' in Zeile {1}, Spalte {2}
42Z73=Ung\u00FCltiger Zieltyp f\u00FCr XMLSERIALIZE\: ''{0}''.
42Z74=Nicht unterst\u00FCtztes XML-Feature\: ''{0}''.
42Z75=Ein XML-Abfrageausdruck muss ein Zeichenfolgenliteral sein.
42Z76=Mehrere XML-Kontextelemente sind unzul\u00E4ssig.
42Z77=Ein Kontextelement muss vom Typ ''XML'' sein. ''{0}'' ist unzul\u00E4ssig.
42Z79=Der Parametertyp f\u00FCr XMLPARSE kann nicht bestimmt werden. Versuchen Sie, ein CAST zu verwenden.
42Z80.U=SERIALIZABLE
42Z81.U=READ COMMITED
42Z82.U=EXCLUSIVE
42Z83.U=INSTANTANEOUS SHARE
42Z84.U=SHARE
42Z85.U=TABLE
42Z86.U=ROW
42Z87.U=SHARE TABLE
42Z88.U=SHARE ROW
42Z90=Die Klasse ''{0}'' gibt kein aktualisierbares ResultSet zur\u00FCck.
42Z91=Unterabfrage
42Z92=wiederholbares Lesen
42Z93=Die Integrit\u00E4tsbedingungen ''{0}'' und ''{1}'' haben dieselben Spaltengruppen. Dies ist unzul\u00E4ssig. 
42Z97=Die Umbenennung der Spalte ''{0}'' verletzt die Bedingung ''{1}'' f\u00FCr die Integrit\u00E4tspr\u00FCfung.
42Z99=Ein Zeichenfolgen- oder Hexadezimalliteral darf 64 K nicht \u00FCberschreiten.
42Z9A=unbest\u00E4tigtes Lesen
42Z9B=Die externe virtuelle Tabellenschnittstelle unterst\u00FCtzt keine BLOB- oder CLOB-Spalten. ''{0}''-Spalte ''{1}''. 
42Z9D.S.1=In BEFORE-Ausl\u00F6sern sind keine Prozeduren erlaubt, die SQL-Daten modifizieren.
42Z9D=''{0}''-Anweisungen sind in ''{1}''-Ausl\u00F6sern nicht zul\u00E4ssig.
42Z9E=Die Integrit\u00E4tsbedingung ''{0}'' ist keine {1}-Integrit\u00E4tsbedingung.
42Z9F=Zu viele Indizes ({0}) f\u00FCr die Tabelle {1}. Die Begrenzung liegt bei {2}.
42ZA0=Anweisung zu komplex. Versuchen Sie, die Abfrage weniger komplex zu schreiben. Dieser Fehler l\u00E4sst sich h\u00E4ufig dadurch beheben, dass viele duplizierte Ausdr\u00FCcke entfernt werden oder dass die Abfrage unterteilt wird und Zwischenergebnisse in einer tempor\u00E4ren Tabelle gespeichert werden.
42ZA1=Ung\u00FCltige SQL im Batch\: ''{0}''
42ZA2=Der Operand LIKE mit dem Typ {0} und der Kollation {1} ist nicht kompatabel mit dem LIKE-Musteroperand mit Typ {2} und Kollation {3}.
42ZA3=Die Tabelle wird den Kollationtyp {0} haben, der sich von der Kollation des Schemas {1} unterscheidet, da dieser Vorgang nicht unterst\u00FCtzt wird.
42ZB1=Parameterstil DERBY_JDBC_RESULT_SET ist nur bei Tabellenfunktionen zul\u00E4ssig.
42ZB2=F\u00FCr Tabellenfunktionen gibt es nur den Parameterstil DERBY_JDBC_RESULT_SET.
42ZB3=XML ist nicht zul\u00E4ssig als Datentyp einer von einer Tabellenfunktion zur\u00FCckgegebenen Spalte.
42ZB4=''{0}''.{1}'' identifiziert keine Tabellenfunktion.
42ZB5=Klasse ''{0}'' implementiert VTICosting,  stellt jedoch keinen \u00F6ffentlichen, parameterlosen Konstruktor bereit.
43X00.U=Zugeordnet zu
43X01.U=Nummer der ersten Unterabfrage
43X02.U=ANY-ResultSet
43X03.U=Anzahl der \u00D6ffnungsvorg\u00E4nge
43X04.U=Gesehene Zeilen
43X05.U=Quellenergebnisliste
43X06.U=Nummer der letzten Unterabfrage
43X07.U=Vom Optimizer gesch\u00E4tzte Zeilenzahl
43X08.U=Vom Optimizer gesch\u00E4tzte Kosten
43X09.U=Sekunden
43X10.U=Summe
43X11.U=Knoten
43X12.U={0} ist derzeit nicht f\u00FCr {1} implementiert.
43X13.U=DELETE-ResultSet mit
43X14.U=Tabelle wird gesperrt
43X15.U=Zeile wird gesperrt
43X16.U=verz\u00F6gert
43X17.U=Gel\u00F6schte Zeilen
43X18.U=Aktualisierte Indizes
43X19.U=L\u00F6schen
43X20.U=ResultSet f\u00FCr spezifisches skalares Aggregat
43X21.U=Eingegebene Zeilen
43X22.U=Spezifisches skalares Aggregat
43X23.U=ResultSet der spezifischen Suche f\u00FCr {0} unter Verwendung von {1} {2}
43X24.U=Integrit\u00E4tsbedingung
43X25.U=Index
43X26.U=ResultSet der spezifischen Suche f\u00FCr {0}
43X27.U=auf der Isolationsstufe {0} unter Verwendung einer Sperre des Typs {1}
43X28.U=Suchinformationen
43X29.U=Die spezifische Spalte hat die Nummer
43X30.U=Die spezifischen Spalten haben die Nummern
43X31.U=Gr\u00F6\u00DFe der Hash-Tabelle
43X32.U=Gefilterte Zeilen
43X33.U=Zeit f\u00FCr next in Millisekunden/Zeile
43X34.U=Anfangspunkt
43X35.U=Endpunkt
43X36.U=Qualifikationsmerkmale f\u00FCr Suche
43X37.U=Qualifikationsmerkmale f\u00FCr next
43X38.U=f\u00FCr {0} mit {1}
43X39.U=Spezifische Suche
43X40.U=Sortierungsinformationen
43X41.U=ResultSet f\u00FCr gruppiertes Aggregat
43X42.U=mit spezifischem Aggregat
43X43.U=In sortierter Reihenfolge
43X44.U=Gruppiertes Aggregat
43X45.U=EXISTS-Verkn\u00FCpfung f\u00FCr Hash-Eintr\u00E4ge
43X46.U=ResultSet f\u00FCr EXISTS-Verkn\u00FCpfung von Hash-Eintr\u00E4gen
43X47.U=Verkn\u00FCpfung von Hash-Eintr\u00E4gen
43X48.U=ResultSet f\u00FCr Verkn\u00FCpfung von Hash-Eintr\u00E4gen
43X49.U=Nach links erweiterte Verkn\u00FCpfung von Hash-Eintr\u00E4gen
43X50.U=ResultSet f\u00FCr nach links erweiterte Verkn\u00FCpfung von Hash-Eintr\u00E4gen
43X51.U=ResultSet der Hash-Suche f\u00FCr {0} unter Verwendung von {1} {2}
43X52.U=ResultSet der Hash-Suche f\u00FCr {0}
43X53.U=Der Hash-Schl\u00FCssel ist die Spaltennummer
43X54.U=Die Hash-Schl\u00FCssel sind die Spaltennummern
43X55.U=Hash-Suche
43X56.U=Zugeordnete Unterabfragen
43X57.U=ResultSet f\u00FCr Hash-Tabelle
43X58.U=Hash-Tabelle
43X59.U=alle
43X60.U=ResultSet Indexzeile zu Basiszeile f\u00FCr {0}
43X61.U=Heap-Spalten, auf die zugegriffen wurde
43X62.U=f\u00FCr {0}
43X63.U=Indexzeile zu Basiszeile
43X64.U=Einf\u00FCgemodus\: Einf\u00FCgen von Massendaten
43X65.U=Einf\u00FCgemodus\: normal (das Einf\u00FCgen von Massendaten ist nicht m\u00F6glich, da die Tabelle nicht leer ist)
43X66.U=Einf\u00FCgemodus\: normal
43X67.U=INSERT-ResultSet mit
43X68.U=Eingef\u00FCgte Zeilen
43X69.U=Einf\u00FCgen
43X70.U=Verkn\u00FCpfung
43X71.U=ResultSet der letzten Schl\u00FCsselindexsuche f\u00FCr {0} unter Verwendung von Index {1}
43X72.U=bei Isolationsstufe {0} mit {1}-Sperrung wurde vom Optimizer ausgew\u00E4hlt
43X73.U=Tabellensuche
43X74.U=Indexsuche
43X75.U=f\u00FCr {0}
43X76.U=Gespeichertes ResultSet
43X77.U=Erstellungszeit f\u00FCr tempor\u00E4res Konglomerat (Millisekunden)
43X78.U=Abrufzeit f\u00FCr tempor\u00E4res Konglomerat (Millisekunden)
43X79.U=Gesehene Zeilen von links
43X80.U=Gesehene Zeilen von rechts
43X81.U=Zur\u00FCckgegebene Zeilen
43X82.U=Linke Ergebnisliste
43X83.U=Rechte Ergebnisliste
43X84.U=Verkn\u00FCpfung \u00FCber vorhandene verschachtelte Schleife
43X85.U=ResultSet f\u00FCr Verkn\u00FCpfung \u00FCber vorhandene verschachtelte Schleife
43X86.U=Verkn\u00FCpfung \u00FCber verschachtelte Schleife
43X87.U=ResultSet f\u00FCr Verkn\u00FCpfung \u00FCber verschachtelte Schleife
43X88.U=Zur\u00FCckgegebene leere rechte Zeilen
43X89.U=Nach links erweiterte Verkn\u00FCpfung \u00FCber verschachtelte Schleife
43X90.U=ResultSet f\u00FCr nach links erweiterte Verkn\u00FCpfung \u00FCber verschachtelte Schleife
43X91.U=ResultSet normalisieren
43X92.U=Einzelwert-ResultSet
43X93.U=ResultSet f\u00FCr eingeschr\u00E4nkte Projektion
43X94.U=Einschr\u00E4nkung
43X95.U=Projektion
43X96.U=Einschr\u00E4nkungszeit (Millisekunden)
43X97.U=Projektionszeit (Millisekunden)
43X98.U=Eingeschr\u00E4nkte Projektion
43X99.U=Zeilen-ResultSet
43Y00.U=ResultSet f\u00FCr skalares Aggregat
43Y01.U=Optimierung f\u00FCr Indexschl\u00FCssel
43Y02.U=Skalares Aggregat
43Y03.U=Scroll-insensitives ResultSet
43Y04.U=Anzahl der Lesevorg\u00E4nge in der Hash-Tabelle
43Y05.U=Anzahl der Schreibvorg\u00E4nge in der Hash-Tabelle
43Y06.U=ResultSet f\u00FCr Sortierung
43Y07.U=Duplikate eliminieren
43Y08.U=Sortieren
43Y09.U=ResultSet der Indexsuche f\u00FCr {0} unter Verwendung von {1} {2}
43Y10.U=ResultSet der Tabellensuche f\u00FCr {0}
43Y11.U=Tats\u00E4chlich verwendete Sperrung\: Sperrung auf Tabellenebene.
43Y12.U=Abrufgr\u00F6\u00DFe
43Y13.U=Qualifikationsmerkmale
43Y14.U=ResultSet f\u00FCr Gesamtverkn\u00FCpfung
43Y15.U=Gesamtverkn\u00FCpfung
43Y16.U=ResultSet mit Sperrung f\u00FCr {0} aktualisieren
43Y17.U=Aktualisierte Zeilen
43Y18.U=Aktualisieren
43Y19.U=VTI-ResultSet f\u00FCr {0}
43Y20.U=VTI
43Y21.U=Einbezogene Unterabfragen
43Y22.U=Name der Anweisung
43Y23.U=Text der Anweisung
43Y24.U=Zeit f\u00FCr Syntaxanalyse
43Y25.U=Bindezeit
43Y26.U=Optimierungszeit
43Y27.U=Generierungszeit
43Y28.U=Kompilierzeit
43Y29.U=Ausf\u00FChrungszeit
43Y30.U=Anfangszeitmarke der Kompilierung
43Y31.U=Endzeitmarke der Kompilierung
43Y32.U=Anfangszeitmarke der Ausf\u00FChrung
43Y33.U=Endzeitmarke der Ausf\u00FChrung
43Y44.U=Text des Plans f\u00FCr die Anweisungsausf\u00FChrung
43Y45.U=Laufzeit 100 %, {0} Sekunden
43Y46.U=ResultSet f\u00FCr VTI einf\u00FCgen
43Y47.U=ResultSet f\u00FCr VTI l\u00F6schen
43Y49.U=VTI einf\u00FCgen
43Y50.U=VTI l\u00F6schen
43Y51.U=ResultSet f\u00FCr mehrstufiges L\u00F6schen
43Y52.U=ResultSet f\u00FCr mehrstufiges L\u00F6schen mit
43Y53.U=Referenzielle Aktionen f\u00FCr abh\u00E4ngige Tabellen
43Y54.U=Referenzielle Aktion f\u00FCr abh\u00E4ngige Tabelle beginnen
43Y55.U=Referenzielle Aktion f\u00FCr abh\u00E4ngige Tabelle beenden
43Y56.U=Der Benutzer hat f\u00FCr {0} folgende vorrangigen Optimizer-Werte angegeben\: {1}
43Y57.U=Der Benutzer hat f\u00FCr join folgende vorrangigen Optimizer-Werte angegeben\: {0}
43Y58.U=Intersect ResultSet
43Y59.U=Intersect
43Y60.U=Except ResultSet
43Y61.U=Except
44X00.U=Name des SQL-Typs
44X05.U=n\u00E4chster Fehler
46001=Ausnahme beim Zugriff auf die JAR-Datei mit dem URL ''{0}''.
46J01=Die Signatur der Java-Methode hat ein ung\u00FCltiges Format.
46J02=Die Signatur der Java-Methode enth\u00E4lt eine falsche Anzahl von Parametern ({0}). Erwartet wurden {1} Parameter.
54002=Eine mit ''{0}'' beginnende Zeichenfolgekonstante ist zu lang.
54004=Die Anweisung SELECT enth\u00E4lt zu viele Elemente in GROUP BY, ORDER BY oder in der Auswahlliste.
54006=Die aus der Operation {0} resultierende L\u00E4nge ist gr\u00F6\u00DFer als {1}.
54008=Die Anweisung CREATE INDEX gibt zu viele Spalten an. (Das Maximum liegt bei 16.)
54011=F\u00FCr die Tabelle oder Ansicht {1} wurden zu viele Spalten ({0}) angegeben. Die Begrenzung liegt bei {2}.
54023=Die maximale Anzahl von Parametern f\u00FCr eine Prozedur wurde \u00FCberschritten. Die Begrenzung liegt bei {0} und die Anzahl der Parameter f\u00FCr die Prozedur {1} ist {2}.
54038=Die maximale Verschachtelungstiefe f\u00FCr Ausl\u00F6ser wurde \u00FCberschritten.
57017.C=Eine Konvertierung von der Quellen-Codepage {0} in die Ziel-Codepage {1} ist nicht verf\u00FCgbar. Die Verbindung wurde beendet.
58009.C.10=Netzprotokollausnahme\: Nur die VCM-L\u00E4nge oder nur die VCS-L\u00E4nge darf gr\u00F6\u00DFer als 0 sein. Die Verbindung wurde beendet.
58009.C.11=Die Verbindung wurde beendet, weil die Codierung nicht unterst\u00FCtzt wird.
58009.C.12=Netzprotokollausnahme\: Der tats\u00E4chliche Codepunkt {0} stimmt nicht mit dem erwarteten Codepunkt {1} \u00FCberein. Die Verbindung wurde beendet.
58009.C.13=Netzprotokollausnahme\: Die DDM-Objektgruppe enth\u00E4lt weniger als 4 Bytes Daten. Die Verbindung wurde beendet.
58009.C.14=Netzprotokollausnahme\: Der Objekt-Stack ist zum Ende der Syntaxanalyse der DDS-Kette nicht leer. Die Verbindung wurde beendet.
58009.C.15=Netzprotokollausnahme\: Die L\u00E4nge eines DDS-Segments war zum Ende der Syntaxanalyse der DDS-Kette gr\u00F6\u00DFer als 0. Die Verbindung wurde beendet.
58009.C.16=Netzprotokollausnahme\: Das n\u00E4chste DDS-Segment der Kette hat dieselbe ID wie das aktuelle Segment. Die Verbindung wurde beendet.
58009.C.17=Netzprotokollausnahme\: Beim Lesen des Eingabedatenstroms (Parameter {0}) wurde das Ende des Datenstroms vorzeitig erreicht. Die Verbindung wurde beendet.
58009.C.18=Netzprotokollausnahme\: Ung\u00FCltiges FDOCA-LID. Die Verbindung wurde beendet.
58009.C.19=Netzprotokollausnahme\: SECTKN wurde nicht zur\u00FCckgegeben. Die Verbindung wurde beendet.
58009.C.20=Netzprotokollausnahme\: Nur NVCM oder nur NVCS darf ungleich null sein. Die Verbindung wurde beendet.
58009.C.21=Netzprotokollausnahme\: Die SCLDTA-L\u00E4nge {0} ist f\u00FCr RDBNAM ung\u00FCltig. Die Verbindung wurde beendet.
58009.C.7=Netzprotokollausnahme\: Die SCLDTA-L\u00E4nge {0} ist f\u00FCr RDBCOLID ung\u00FCltig. Die Verbindung wurde beendet.
58009.C.8=Netzprotokollausnahme\: Die SCLDTA-L\u00E4nge {0} ist f\u00FCr PKGID ung\u00FCltig. Die Verbindung wurde beendet.
58009.C.9=Netzprotokollausnahme\: Die SCLDTA-L\u00E4nge {0} ist f\u00FCr SQLAM {1} ung\u00FCltig. Die Verbindung wurde beendet.
58010.C=Es wurde ein Netzprotokollfehler gefunden. Es konnte keine Verbindung hergestellt werden, weil der Manager {0} der Version {1} vom Server nicht unterst\u00FCtzt wird. 
58014.C=Der DDM-Befehl 0x{0} wird nicht unterst\u00FCtzt. Die Verbindung wurde beendet.
58015.C=Das DDM-Objekt 0x{0} wird nicht unterst\u00FCtzt. Die Verbindung wurde beendet.
58016.C=Der DDM-Parameter 0x{0} wird nicht unterst\u00FCtzt. Die Verbindung wurde beendet.
58017.C=Der DDM-Parameterwert 0x{0} wird nicht unterst\u00FCtzt. M\u00F6glicherweise liegt eine eingegebene Hostvariable nicht in dem vom Server unterst\u00FCtzten Bereich. Die Verbindung wurde beendet.
A001=SCHWERWIEGENDER FEHLER\: Es gibt keinen Authentifizierungsservice f\u00FCr das System.
A002=SCHWERWIEGENDER FEHLER\: Es gibt keinen Authentifizierungsservice f\u00FCr die Datenbank.
A011=WARNUNG\: Im Merkmal {0} ist kein LDAP-Server-/Hostname angegeben. Es wird localhost\:389 verwendet.
A020=Ung\u00FCltige Authentifizierung.
C000=Die Klasse {0} wurde in die Datei {1} geschrieben. Stellen Sie Unterst\u00FCtzung f\u00FCr die Datei und die folgende Ausnahme bereit\: {2}
C001=Die Klasse {0} enth\u00E4lt in der JAR-Datei {1} einen unbekannten Zertifikattyp. Es wurde ein X509-Zertifikat erwartet.
C002=Beim Zugriff auf die Klasse {0} in der JAR-Datei {1} wurde die folgende Sicherheitsausnahme ausgel\u00F6st\: {2}
C003=Ausnahme beim Laden der Datenbank-JAR-Datei {0} - {1}
C004=Veraltetes Klassenladeprogramm f\u00FCr die Klasse {0}
C005=Das Ladeprogramm f\u00FCr Datenbankklassen wurde gestartet - derby.database.classpath\=''{0}''
C006={0} wurde aus der Datenbank-JAR-Datei {1} geladen.
C007=Beim Laden der Klasse {0} aus der JAR-Datei {1} eingetretene Ausnahme\: {2}
D001=\:\nBooten von Derby Version {0}\: Instanz {1}\nf\u00FCr das Datenbankverzeichnis {2} {3}\n
D002=\:\nDie Instanz {0} wird heruntergefahren.
D004=Die Sicherung f\u00FCr die Datenbank in {0} wurde unter {1} gestartet.
D005=Die alte Sicherungskopie wurde von {0} nach {1} verschoben.
D006=Die Sicherung des Datensegments in {0} ist abgeschlossen. 
D007=F\u00FCr die Datenbank wurde service.properties editiert, um den Standardprotokollservice verwenden zu k\u00F6nnen.
D008=Fehler beim Editieren von service.properties f\u00FCr die Datenbank. Abgebrochene Sicherung\: {0}
D009=Das Protokollverzeichnis wurde von {0} nach {1} kopiert.
D010=Die Sicherung wurde wegen eines Fehlers abgebrochen.
D011=Die alte Sicherungskopie mit der Adresse {0} wurde gel\u00F6scht.
D012=Die Sicherung ist abgeschlossen. Protokolladresse\: {0} \n
D013=WARNUNG\: Die Datenbank wird mit {0}\={1} gebootet. Bei Verwendung dieses Modus kann die Datenbank m\u00F6glicherweise nicht wiederhergestellt werden. Festgeschriebene Transaktionen k\u00F6nnen verloren gehen. Es ist m\u00F6glich, dass die Datenbank einen inkonsistenten Status hat. Verwenden Sie diesen Modus nur, wenn Sie die genannten Folgen bewusst in Kauf nehmen m\u00F6chten. \n
D014=Lesezugriff
I015=org.apache.derby.jdbc.EmbeddedDriver wurde nicht im JDBC-Treibermanager registriert.
I024=Die Datenbank ist nicht verf\u00FCgbar.
I025=Der JDBC-Treiber ist nicht verf\u00FCgbar.
I026=Die JDBC-Treiberregistrierung mit java.sql.DriverManager ist gescheitert. {0} 
J004=Datenbankidentit\u00E4t
J005=Derby herunterfahren
J007=Datenbank erstellen
J008=keine Details
J010=Datenbank auf Datentr\u00E4ger verschl\u00FCsseln
J013=Datenbank erweitern
J016=Verschl\u00FCsselungsserviceprovider
J017=Verschl\u00FCsselungsalgorithmus
J018=L\u00E4nge des Chiffrierschl\u00FCssels
J019=Externer Chiffrierschl\u00FCssel
J020=Geheimer Chiffrierschl\u00FCssel
J021=Gebietsschema der Datenbank
J022=Benutzername
J023=Benutzerkennwort
J025=Verzeichnispfad protokollieren
J028=Sicherungspfad f\u00FCr aktualisierende Wiederherstellung
J031=Kollation f\u00FCr Zeichen-Datentypen
J100=Die Netzserverklasse {0} wurde nicht gefunden. Ihr Klassenpfad sollte derbynet.jar enthalten.
J101=Die Netzserverklasse {0} konnte nicht geladen werden. {1}. \u00DCberpr\u00FCfen Sie die Integrit\u00E4t Ihrer Datei derbynet.jar.
J102=Beim Starten des Netzservers wurde eine Ausnahme ausgel\u00F6st. {0}
J103=Beim Herunterfahren des Netzservers wurde eine Ausnahme ausgel\u00F6st. {0}
J104=Das Objekt ist bereits geschlossen.
J105=Die Genauigkeit liegt bei mehr als 31 Stellen\!
J106=Ursache ist eine Ausnahme
J107=Fehler f\u00FCr das Batch-Element
J108=Der Security Manager erlaubt nicht den Zugriff auf das Systemmerkmal {0}.
J109=Es wurde eine inkorrekte TCP/IP-Client-Konfiguration festgestellt. Die IP-Adresse Ihres lokalen Hosts kann nicht bestimmt werden. ''{0}''.  Stellen Sie sicher, dass die IP-Adresse Ihrer Client-Maschine ordnungsgem\u00E4\u00DF konfiguriert ist.
J110=Der Sicherheitsmechanismus wird nicht unterst\u00FCtzt
J111=Das Kennwort fehlt
J112=Die Benutzer-ID fehlt
J113=Die Benutzer-ID oder das Kennwort ist ung\u00FCltig
J114=Die Benutzer-ID wurde entzogen
J115=Das neue Kennwort ist ung\u00FCltig
J116=Fehler\: Die Verwendung des Security Service kann nicht erneut versucht werden
J117=Im ACCSEC-Befehl fehlt das erforderliche Sicherheitstoken (SECTKN) oder das Token ist ung\u00FCltig
J118=Das Kennwort ist abgelaufen
J120=nicht angegeben
J121=Der Benutzer ist nicht berechtigt, auf die Datenbank zuzugreifen.
J122=Vor dem Befehl, mit dem der Zugriff auf die Datenbank angefordert wird (ACCRDB), wurde ein Befehl abgesetzt, der Services der Datenbank anfordert.
J123=Der angeforderte Befehl hat eine implementierungsspezifische, nicht in der Spezifikation enthaltene Bedingung festgestellt, f\u00FCr die keine Nachricht implementiert ist.
J124=Der Befehl f\u00FCr den Zugriff auf die relationale Datenbank (ACCRDB) kann nicht abgesetzt werden, weil der Zugriff auf die Datenbank bereits erfolgte.
J125=Es wurde ein Fehler durch einen abweichenden Datendeskriptor festgestellt.
J126=Es wurde ein Dialogprotokollfehler festgestellt. Ursache\: 0x{0}.
J127=parseSQLDIAGGRP ist noch nicht implementiert.
J128=Der Cursor ist nicht offen.
J129=F\u00FCr eine bereits ge\u00F6ffnete Abfrage wurde ein Befehl Open Query abgesetzt.
J130=Es wurde ein Fehler wegen einer ung\u00FCltigen FDOCA-Beschreibung festgestellt.
J131=Ein PROTOCOL Datenstrom-Syntaxfehler wurde erfasst.  Ursache\: 0x{0}. Versuch, eine Reintext-Verbindung mit einem SSL-konformen Server herzustellen?
J132=Benutzername f\u00FCr die Verbindung
J133=Kennwort des Benutzers f\u00FCr die Verbindung
J134=Negative Werte sind f\u00FCr die Eigenschaft maxStatements nicht zul\u00E4ssig\: {0}
L001=------------  ANFANG DER FEHLERNACHRICHT -------------\n
L002=------------  ENDE DER FEHLERNACHRICHT -------------\n
L003=\n------------  ANFANG DES FEHLERBEREICHS F\u00DCR SHUTDOWN -------------\n
L004=\n------------  ENDE DES FEHLERBEREICHS F\u00DCR SHUTDOWN -------------\n
L005=\n------------  ANFANG DES FEHLERBEREICHS -------------\n
L006=\n------------  ENDE DES FEHLERBEREICHS -------------\n
L007=WARNUNG\: Die Protokolldatei wurde nicht gefunden. Es wird ein neues Protokoll erstellt. M\u00F6glicherweise ist die Datenbank inkonsistent.
L008=Die inkompatible alte Protokolldatei {0} wird gel\u00F6scht
L009=Die alte Protokolldatei {0} wird gel\u00F6scht
L010=In der Datei {0} wurde ein unvollst\u00E4ndiger Protokollsatz gefunden. Der Inhalt der Protokolldatei wird von der Position {1} bis zum Dateiende bei {2} gel\u00F6scht.
L011=Der Pr\u00FCfpunktd\u00E4mon hat eine Standardausnahme abgefangen.
L012=Der Protokollsatz ist nicht als erster Satz der Transaktion markiert. Die Transaktion wurde jedoch nicht in der Transaktionstabelle gefunden. {0}
L013=Der Protokollsatz ist als erster Satz der Transaktion markiert. Die Transaktion ist jedoch bereits in der Transaktionstabelle enthalten. {0}
L014=Falsche Anfangsadresse
L015=Es ist bereits eine neue Protokolldatei vorhanden, die nicht gel\u00F6scht werden kann. {0}
L016=Die neue Protokolldatei {0} kann nicht erstellt werden.
L017=Die neue Protokolldatei {0} kann nicht erstellt werden. Grund\: {1}.
L018=Das System hat m\u00F6glicherweise einen inkonsistenten Status. Fehlende Datei\: {0}
L020=WARNUNG\: Die Datenbank wurde mindestens einmal mit {0}\={1} gebootet. Durch die Verwendung dieses Modus kann die Datenbank m\u00F6glicherweise nicht wiederhergestellt werden. Festgeschriebene Transaktionen k\u00F6nnen verloren gegangen sein. Es ist m\u00F6glich, dass die Datenbank einen inkonsistenten Status hat. Dies kann zu unerwarteten Fehlern f\u00FChren.\n
L021=WARNUNG\: Die Datenbank wurde zu einem fr\u00FCheren Zeitpunkt oder jetzt mit {0} \= {1} gebootet. Bei Verwendung des Modus {0}\={1} ist die Wiederherstellbarkeit nicht gew\u00E4hrleistet. Wahrscheinlich ist das die Ursache f\u00FCr diesen Boot-Fehler.\n
M001=\n\# ********************************************************************\n\# ***           Diese Datei darf NICHT bearbeitet werden.          ***\n\# *** BEIM \u00C4NDERN DES DATEIINHALTS K\u00D6NNEN DATEN BESCH\u00C4DIGT WERDEN. ***\n\# ********************************************************************
R001=----  ANFANG DER REPLIKATIONSFEHLERMELDUNG ({0}) ----
R002=--------------------  ENDE  DER REPLIKATIONSFEHLERMELDUNG ---------------------
R003=Replication Slave-Rolle gestartet f\u00FCr Datenbank''{0}''.
R004=Replication Slave-Rolle angehalten f\u00FCr Datenbank''{0}''.
R005=Schwerer Fehler bei Replication Slave f\u00FCr Datenbank''{0}''. Replikation wird angehalten
R006=Verbindung unterbrochen zum Replication Master von Datenbank ''{0}''.
R007=Replication Master-Rolle gestartet f\u00FCr Datenbank''{0}''.
R008=Replication Master-Rolle angehalten f\u00FCr Datenbank''{0}''.
R009=Fehler bei Log Shipping
R010=Replication Master versucht Wiederaufnahme der Verbindung mit Slave f\u00FCr Datenbank ''{0}''.
R011=Replication Slave-Datenbank ''{0}'' h\u00F6rt Verbindungen von Master auf ''{1}\:{2}'' ab.
R012=Replikationsverbindungs-Handle ist ung\u00FCltig.
R013=Replikationsmeldung ({0})\: {1}
R020=Failover erfolgreich ausgef\u00FChrt f\u00FCr Datenbank ''{0}''.
S0022=Die Spalte ''{0}'' wurde nicht gefunden.
X0A00.S=Die Auswahlliste enth\u00E4lt zweimal die Spalte ''{0}''. In Abfragen mit der Klausel GROUP BY oder HAVING ist dies nicht zul\u00E4ssig. Verwenden Sie f\u00FCr eine der in Konflikt stehenden Spalten einen Aliasnamen, um eindeutige Spaltennamen zu erhalten.
X0X02.S=Die Tabelle ''{0}'' kann nicht im Modus ''{1}'' gesperrt werden.
X0X03.S=Ung\u00FCltiger Transaktionsstatus. Der gehaltene Cursor erfordert dieselbe Isolationsstufe.
X0X05.S=Die Tabelle/Ansicht ''{0}'' ist nicht vorhanden.
X0X07.S=Die JAR-Datei ''{0}'' kann nicht entfernt werden, weil sie im derby.database.classpath ''{0}'' enthalten ist.
X0X0D.S=Ung\u00FCltige L\u00E4nge f\u00FCr Spalten-Array ''{0}''. Um erstellte Schl\u00FCssel zur\u00FCckzugeben, muss  das Spalten-Array die L\u00E4nge 1 haben und darf nur die Identit\u00E4tsspalte enthalten.
X0X0E.S=Tabelle ''{1}'' verf\u00FCgt nicht \u00FCber eine automatisch generierte Spalte an der Spaltenposition ''{0}''.
X0X0F.S=Tabelle ''{1}'' verf\u00FCgt nicht \u00FCber eine automatisch generierte Spalte mit der Bezeichnung ''{0}''.
X0X10.S=Die USING-Klausel hat mehr als eine Zeile zur\u00FCckgegeben. Es sind nur aus einer Zeile bestehende ResultSets zul\u00E4ssig.
X0X11.S=Die USING-Klausel hat keine Ergebnisse geliefert. Es k\u00F6nnen keine Parameter gesetzt werden. 
X0X13.S=Die JAR-Datei ''{0}'' ist nicht im Schema ''{1}'' enthalten.
X0X57.S=Es wurde versucht, einen Java-Wert vom Typ ''{0}'' in einen SQL-Wert aufzunehmen. Es ist jedoch kein entsprechender SQL-Typ vorhanden. Der Java-Wert ist wahrscheinlich das Ergebnis eines Methodenaufrufs oder Feldzugriffs.
X0X60.S=Ein Cursor mit dem Namen ''{0}'' ist bereits vorhanden.
X0X61.S=Die Werte f\u00FCr die Spalte ''{4}'' im Index ''{0}'' und in der Tabelle ''{1}.{2}'' passen nicht zur Zeilenposition {3}. Der Wert im Index ist ''{5}'' und der Wert in der Basistabelle ist ''{6}''. Der vollst\u00E4ndige Indexschl\u00FCssel mit der Zeilenposition ist ''{7}''. Zur Fehlerberichtigung wird empfohlen, den Index erneut zu erstellen.
X0X62.S=Die Tabelle ''{0}'' und der Index ''{1}'' sind inkonsistent. Bei dem Versuch, die Zeilenposition ''{2}'' aus der Tabelle abzurufen, ist ein Fehler aufgetreten. Der vollst\u00E4ndige Indexschl\u00FCssel mit der Zeilenposition ist ''{3}''. Zur Fehlerberichtigung wird empfohlen, den Index erneut zu erstellen.
X0X63.S=IOException ''{0}'' empfangen.
X0X67.S=Spalten des Typs ''{0}'' k\u00F6nnen in den Anweisungen CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT oder DISTINCT nicht verwendet werden, da f\u00FCr diesen Typ keine Vergleiche unterst\u00FCtzt werden.
X0X81.S={0} ''{1}'' ist nicht vorhanden.
X0X85.S=Der Index ''{0}'' wurde nicht erstellt, weil ''{1}'' kein g\u00FCltiger Indextyp ist.
X0X86.S=0 ist ein ung\u00FCltiger Parameterwert f\u00FCr ResultSet.absolute(int row).
X0X87.S=ResultSet.relative(int row) kann nicht aufgerufen werden, wenn sich der Cursor nicht in einer Zeile befindet.
X0X95.S=Die Operation ''{0}'' kann f\u00FCr das Objekt ''{1}'' nicht ausgef\u00FChrt werden, weil es ein offenes ResultSet gibt, das von diesem Objekt abh\u00E4ngig ist.
X0X99.S=Der Index ''{0}'' ist nicht vorhanden.
X0Y16.S=''{0}'' ist keine Ansicht. Falls es sich um eine Tabelle handelt, verwenden Sie DROP TABLE.
X0Y23.S=Die Operation ''{0}'' kann f\u00FCr das Objekt ''{1}'' nicht ausgef\u00FChrt werden, weil die Ansicht ''{2}'' von diesem Objekt abh\u00E4ngt.
X0Y24.S=Die Operation ''{0}'' kann f\u00FCr das Objekt ''{1}'' nicht ausgef\u00FChrt werden, weil die Anweisung ''{2}'' von diesem Objekt abh\u00E4ngt.
X0Y25.S=Die Operation ''{0}'' kann f\u00FCr das Objekt ''{1}'' nicht ausgef\u00FChrt werden, weil die {2} ''{3}'' von diesem Objekt abh\u00E4ngt.
X0Y26.S=Der Index ''{0}'' muss sich in demselben Schema wie die Tabelle ''{1}'' befinden.
X0Y28.S=Der Index ''{0}'' kann f\u00FCr die Systemtabelle ''{1}'' nicht erstellt werden. Benutzer k\u00F6nnen keine Indizes f\u00FCr Systemtabellen erstellen.
X0Y32.S={0} ''{1}'' ist bereits in {2} ''{3}'' vorhanden.
X0Y38.S=Der Index ''{0}'' kann nicht erstellt werden, weil die Tabelle ''{1}'' nicht vorhanden ist.
X0Y41.S=Die Integrit\u00E4tsbedingung ''{0}'' ist ung\u00FCltig, weil die referenzierte Tabelle {1} keinen Prim\u00E4rschl\u00FCssel hat. F\u00FCgen Sie einen Prim\u00E4rschl\u00FCssel zu {1} hinzu oder geben Sie explizit die Spalten einer eindeutigen Integrit\u00E4tsbedingung an, auf die dieser Fremdschl\u00FCssel verweist. 
X0Y42.S=Die Integrit\u00E4tsbedingung ''{0}'' ist ung\u00FCltig\: die Spalten des Fremdschl\u00FCssels stimmen vom Typ her nicht mit den referenzierten Spalten \u00FCberein.
X0Y43.S=Die Integrit\u00E4tsbedingung ''{0}'' ist ung\u00FCltig\: die Anzahl der Spalten in {0}({1}) stimmt nicht mit der Anzahl der Spalten im referenzierten Schl\u00FCssel ({2}) \u00FCberein.
X0Y44.S=Die Integrit\u00E4tsbedingung ''{0}'' ist ung\u00FCltig\: in der Tabelle ''{1}'' gibt es keine Integrit\u00E4tsbedingung f\u00FCr eindeutige oder Prim\u00E4rschl\u00FCssel, die nach Anzahl und Typ der Spalten mit dem Fremdschl\u00FCssel \u00FCbereinstimmt.
X0Y45.S=Die Integrit\u00E4tsbedingung ''{0}'' f\u00FCr Fremdschl\u00FCssel kann nicht zur Tabelle {1} hinzugef\u00FCgt oder f\u00FCr die Tabelle aktiviert werden, weil es f\u00FCr einen oder mehrere Fremdschl\u00FCssel keine \u00FCbereinstimmenden referenzierten Schl\u00FCssel gibt. 
X0Y46.S=Die Integrit\u00E4tsbedingung ''{0}'' ist ung\u00FCltig\: die referenzierte Tabelle {1} ist nicht vorhanden.
X0Y54.S=Das Schema ''{0}'' kann nicht gel\u00F6scht werden, weil es nicht leer ist.
X0Y55.S=Die Zeilenanzahl in der Basistabelle stimmt nicht mit der Zeilenanzahl in mindestens einem der Indizes f\u00FCr die Tabelle \u00FCberein. Der Index ''{0}'' f\u00FCr Tabelle ''{1}.{2}'' hat {3} Zeilen, die Basistabelle jedoch {4} Zeilen. Zur Fehlerberichtigung wird empfohlen, den Index erneut zu erstellen.
X0Y56.S=''{0}'' ist f\u00FCr die Systemtabelle ''{1}'' unzul\u00E4ssig.
X0Y57.S=Eine Spalte mit nicht aufhebbarer Eintragspflicht kann nicht zur Tabelle ''{0}'' hinzugef\u00FCgt werden, weil die Tabelle mindestens eine Zeile enth\u00E4lt. Spalten mit nicht aufhebbarer Eintragspflicht k\u00F6nnen nur zu leeren Tabellen hinzugef\u00FCgt werden.
X0Y58.S=Der Versuch, zur Tabelle ''{0}'' eine Integrit\u00E4tsbedingung f\u00FCr Prim\u00E4rschl\u00FCssel hinzuzuf\u00FCgen, ist gescheitert, weil es f\u00FCr die Tabelle bereits eine Integrit\u00E4tsbedingung dieses Typs gibt. F\u00FCr eine Tabelle kann es nur eine Integrit\u00E4tsbedingung f\u00FCr Prim\u00E4rschl\u00FCssel geben.
X0Y59.S=Der Versuch, Integrit\u00E4tsbedingungen zur Tabelle ''{1}'' hinzuzuf\u00FCgen bzw. f\u00FCr die Tabelle zu aktivieren, ist gescheitert, weil die Tabelle {2} Zeile(n) enth\u00E4lt, die die folgende(n) zu pr\u00FCfende(n) Integrit\u00E4tsbedingung(en) verletzt bzw. verletzen\: {0}.
X0Y63.S=Der Befehl f\u00FCr die Tabelle ''{0}'' ist gescheitert, weil im Prim\u00E4rschl\u00FCssel oder den Spalten der eindeutigen Integrit\u00E4tsbedingung bzw. des Index Nulldaten gefunden wurden. Alle Spalten eines prim\u00E4ren oder eindeutigen Indexschl\u00FCssels m\u00FCssen ungleich null sein. 
X0Y66.S=In einer verschachtelten Verbindung kann keine COMMIT-Operation abgesetzt werden, solange es eine anstehende Operation in der \u00FCbergeordneten Verbindung gibt.
X0Y67.S=In einer verschachtelten Verbindung kann keine ROLLBACK-Operation abgesetzt werden, solange es eine anstehende Operation in der \u00FCbergeordneten Verbindung gibt.
X0Y68.S={0} ''{1}'' ist bereits vorhanden.
X0Y69.S={1} wird im Ausl\u00F6ser {0} nicht unterst\u00FCtzt.
X0Y70.S=INSERT, UPDATE und DELETE sind f\u00FCr die Tabelle {1} unzul\u00E4ssig, weil der Ausl\u00F6ser {0} aktiv ist.
X0Y71.S=Eine Transaktionsbearbeitung wie SET ISOLATION ist unzul\u00E4ssig, weil der Ausl\u00F6ser {0} aktiv ist.
X0Y72.S=F\u00FCr ''{0}'' gibt es einen aktivierten Ausl\u00F6ser ({1}). Eine Ersetzung durch Masseneinf\u00FCgung ist deshalb unzul\u00E4ssig.
X0Y77.S=Die Anweisung set transaction isolation kann nicht f\u00FCr eine laufende globale Transaktion abgesetzt werden, weil die globale Transaktion damit implizit festgeschrieben werden w\u00FCrde.
X0Y78.S.1={0}.executeQuery() kann nicht aufgerufen werden, weil mehrere Ergebnislisten zur\u00FCckgegeben wurden. Verwenden Sie zum Abrufen mehrerer Ergebnisse {1}.execute().
X0Y78.S.2={0}.executeQuery() wurde aufgerufen. Es wurde jedoch keine Ergebnisliste zur\u00FCckgegeben. Verwenden Sie f\u00FCr Nicht-Abfragen {1}.executeUpdate().
X0Y78.S=Statement.executeQuery() kann nicht mit einer Anweisung ausgef\u00FChrt werden, die eine Zeilenanzahl zur\u00FCckgibt.
X0Y79.S=Statement.executeUpdate() kann nicht mit einer Anweisung ausgef\u00FChrt werden, die ein ResultSet zur\u00FCckgibt.
X0Y80.S=ALTER ist f\u00FCr die Tabelle ''{0}'' gescheitert. In der Spalte ''{1}'' wurden Nulldaten gefunden.
X0Y83.S=WARNUNG\: Beim L\u00F6schen einer Zeile aus einer Tabelle wurde die Indexzeile f\u00FCr die Zeile {0} der Basistabelle im Index mit der Konglomerat-ID {1} nicht gefunden. Dieser Fehler wurde automatisch im Rahmen der L\u00F6schoperation behoben.
XBCA0.S=Im {0}-Cache kann kein neues Objekt mit dem Schl\u00FCssel {1} erstellt werden, da es bereits im Cache vorhanden ist. 
XBCM1.S=Beim Laden der generierten Klasse {0} wurde ein Java-Verbindungsfehler ausgel\u00F6st.
XBCM2.S=Es kann keine Instanz der generierten Klasse {0} erstellt werden.
XBCM3.S=Die Methode {1}() ist in der generierten Klasse {0} nicht vorhanden.
XBCM4.S=In der generierten Klasse {0} wurde die Formatbegrenzung f\u00FCr Java-Klassendateien {1} \u00FCberschritten.
XBCX0.S=Ausnahme vom Verschl\u00FCsselungsprovider. Details enth\u00E4lt die n\u00E4chste Ausnahme.
XBCX1.S=Sie initialisieren das Verschl\u00FCsselungsverfahren mit einem ung\u00FCltigen Modus. Der Modus muss ENCRYPT oder DECRYPT sein.
XBCX2.S=Sie initialisieren das Verschl\u00FCsselungsverfahren mit einem zu kurzen Boot-Kennwort. Das Kennwort muss aus mindestens {0} Zeichen bestehen. 
XBCX5.S=Das Boot-Kennwort kann nicht in eine Nullzeichenfolge ge\u00E4ndert werden.
XBCX6.S=Das Boot-Kennwort kann nicht in einen serialisierbaren Typ, der keine Zeichenfolge ist, ge\u00E4ndert werden.
XBCX7.S=Falsches Format f\u00FCr das \u00C4ndern des Boot-Kennworts. G\u00FCltiges Format\: altes_Boot-Kennwort, neues_Boot-Kennwort.
XBCX8.S=Das Boot-Kennwort f\u00FCr eine nicht verschl\u00FCsselte Datenbank kann nicht ge\u00E4ndert werden.
XBCX9.S=Das Boot-Kennwort f\u00FCr eine schreibgesch\u00FCtzte Datenbank kann nicht ge\u00E4ndert werden. 
XBCXA.S=Falsches Boot-Kennwort.
XBCXB.S=Die Verschl\u00FCsselungsauff\u00FCllung ''{0}'' ist fehlerhaft oder es wurde keine Auff\u00FCllung angegeben. Es muss ''Keine Auff\u00FCllung'' verwendet werden.
XBCXC.S=Der Verschl\u00FCsselungsalgorithmus ''{0}'' ist nicht vorhanden. \u00DCberpr\u00FCfen Sie, ob der ausgew\u00E4hlte Provider ''{1}'' diesen Algorithmus unterst\u00FCtzt.
XBCXD.S=Der Verschl\u00FCsselungsalgorithmus kann nach dem Erstellen der Datenbank nicht ge\u00E4ndert werden.
XBCXE.S=Der Verschl\u00FCsselungsprovider kann nach dem Erstellen der Datenbank nicht ge\u00E4ndert werden.
XBCXF.S=Die Klasse ''{0}'', die den Verschl\u00FCsselungsprovider repr\u00E4sentiert, wurde nicht gefunden.
XBCXG.S=Der Verschl\u00FCsselungsprovider ''{0}'' ist nicht vorhanden.
XBCXH.S=Der Verschl\u00FCsselungsalgorithmus ''{0}'' hat nicht das richtige Format. Korrektes Format\: Algorithmus/Feedbackmodus/Keine Auff\u00FCllung.
XBCXI.S=Der Feedbackmodus ''{0}'' wird nicht unterst\u00FCtzt. Unterst\u00FCtzte Feedbackmodi sind CBC, CFB, OFB und ECB.
XBCXJ.S=Die Anwendung verwendet eine \u00E4ltere JCE-Version (Java Cryptography Extension) als 1.2.1. F\u00FChren Sie ein Upgrade auf JCE 1.2.1 durch und wiederholen Sie die Operation. 
XBCXK.S=Der angegebene Chiffrierschl\u00FCssel stimmt nicht mit dem bei der Erstellung der Datenbank verwendeten Chiffrierschl\u00FCssel \u00FCberein. Vergewissern Sie sich, dass Sie den richtigen Chiffrierschl\u00FCssel verwenden, und versuchen Sie es erneut. 
XBCXL.S=Der Pr\u00FCfprozess f\u00FCr den Chiffrierschl\u00FCssel war nicht erfolgreich. Als Ursache kommt ein Fehler beim Zugriff auf die Datei f\u00FCr die Ausf\u00FChrung des Pr\u00FCfprozesses in Frage. Details enth\u00E4lt die n\u00E4chste Ausnahme. 
XBCXM.S=Die L\u00E4nge des externen Chiffrierschl\u00FCssels muss eine gerade Zahl sein.
XBCXN.S=Der externe Chiffrierschl\u00FCssel enth\u00E4lt mindestens ein ung\u00FCltiges Zeichen. Zul\u00E4ssige Zeichen f\u00FCr Hexadezimalzahlen sind 0-9, a-f und A-F.
XBCXO.S=Die Datenbank kann nicht verschl\u00FCsselt werden, wenn eine vorbereitete globale Transaktion vorliegt.
XBCXP.S=Die Datenbank kann nicht mit einem anderen Boot-Kennwort oder einem externen Chiffrierschl\u00FCssel neu verschl\u00FCsselt werden, wenn eine vorbereitete globale Transaktion vorliegt.
XBCXQ.S=Eine schreibgesch\u00FCtzte Datenbank kann nicht f\u00FCr Verschl\u00FCsselung konfiguriert werden.
XBCXR.S=Eine schreibgesch\u00FCtzte Datenbank kann nicht mit einem anderen Boot-Kennwort oder einem externen Chiffrierschl\u00FCssel neu verschl\u00FCsselt werden.
XBCXS.S=Eine Datenbank im Protokollarchivmodus kann nicht f\u00FCr Verschl\u00FCsselung konfiguriert werden.
XBCXT.S=Eine Datenbank im Protokollarchivmodus kann nicht mit einem anderen Boot-Kennwort oder einem externen Chiffrierschl\u00FCssel neu verschl\u00FCsselt werden.
XBCXU.S=Die Verschl\u00FCsselung einer unverschl\u00FCsselten Datenbank ist gescheitert\: {0}
XBCXV.S=Die Verschl\u00FCsselung einer verschl\u00FCsselten Datenbank mit einem neuen Schl\u00FCssel oder einem neuen Kennwort ist gescheitert\: {0}
XBM01.D=Der Systemstart ist aufgrund einer Ausnahme gescheitert. Details enth\u00E4lt die n\u00E4chste Ausnahme. 
XBM02.D=Der Systemstart ist aufgrund fehlender Funktionalit\u00E4t f\u00FCr {0} gescheitert. Stellen Sie sicher, dass der Klassenpfad die richtige Derby-Software enth\u00E4lt.
XBM03.D=Der angegebene Wert ''{0}'' f\u00FCr das Kollationattribut ist ung\u00FCltig, erwartet wurde UCS_BASIC oder TERRITORY_BASED.
XBM04.D=Kollator-Unterst\u00FCtzung von JVM ist nicht verf\u00FCgbar f\u00FCr Datenbank-Gebietsschema ''{0}''.
XBM05.D=Der Systemstart ist aufgrund der fehlenden Produktversionsnummer f\u00FCr {0} gescheitert.
XBM06.D=Der Systemstart ist gescheitert. Auf eine verschl\u00FCsselte Datenbank kann nur mit dem richtigen Boot-Kennwort zugegriffen werden. 
XBM07.D=Der Systemstart ist gescheitert. Das Boot-Passwort muss eine Mindestl\u00E4nge von 8 Bytes haben.
XBM08.D=Die StorageFactory-Klasse {1} unter {0} konnte nicht instanziiert werden.
XBM0G.D=Die Verschl\u00FCsselungssteuerkomponente konnte nicht gestartet werden. Vergewissern Sie sich, dass Sie Java 2 ausf\u00FChren und einen Verschl\u00FCsselungsprovider wie JCE heruntergeladen und in den Klassenpfad aufgenommen haben. 
XBM0H.D=Das Verzeichnis {0} kann nicht erstellt werden.
XBM0I.D=Das Verzeichnis {0} kann nicht entfernt werden.
XBM0J.D=Das Verzeichnis {0} ist bereits vorhanden.
XBM0K.D=Unbekanntes Unterprotokoll f\u00FCr den Datenbanknamen {0}.
XBM0L.D=Die angegebene Authentifizierungsschemaklasse {0} implementiert nicht die Authentifizierungsschnittstelle {1}.
XBM0M.D=Fehler beim Erstellen einer Instanz der Authentifizierungsschemaklasse {0}.
XBM0N.D=Die JDBC-Treiberregistrierung mit java.sql.DriverManager ist gescheitert. Details enth\u00E4lt die n\u00E4chste Ausnahme. 
XBM0P.D=Der Serviceprovider ist schreibgesch\u00FCtzt. Die Operation ist unzul\u00E4ssig. 
XBM0Q.D=Die Datei {0} wurde nicht gefunden. Vergewissern Sie sich, dass es sich um die richtige Sicherungskopie handelt und dass diese nicht besch\u00E4digt ist.
XBM0R.D=Die Datei {0} kann nicht entfernt werden.
XBM0S.D=Die Datei ''{0}'' kann nicht in ''{1}'' umbenannt werden.
XBM0T.D=Mehrdeutiges Unterprotokoll f\u00FCr den Datenbanknamen {0}. 
XBM0U.S=F\u00FCr die ID {0} wurde keine Klasse registriert.
XBM0V.S=Beim Laden der f\u00FCr die ID {0} registrierten Klasse {1} wurde eine Ausnahme ausgel\u00F6st.
XBM0W.S=Beim Erstellen einer Instanz der f\u00FCr die ID {0} registrierten Klasse {1} wurde eine Ausnahme ausgel\u00F6st.
XBM0X.D=Das angegebene Gebietsschema ''{0}'' ist ung\u00FCltig. Erwartet wurde ln[_CO[_variant]]\nln \= zwei Kleinbuchstaben des ISO-639-Sprachencodes, CO \= zwei Gro\u00DFbuchstaben der ISO-3166-Sprachencodes. Siehe java.util.Locale.
XBM0Y.D=Das Sicherungsdatenbankverzeichnis {0} wurde nicht gefunden. Vergewissern Sie sich, dass der angegebene Sicherungspfad stimmt.
XBM0Z.D=Die Datei ''{0}'' kann nicht nach ''{1}'' kopiert werden. Vergewissern Sie sich, dass genug Speicherplatz verf\u00FCgbar ist und dass die notwendigen Berechtigungen vorliegen. 
XCL01.S=Die Ergebnisliste gibt keine Zeilen zur\u00FCck. Die Operation {0} ist unzul\u00E4ssig. 
XCL05.S=Die Aktivierung wurde geschlossen. Die Operation {0} ist unzul\u00E4ssig.
XCL07.S=Der Cursor ''{0}'' wurde geschlossen. Pr\u00FCfen Sie, ob das automatische Festschreiben inaktiviert ist.
XCL08.S=Der Cursor ''{0}'' befindet sich nicht in einer Zeile.
XCL09.S=An die Methode ''{0}'' wurde eine Aktivierung \u00FCbergeben, die nicht mit dem PreparedStatement \u00FCbereinstimmt.
XCL10.S=Ein PreparedStatement wurde kompiliert, und die Parameter wurden ge\u00E4ndert. Wenn Sie JDBC verwenden, m\u00FCssen Sie die Anweisung erneut vorbereiten. 
XCL12.S=Es wurde versucht, einen Datenwert des Typs ''{0}'' in einen Datenwert des Typs ''{1}'' aufzunehmen.
XCL13.S=Die Parameterposition ''{0}'' liegt au\u00DFerhalb des Bereichs. Die Parameteranzahl f\u00FCr diese vorbereitete Anweisung ist ''{1}''.
XCL14.S=Die Spaltenposition ''{0}'' befindet sich au\u00DFerhalb des Bereichs. Die Anzahl der Spalten f\u00FCr dieses ResultSet liegt bei ''{1}''.
XCL15.S=Beim Aufrufen der Methode compareTo() f\u00FCr ein Objekt ''{0}'' ist eine ClassCastException eingetreten. Der Parameter f\u00FCr compareTo() geh\u00F6rt zur Klasse ''{1}''.
XCL16.S.0=Das ResultSet ist nicht ge\u00F6ffnet. Die Operation ''{0}'' ist unzul\u00E4ssig. Pr\u00FCfen Sie, ob das automatische Festschreiben inaktiviert ist.
XCL16.S.1=Das ResultSet ist nicht offen. Pr\u00FCfen Sie, ob das automatische Festschreiben inaktiviert ist.
XCL17.S=Die Anweisung ist in dieser Datenbank nicht zul\u00E4ssig.
XCL18.S=Der Datenstrom des Spaltenwertes im Ergebnis kann nicht zweimal abgerufen werden.
XCL19.S=In der Tabelle ''{0}'' fehlt die Zeile f\u00FCr den Schl\u00FCssel ''{1}''.
XCL20.S=F\u00FCr Kataloge mit dem Versionsstand ''{0}'' kann kein Upgrade auf den Versionsstand ''{1}'' durchgef\u00FChrt werden.
XCL21.S=Sie versuchen, eine Datendefinitionsanweisung (CREATE, DROP oder ALTER) auszuf\u00FChren, w\u00E4hrend Sie eine andere Anweisung vorbereiten. Dies ist unzul\u00E4ssig. Dies kann geschehen, wenn Sie eine Definitionsanweisung aus einem statischen Initialisierungsoperator f\u00FCr eine Java-Klasse heraus ausf\u00FChren, der innerhalb einer SQL-Anweisung verwendet wird.
XCL22.S=Der Parameter {0} kann nicht als OUT-Parameter registriert werden, da er ein IN-Parameter ist. 
XCL23.S=Die SQL-Typnummer ''{0}'' ist kein Typ, der von registerOutParameter() unterst\u00FCtzt wird.
XCL24.S=Der Parameter {0} scheint ein Ausgabeparameter zu sein, wurde jedoch von registerOutParameter() nicht als solcher angegeben. Wenn der Parameter kein Ausgabeparameter ist, muss er auf den Typ {1} gesetzt werden.
XCL25.S=Der Parameter {0} kann nicht als Parameter des Typs {1} registriert werden, weil er dem Typ {2} zugeordnet wird und beide Typen inkompatibel sind.
XCL26.S=Der Parameter {0} ist kein Ausgabeparameter.
XCL27.S=Zur\u00FCckzugebende Ausgabeparameter k\u00F6nnen nicht festgelegt werden.
XCL30.S=Beim Lesen eines ''{0}'' von einem InputStream wurde eine IOException ausgel\u00F6st.
XCL31.S=Die Anweisung wurde geschlossen.
XCL33.S=Aufgrund von L\u00F6schregeleinschr\u00E4nkungen kann die Tabelle nicht als abh\u00E4ngig von der Tabelle {0} definiert werden. (Die Beziehung ist selbstreferenzierend. Eine solche Beziehung besteht bereits zur L\u00F6schregel SET NULL.)
XCL34.S=Aufgrund von L\u00F6schregeleinschr\u00E4nkungen kann die Tabelle nicht als abh\u00E4ngig von der Tabelle {0} definiert werden. (Die Beziehung umfasst zwei oder mehr Tabellen, so dass die Tabelle f\u00FCr das mehrstufige L\u00F6schen auf sich selbst verweist. F\u00FCr alle \u00FCbrigen Tabellen gilt die L\u00F6schregel CASCADE.)
XCL35.S=Aufgrund von L\u00F6schregeleinschr\u00E4nkungen kann die Tabelle nicht als abh\u00E4ngig von der Tabelle {0} definiert werden. (Die Beziehung f\u00FChrt dazu, dass die Tabelle \u00FCber mehrere Beziehungen f\u00FCr das mehrstufige L\u00F6schen auf die angegebene Tabelle verweist. Die L\u00F6schregel der bestehenden Beziehung ist SET NULL.)
XCL36.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel muss {0} sein. (Die referenzielle Integrit\u00E4tsbedingung verweist auf sich selbst. Eine vorhandene auf sich selbst verweisende referenzielle Integrit\u00E4tsbedingung hat die L\u00F6schregel NO ACTION, RESTRICT oder CASCADE.)
XCL37.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel muss {0} sein. (Die referenzielle Integrit\u00E4tsbedingung verweist auf sich selbst, und die Tabelle befindet sich in einer Abh\u00E4ngigkeitsbeziehung mit der L\u00F6schregel CASCADE.)
XCL38.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel muss {0} sein. (Die Beziehung w\u00FCrde dazu f\u00FChren, dass die Tabelle \u00FCber mehrere Beziehungen f\u00FCr das mehrstufige L\u00F6schen auf dieselbe Tabelle verweist. Diese Beziehungen m\u00FCssen dieselbe L\u00F6schregel NO ACTION, RESTRICT oder CASCADE haben.)
XCL39.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel darf nicht CASCADE lauten. (Es liegt eine auf sich selbst verweisende Integrit\u00E4tsbedingung mit der L\u00F6schregel SET NULL, NO ACTION oder RESTRICT vor.)
XCL40.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel darf nicht CASCADE lauten. (Es w\u00FCrde eine Kreisbeziehung entstehen, in der eine Tabelle f\u00FCr das mehrstufige L\u00F6schen auf sich selbst verweisen w\u00FCrde.) Eine der vorhandenen L\u00F6schregeln in der Beziehung ist nicht CASCADE. Die Beziehung kann demzufolge definiert werden, wenn die L\u00F6schregel nicht CASCADE lautet.)
XCL41.S=Die L\u00F6schregel f\u00FCr den Fremdschl\u00FCssel darf nicht CASCADE lauten. (Die Beziehung w\u00FCrde dazu f\u00FChren, dass eine andere Tabelle \u00FCber mehrere Pfade mit verschiedenen L\u00F6schregeln oder der einheitlichen L\u00F6schregel SET NULL f\u00FCr das mehrstufige L\u00F6schen auf dieselbe Tabelle verweisen w\u00FCrde.)
XCL42.S=CASCADE
XCL43.S=SET NULL
XCL44.S=RESTRICT
XCL45.S=NO ACTION
XCL46.S=SET DEFAULT
XCL47.S=Die Verwendung von ''{0}'' setzt voraus, dass Sie ein Upgrade der Datenbank von Version {1} auf Version {2} oder eine aktuellere Version durchf\u00FChren. 
XCL48.S=F\u00FCr ''{0}'' ist TRUNCATE TABLE nicht zul\u00E4ssig, weil aktivierte Integrit\u00E4tsbedingungen f\u00FCr Fremdschl\u00FCssel in anderen Tabellen auf Integrit\u00E4tsbedingungen f\u00FCr eindeutige oder Prim\u00E4rschl\u00FCssel in dieser Tabelle verweisen. 
XCL49.S=F\u00FCr ''{0}'' ist TRUNCATE TABLE nicht zul\u00E4ssig, weil ein aktivierter DELETE-Ausl\u00F6ser vorliegt ({1}).
XCL50.S=Ein Upgrade f\u00FCr eine fr\u00FChere Version der Datenbank wird nicht unterst\u00FCtzt. Die Datenbank, auf die zugegriffen wird, hat den Versionsstand ''{0}'' und diese Software den Versionsstand ''{1}''. 
XCL51.S=Die angeforderte Funktion kann keine Tabellen im Schema SESSION referenzieren.
XCL52.S=Die Anweisung wurde abgebrochen, oder das Zeitlimit f\u00FCr die Anweisung wurde \u00FCberschritten.
XCL53=Datenstrom wurde geschlossen
XCW00.D=Ein Upgrade von ''{0}'' auf ''{1}'' wird nicht unterst\u00FCtzt.
XCXA0.S=Ung\u00FCltige Kennung.
XCXB0.S=Ung\u00FCltiger Datenbankklassenpfad\: ''{0}''.
XCXC0.S=Ung\u00FCltige ID-Liste.
XCXE0.S=Sie versuchen, eine Operation auszuf\u00FChren, die das Gebietsschema der Datenbank verwendet. F\u00FCr die Datenbank ist jedoch kein Gebietsschema festgelegt.
XCY00.S=Ung\u00FCltiger Wert f\u00FCr das Merkmal ''{0}''\=''{1}''.
XCY02.S=Die angeforderte Merkmal\u00E4nderung wird nicht unterst\u00FCtzt; ''{0}''\=''{1}''.
XCY03.S=Das erforderliche Merkmal ''{0}'' wurde nicht definiert.
XCY04.S=Ung\u00FCltige Syntax f\u00FCr vorrangige Optimizer-Werte. G\u00FCltige Syntax\: DERBY-PROPERTIES Merkmalname \= Wert [, Merkmalname \= Wert]*
XCZ00.S=Unbekannte Berechtigung ''{0}''.
XCZ01.S=Unbekannter Benutzer ''{0}''.
XCZ02.S=Ung\u00FCltiger Parameter ''{0}''\=''{1}''.
XD003.S=Die Abh\u00E4ngigkeit kann nicht vom Datentr\u00E4ger zur\u00FCckgeschrieben werden. DependableFinder \= ''{0}''. Weitere Informationen\: ''{1}''.
XD004.S=Es k\u00F6nnen keine Abh\u00E4ngigkeiten gespeichert werden.
XIE01.S=Es ist keine Verbindung vorhanden.
XIE03.S=In Zeile {0} f\u00FCr Spalte {1} wurden nach dem Endbegrenzer Daten gefunden. 
XIE04.S=Nicht gefundene Datendatei\: {0}
XIE05.S=Es muss eine Datendatei angegeben werden. 
XIE06.S=Der Name der Definitionseinheit wurde nicht angegeben.
XIE07.S=Feld- und Satztrennzeichen k\u00F6nnen nicht als Unterzeichenfolge des jeweils anderen Trennzeichens verwendet werden. 
XIE08.S=Es gibt keine Spalte mit dem Namen {0}. 
XIE09.S=Summe der Spalten in der Zeile\: {0}. 
XIE0B.S=Die Spalte ''{0}'' der Tabelle ist vom Typ {1}, der vom Import/Export nicht unterst\u00FCtzt wird. 
XIE0D.S=Das Satztrennzeichen wurde nicht in Zeile {0} gefunden.
XIE0E.S=In Zeile {0} wurde an unerwarteter Stelle ein Dateiende gelesen.
XIE0I.S=Beim Schreiben von Daten in die Datei ist eine E/A-Ausnahme eingetreten.
XIE0J.S=Ein Begrenzer ist ung\u00FCltig oder wird mehrfach verwendet.
XIE0K.S=Als Zeichenfolgenbegrenzer wurde ein Punkt angegeben.
XIE0M.S=Die Tabelle ''{0}'' ist nicht vorhanden. 
XIE0N.S=Ein ung\u00FCltiger hexadezimaler String ''{0}'' wurde in der Importdatei erfasst.
XIE0P.S=Referenzierte Lob-Datendatei {0} in der Importdatei nicht gefunden.
XIE0Q.S=Name der Lob-Datendatei darf nicht leer sein. 
XIE0R.S=Importfehler in Zeile {0} der Datei {1}\: {2} 
XIE0S.S=Der Exportvorgang wurde nicht ausgef\u00FChrt, weil die angegebene Ausgabedatei ({0}) bereits vorhanden ist. Bei einem Export wird keine vorhandene Datei \u00FCberschrieben, auch dann nicht, wenn der Prozess das Recht zum Schreiben in diese Datei hat. Diese Vorgehensweise wurde aus Sicherheitsgr\u00FCnden \u00FCbernommen, und um unabsichtliche Dateibesch\u00E4digungen zu vermeiden. Bitte \u00E4ndern Sie den Namen der Ausgabedatei in den Exportargumenten zu einem nicht vorhandenen Namen, oder l\u00F6schen Sie die vorhandene Datei und versuchen Sie dann erneut einen Export.
XIE0T.S=Der Exportvorgang wurde nicht ausgef\u00FChrt, weil die angegebene Large Object-Hilfsdatei ({0}) bereits vorhanden ist. Bei einem Export wird keine vorhandene Datei \u00FCberschrieben, auch dann nicht, wenn der Prozess das Recht zum Schreiben in diese Datei hat. Diese Vorgehensweise wurde aus Sicherheitsgr\u00FCnden \u00FCbernommen, und um unabsichtliche Dateibesch\u00E4digungen zu vermeiden. Bitte \u00E4ndern Sie den Namen der Large Object-Hilfsdatei in den Exportargumenten zu einem nicht vorhandenen Namen, oder l\u00F6schen Sie die vorhandene Datei und versuchen Sie dann erneut einen Export.
XJ001.U=Java-Ausnahme\: ''{1}\: {0}''.
XJ004.C=Die Datenbank ''{0}'' wurde nicht gefunden.
XJ008.S=Ein Sicherungspunkt kann im Modus f\u00FCr automatisches Festschreiben nicht zur\u00FCckgesetzt oder freigegeben werden.
XJ009.S=F\u00FCr das Aufrufen einer gespeicherten Prozedur ist die Verwendung von CallableStatement oder von Ausgabeparametern erforderlich\: {0}
XJ010.S=SAVEPOINT kann nicht abgesetzt werden, wenn autoCommit aktiviert ist.
XJ011.S=Null kann nicht als Name f\u00FCr den Sicherungspunkt \u00FCbergeben werden.
XJ012.S=''{0}'' ist bereits geschlossen.
XJ013.S=Keine ID f\u00FCr benannte Sicherungspunkte.
XJ014.S=Kein Name f\u00FCr nicht benannte Sicherungspunkte.
XJ015.M=Das Derby-System wird heruntergefahren.
XJ016.S=Die Methode ''{0}'' ist in einer vorbereiteten Anweisung nicht zul\u00E4ssig.
XJ017.S=Innerhalb des Ausl\u00F6secodes ist ein Sicherungspunktbefehl unzul\u00E4ssig.
XJ018.S=Der Spaltenname muss ungleich null sein.
XJ020.S=Der Objekttyp kann nicht in TYPE ''{0}'' konvertiert werden. Der Wert f\u00FCr java.sql.Types ist ung\u00FCltig oder der Objektzeiger ist ein Nullzeiger.
XJ021.S=Der Typ wird nicht unterst\u00FCtzt.
XJ022.S=Der folgende Datenstrom kann nicht definiert werden\: ''{0}''.
XJ023.S=die Datenmenge des Eingabedatenstroms entspricht nicht exakt der angeforderten L\u00E4nge.
XJ025.S=Ein Eingabedatenstrom kann keine negative L\u00E4nge haben.
XJ028.C=Der URL ''{0}'' hat nicht das richtige Format.
XJ030.S=In einer verschachtelten Verbindung kann AUTOCOMMIT ON nicht gesetzt werden.
XJ040.C=Die Datenbank ''{0}'' konnte nicht gestartet werden. Details k\u00F6nnen Sie der n\u00E4chsten Ausnahme entnehmen.
XJ041.C=Die Datenbank ''{0}'' konnte nicht erstellt werden. Details k\u00F6nnen Sie der n\u00E4chsten Ausnahme entnehmen.
XJ042.S=''{0}'' ist kein g\u00FCltiger Wert f\u00FCr das Merkmal ''{1}''.
XJ044.S=''{0}'' ist eine ung\u00FCltige Nachkommastellenangabe.
XJ045.S=An Connection.setTransactionIsolation() wurde die ung\u00FCltige oder (derzeit) nicht unterst\u00FCtzte Isolationsstufe ''{0}'' \u00FCbergeben. Derzeit unterst\u00FCtzte Werte sind java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED und java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
XJ049.C=Es wurde in Konflikt stehende Erstellungsattribute angegeben.
XJ04B.S=Der Batch darf keinen Befehl enthalten, der versucht, eine Ergebnisliste zur\u00FCckzugeben.
XJ04C.S=Der CallableStatement-Batch darf keine Ausgabeparameter enthalten.
XJ050.U=F\u00FCr die Datenbankversion {0} ist ein Upgrade erforderlich. Setzen Sie f\u00FCr den JDBC-Verbindungs-URL das Attribut ''upgrade\=true'', um ein Upgrade auf Version {1} zu erm\u00F6glichen.
XJ056.S=In einer XA-Verbindung kann AUTOCOMMIT ON nicht gesetzt werden.
XJ057.S=Eine globale Transaktion kann nicht \u00FCber die Verbindung festgeschrieben werden. Die Verarbeitung der COMMIT-Verarbeitung muss \u00FCber die Schnittstelle XAResource erfolgen.
XJ058.S=Eine globale Transaktion kann nicht \u00FCber die Verbindung zur\u00FCckgesetzt werden. Die Verarbeitung der COMMIT-Verarbeitung muss \u00FCber die Schnittstelle XAResource erfolgen.
XJ059.S=Eine Verbindung kann nicht beendet werden, solange noch eine globale Transaktion aktiv ist.
XJ05B.C=Das JDBC-Attribut ''{0}'' hat einen ung\u00FCltigen Wert (''{1}''). G\u00FCltige Werte sind\: ''{2}''.
XJ05C.S=Die Konstante ResultSet.HOLD_CURSORS_OVER_COMMIT f\u00FCr das Offenhalten kann f\u00FCr eine globale Transaktion nicht definiert werden.
XJ061.S=Die Methode ''{0}'' ist nur f\u00FCr Scroll-Cursor zul\u00E4ssig.
XJ062.S=Ung\u00FCltiger Parameterwert ''{0}'' f\u00FCr ResultSet.setFetchSize(int rows).
XJ063.S=Ung\u00FCltiger Parameterwert ''{0}'' f\u00FCr Statement.setMaxRows(int maxRows). Der Parameterwert muss >\= 0 sein.
XJ064.S=Ung\u00FCltiger Parameterwert ''{0}'' f\u00FCr setFetchDirection(int direction).
XJ065.S=Ung\u00FCltiger Parameterwert ''{0}'' f\u00FCr Statement.setFetchSize(int rows).
XJ066.S=Ung\u00FCltiger Parameterwert ''{0}'' f\u00FCr Statement.setMaxFieldSize(int max).
XJ067.S=Der SQL-Textzeiger ist null.
XJ068.S=In der Mitte eines Batch sind nur executeBatch und clearBatch zul\u00E4ssig.
XJ069.S=F\u00FCr die Ausf\u00FChrungsanweisung USING sind keine SetXXX-Methoden zul\u00E4ssig.
XJ070.S=In einer BLOB- oder CLOB-Methode wurde das Argument ''{0}'' mit negativer oder Nullposition \u00FCbergeben.
XJ071.S=An eine BLOB- oder CLOB-Methode wurde das negative L\u00E4ngenargument ''{0}'' \u00FCbergeben.
XJ072.S=An eine BLOB- oder CLOB-Methode wurde ein Nullmuster oder eine Nullsuchzeichenfolge \u00FCbergeben.
XJ073.S=Die Daten in diesem BLOB oder CLOB sind nicht mehr verf\u00FCgbar. M\u00F6glicherweise wurde die Transaktion des BLOB/CLOB festgeschrieben oder die Verbindung geschlossen.
XJ074.S=Ung\u00FCltiger Parameterwert ''{0}'' f\u00FCr Statement.setQueryTimeout(int seconds)
XJ076.S=Das Positionsargument ''{0}'' \u00FCberschreitet die Gr\u00F6\u00DFe des BLOB/CLOB.
XJ077.S=Bei dem Versuch, mit getBytes/getSubString das erste Byte/Zeichen des BLOB/CLOB-Musters zu lesen, wurde eine Ausnahme empfangen.
XJ078.S=Die relative Position ''{0}'' ist entweder kleiner als null oder f\u00FCr das aktuelle BLOB/CLOB zu gro\u00DF.
XJ079.S=Die angegebene L\u00E4nge ''{0}'' \u00FCberschreitet die Gr\u00F6\u00DFe des BLOB/CLOB.
XJ080.S=Die Ausf\u00FChrungsanweisung USING hat an Stelle von {1} Parametern {0} Parameter \u00FCbergeben.
XJ081.C=Es wurde in Konflikt stehende Erstellungs-/Wiederherstellungsattribute angegeben.
XJ081.S=An die Methode ''{2}'' wurde der ung\u00FCltige Wert ''{0}'' als Parameter ''{1}'' \u00FCbergeben.
XJ082.U=BLOB/CLOB-Werte sind als Methodenparameter oder Empf\u00E4nger nicht zul\u00E4ssig.
XJ083.U=''{0}'' ist nicht zul\u00E4ssig, weil das ResultSet nicht aktualisierbar ist. 
XJ084.U=Die Spalte entspricht keiner Spalte in der Basistabelle. ''{0}'' kann nicht f\u00FCr diese Spalte abgesetzt werden.
XJ085.S=Der Datenstrom wurde bereits gelesen. Das Dateiende ist erreicht, und der Datenstrom kann nicht erneut verwendet werden.
XJ086.S=Wenn der Cursor nicht in der Einf\u00FCgezeile ist oder der gemeinsame Zugriff f\u00FCr dieses ResultSet-Objekt auf CONCUR_READ_ONLY gesetzt ist, kann diese Methode nicht aufgerufen werden.
XJ087.S=Die Summe von position(''{0}'') und length(''{1}'') ist gr\u00F6\u00DFer als die Gr\u00F6\u00DFe der LOB.
XJ088.S=Ung\u00FCltige Operation\: wasNull() wurde ohne abgerufene Daten aufgerufen.
XJ090.S=Ung\u00FCltiger Parameter\: calendar ist null.
XJ091.S=Ung\u00FCltiges Argument\: Der Parameterindex {0} ist kein OUT- oder INOUT-Parameter.
XJ093.S=Das BLOB/CLOB {0} ist zu lang. Die L\u00E4nge darf {1} nicht \u00FCberschreiten.
XJ094.S=Dieses Objekt ist bereits geschlossen.
XJ095.S=Der Versuch, eine Aktion mit erforderlicher Berechtigung auszuf\u00FChren, ist gescheitert.
XJ096.S=Im Paket {0} f\u00FCr {1} konnte ein Ressourcen-Bundle nicht gefunden werden.
XJ097.S=Ein Sicherungspunkt, der nicht von dieser Verbindung erstellt wurde, kann nicht zur\u00FCckgesetzt oder freigegeben werden.
XJ098.S=Der automatisch generierte Schl\u00FCsselwert {0} ist ung\u00FCltig.
XJ099.S=Das Reader-/Datenstromobjekt enth\u00E4lt keine L\u00E4ngenzeichen.
XJ100.S=Die von der Methode registerOutParameter angegebene Anzahl Nachkommastellen passt nicht zur setter-Methode. Ein Genauigkeitsverlust ist m\u00F6glich\!
XJ102.S=An der aktuellen Position ist keine Einf\u00FCgung m\u00F6glich.
XJ103.S=Der Tabellenname muss ungleich null sein.
XJ104.S=Ung\u00FCltige L\u00E4nge des gemeinsam genutzten Schl\u00FCssels\: {0}.
XJ105.S=Der DES-Schl\u00FCssel hat die falsche L\u00E4nge. Erwartete L\u00E4nge\: {0}, empfangene L\u00E4nge\: {1}
XJ106.S=Keine derartige Auff\u00FCllung 
XJ107.S=Falsche Auff\u00FCllung
XJ108.S=Unzul\u00E4ssige Blockgr\u00F6\u00DFe
XJ110.S=Der Name der Prim\u00E4rtabelle muss ungleich null sein.
XJ111.S=Der Name der Fremdtabelle muss ungleich null sein.
XJ112.S=Es wurde eine Sicherheitsausnahme festgestellt. Details enth\u00E4lt die n\u00E4chste Ausnahme.
XJ113.S=Die Datei {0} kann nicht ge\u00F6ffnet werden. {1}
XJ114.S=Ung\u00FCltiger Cursorname ''{0}''
XJ115.S=Das ResultSet kann nicht mit der angeforderten Offenhaltungseinstellung {0} ge\u00F6ffnet werden.
XJ116.S=Zu einem Batch k\u00F6nnen nicht mehr als {0} Befehle hinzugef\u00FCgt werden.
XJ117.S=Gem\u00E4\u00DF J2EE k\u00F6nnen Abfragen nicht im Batch-Modus verarbeitet werden.
XJ118.S=F\u00FCr eine Nicht-Abfrageanweisung wurde eine Abfrage-Batch-Verarbeitung angefordert.
XJ121.S=Ung\u00FCltige Operation an der aktuellen Cursorposition
XJ122.S=F\u00FCr diese Zeile wurden keine updateXXX-Methoden aufgerufen.
XJ123.S=Diese Methode muss aufgerufen werden, um Werte in der aktuellen Zeile oder der Einf\u00FCgezeile zu aktualisieren.
XJ124.S=Die Spalte kann nicht aktualisiert werden.
XJ125.S=Diese Methode sollte nur f\u00FCr ResultSet-Objekte vom Typ TYPE_SCROLL_INSENSITIVE aufgerufen werden.
XJ126.S=Diese Methode sollte nicht f\u00FCr sensitive dynamische Cursor aufgerufen werden.
XJ128.S=F\u00FCr ''{0}'' konnte kein unwrap ausgef\u00FChrt werden.
XJ200.S=Die maximale Anzahl Abschnitte {0} wurde \u00FCberschritten.
XJ202.S=Ung\u00FCltiger Cursorname ''{0}''
XJ203.S=Der Cursorname ''{0}'' wird bereits verwendet.
XJ204.S=Die Ergebnisliste kann nicht mit der angeforderten Offenhaltungseinstellung {0} ge\u00F6ffnet werden.
XJ206.S=Der SQL-Text ''{0}'' enth\u00E4lt keine Token.
XJ207.S=Die Methode executeQuery kann nicht f\u00FCr ein Update verwendet werden.
XJ208.S=Fehler bei nicht atomarer Batch-Operation. Der Batch wurde \u00FCbergeben. Bei einem Batch-Member ist jedoch mindestens eine Ausnahme eingetreten. Mit getNextException() k\u00F6nnen Sie die Ausnahmen f\u00FCr bestimmte Batch-Elemente abrufen.
XJ209.S=Die erforderliche gespeicherte Prozedur ist nicht auf dem Server installiert.
XJ210.S=Der Name des Lademoduls f\u00FCr die gespeicherte Prozedur auf dem Server wurde nicht gefunden.
XJ211.S=W\u00E4hrend der Batch-Verarbeitung ist eine Kettenunterbrechungsausnahme eingetreten, nach der keine Wiederherstellung m\u00F6glich ist. Der Batch wird nicht atomar beendet.
XJ212.S=Ung\u00FCltige Attributsyntax\: {0}
XJ213.C=Das Verbindungsmerkmal traceLevel hat kein g\u00FCltiges Format f\u00FCr eine Zahl.
XJ214.S=Beim Aufrufen von free() f\u00FCr ein CLOB oder BLOB ist ein E/A-Fehler aufgetreten.
XJ215.S=Es k\u00F6nnen keine weiteren java.sql.Clob/java.sql.Blob-Methoden aufgerufen werden, nachdem die free()-Methode aufgerufen oder nachdem die Blob/Clob-Transaktion ausgef\u00FChrt oder wiederholt (Rollback) wurde.
XJ216.S=Die L\u00E4nge dieses BLOB/CLOB ist noch nicht verf\u00FCgbar. Wenn ein BLOB oder CLOB als ein Datenstrom zug\u00E4nglich ist, wird die L\u00E4nge erst dann verf\u00FCgbar, nachdem der gesamte Datenstrom verarbeitet wurde.
XJ217.S=Der f\u00FCr diesen CLOB/BLOB angegebene Locator ist ung\u00FCltig
XK000.S=Die Sicherheitsrichtlinie konnte nicht neu geladen werden\: {0}
XML00=Die API oder Implementierungsklassen f\u00FCr ''{0}'' wurden nicht gefunden. XML-Operationen sind nur zul\u00E4ssig, wenn diese Klassen in Ihrem Klassenpfad enthalten sind.
XML01=Bei der XML-Verarbeitung ist ein unerwarteter Fehler aufgetreten\: {0} 
XN001.S=Innerhalb einer Arbeitseinheit ist eine Zur\u00FCcksetzung der Verbindung nicht zul\u00E4ssig.
XN002.U=SECTKN wurde nicht zur\u00FCckgegeben.
XN008.S=Die Abfrageverarbeitung wurde wegen eines Fehlers auf dem Server abgebrochen.
XN009.S=Fehler beim Abrufen der L\u00E4nge des BLOB/CLOB. Die Ausnahme folgt.
XN010.S=Der Prozedurname muss ungleich null sein.
XN011.S=Die L\u00E4nge {0} des Prozedurnamens liegt au\u00DFerhalb des g\u00FCltigen Bereichs von 1 bis {1}.
XN012.S=Auf {0}-Plattformen unterst\u00FCtzt XA Version {1} und aktuellere Versionen. Dies ist Version {2}.
XN013.S=Ung\u00FCltige Scroll-Richtung
XN014.S=Netzprotokollfehler\: Es wurde eine IOException festgestellt (Parameter {0}). Die verbleibenden Daten wurden mit 0x0 aufgef\u00FCllt. Nachricht\: {1}.
XN015.S=Netzprotokollfehler\: Die angegebene Gr\u00F6\u00DFe des Eingabedatenstroms (Parameter {0}) liegt unter der tats\u00E4chlichen L\u00E4nge des Eingabedatenstroms.
XN016.S=Netzprotokollfehler\: Bei der \u00DCberpr\u00FCfung der Datenstroml\u00E4nge wurde ein Fehler festgestellt (Parameter {0}). Nachricht\: {1}.
XN017.S=Netzprotokollfehler\: Das Ende des Datenstroms wurde vorzeitig erreicht (Parameter {0}). Die verbleibenden Daten wurden mit 0x0 aufgef\u00FCllt.
XN018.S=Netzprotokollfehler\: Die angegebene Reader-Gr\u00F6\u00DFe (Parameter {0}) liegt unter der tats\u00E4chlichen Reader-L\u00E4nge.
XN019.S=Fehler beim Ausf\u00FChren von {0}. Der Server hat Folgendes zur\u00FCckgegeben\: {1}
XRE00=Dieses LogFactory-Modul unterst\u00FCtzt keine Replikation.
XRE01=Das vom Master empfangene Protokoll ist fehlerhaft.
XRE02=Master und Slave haben verschiedene Versionen. Fortsetzung der Replikation nicht m\u00F6glich.
XRE03=Unerwarteter Fehler bei Replikation. Einzelheiten finden Sie in derby.log.
XRE04.U.1=Verbindung mit Peer der replizierten Datenbank ''{0}'' an Adresse ''{1}\:{2}'' nicht m\u00F6glich.
XRE04.U.2=Verbindung unterbrochen zu replizierter Datenbank ''{0}''.
XRE05=Die Protokolldateien von Master und Slave sind nicht synchron f\u00FCr die replizierte Datenbank ''{0}''. Die Protokollzeit des Master ist {1}\:{2}, die des Slave dagegen {3}\:{4}. Dies f\u00FChrt zu einem schweren Fehler bei der Replikation, die Replikation wird angehalten.
XRE06=Die Verbindungsversuche mit dem Replication Slave f\u00FCr Datenbank {0} \u00FCbersteigen die festgelegte Zeit\u00FCberschreitung.
XRE07=Vorgang konnte nicht ausgef\u00FChrt werden, da sich die Datenbank nicht im Replication Master-Modus befindet.
XRE08=Replication Slave-Modus erfolgreich gestartet f\u00FCr Datenbank ''{0}''. Verbindung zur\u00FCckgewiesen, da sich Datenbank im Replication Slave-Modus befindet. 
XRE09=Starten des Replication Slave-Modus nicht m\u00F6glich f\u00FCr Datenbank ''{0}''. Datenbank wurde bereits gestartet 
XRE10=Es wurde in Konflikt stehende Attribute angegeben. Entnehmen Sie dem Referenzhandbuch die zul\u00E4ssigen Attribute im Zusammenhang mit dem Replikationsattribut ''{0}''.
XRE11=Vorgang ''{0}'' konnte nicht ausgef\u00FChrt werden, da Datenbank ''{1}'' noch nicht gestartet wurde.
XRE12=Protokollfehler in Replikationsnetzwerk f\u00FCr Datenbank ''{0}''. Erwarteter Meldungstyp war ''{1}'', tats\u00E4chlich empfangener Typ ist ''{2}''.
XRE20.D=Failover erfolgreich ausgef\u00FChrt f\u00FCr Datenbank ''{0}'', die Datenbank wurde heruntergefahren.
XRE21=Fehler bei Ausf\u00FChrung des Failover f\u00FCr Datenbank ''{0}'', Failover-Versuch wurde abgebrochen.
XRE22=Replication Master wurde bereits gestartet f\u00FCr Datenbank''{0}''.
XRE23=Replication Master kann nicht gestartet werden, da unprotokollierte Vorg\u00E4nge ausgef\u00FChrt werden, lassen Sie die unprotokollierten Vorg\u00E4nge beenden und starten Sie die Replikation neu
XRE40=Vorgang konnte nicht ausgef\u00FChrt werden, da sich die Datenbank nicht im Replication Slave-Modus befindet.
XRE41=Replikationsvorg\u00E4nge ''failover'' oder ''stopSlave'' auf Slave-Datenbank zur\u00FCckgewiesen, da Verbindung mit Master funktioniert. F\u00FChren Sie die Replikationsvorg\u00E4nge ''failover'' oder ''stopSlave'' stattdessen auf der Master-Datenbank aus. 
XRE42=Replizierte Datenbank ''{0}'' wird heruntergefahren.
XRE43=Unerwarteter Fehler bei dem Versuch, den Replication Slave-Modus anzuhalten. Zum Anhalten der Replikation verwenden Sie die Vorg\u00E4nge ''failover'' oder ''stopSlave''.
XSAI2.S=Das angeforderte Konglomerat ({0}) ist nicht vorhanden.
XSAI3.S=Ein Feature ist nicht implementiert.
XSAJ0.U=Suchtyp
XSAJ1.U=Anzahl der besuchten Seiten
XSAJ2.U=Anzahl der besuchten Zeilen
XSAJ3.U=Anzahl der gel\u00F6schten besuchten Zeilen
XSAJ4.U=Anzahl der qualifizierten Zeilen
XSAJ5.U=Anzahl der abgerufenen Spalten
XSAJ6.U=Bits der abgerufenen Spalten
XSAJ7.U=Tiefe der Baumstruktur
XSAJ8.U=Sortiertyp
XSAJA.U=Anzahl der eingegebenen Zeilen
XSAJB.U=Anzahl der ausgegebenen Zeilen
XSAJC.U=Anzahl der Mischvorg\u00E4nge
XSAJD.U=Umfang der Mischvorg\u00E4nge
XSAJE.U=Alle
XSAJF.U=B-Baumstruktur
XSAJG.U=Heap-Speicher
XSAJH.U=Sortierung
XSAJI.U=\u00E4u\u00DFere
XSAJJ.U=innere
XSAM0.S=Bei dem Versuch, ein Modul f\u00FCr ''{0}'' zu booten, ist eine Ausnahme eingetreten.
XSAM2.S=Es ist kein Index oder Konglomerat mit der Konglomerat-ID ''{0}'' zum Freigeben vorhanden.
XSAM3.S=Es ist kein Index oder Konglomerat mit der Konglomerat-ID ''{0}'' vorhanden.
XSAM4.S=Es gibt keine Sortierung mit der Bezeichnung ''{0}''.
XSAM5.S=Sie m\u00FCssen die Suche \u00F6ffnen und positionieren, indem Sie vor allen anderen Methoden next() aufrufen.
XSAM6.S=Der Datensatz {2} auf Seite {1} im Container {0} wurde nicht gefunden.
XSAS0.S=Es wurde eine Schnittstellenmethode des Suchcontrollers aufgerufen, die f\u00FCr das Durchsuchen einer Sortierung nicht geeignet ist.
XSAS1.S=Es wurde versucht, eine Zeile vor Beginn oder nach Beendigung einer Suche abzurufen.
XSAS3.S=Der Typ einer in eine Suche eingef\u00FCgten Zeile stimmt nicht mit der Suchschablone \u00FCberein.
XSAS6.S=Es konnten keine Ressourcen f\u00FCr die Sortierung angefordert werden.
XSAX0.S=Fehlerhaftes XA-Protokoll.
XSAX1.S=Es wurde versucht, eine globale Transaktion mit der XID einer vorhandenen globalen Transaktion zu starten.
XSCB0.S=Ein Container konnte nicht erstellt werden.
XSCB1.S=Der Container {0} wurde nicht gefunden.
XSCB2.S=In der f\u00FCr createConglomerate() f\u00FCr den Sekund\u00E4rindex einer Baumstruktur bereitgestellten Merkmalliste wurde das erforderliche Merkmal {0} nicht gefunden.
XSCB3.S=Nicht implementiertes Feature.
XSCB4.S=F\u00FCr eine begonnene Suche in einer B-Baumstruktur wurde eine Methode aufgerufen, bevor die Suche in der ersten Zeile positioniert wurde (d. h. next() wurde noch nicht aufgerufen). Der aktuelle Status der Suche ist ({0}).
XSCB5.S=W\u00E4hrend des logischen Widerrufs einer Einf\u00FCge- oder L\u00F6schoperation f\u00FCr eine B-Baumstruktur kann die Zeile in der Baumstruktur nicht gefunden werden.
XSCB6.S=Einschr\u00E4nkung\: Der Datensatz f\u00FCr den Sekund\u00E4rindex einer B-Baumstruktur kann wegen unzureichenden Speicherbereichs auf der Seite nicht aktualisiert oder eingef\u00FCgt werden. Verwenden Sie den Parameter derby.storage.pageSize und/oder derby.storage.pageReservedSpace, um diese Einschr\u00E4nkung zu umgehen.
XSCB7.S=Beim Durchsuchen einer B-Baumstruktur ist ein interner Fehler aufgetreten; current_rh ist null \= {0}; der Positionsschl\u00FCssel ist null \= {1}.
XSCB8.S=Das B-Baum-Konglomerat {0} ist geschlossen.
XSCB9.S=F\u00FCr Testzwecke reserviert.
XSCG0.S=Eine Schablone konnte nicht erstellt werden.
XSCH0.S=Ein Container konnte nicht erstellt werden.
XSCH1.S=Der Container {0} wurde nicht gefunden.
XSCH4.S=Ein Konglomerat konnte nicht erstellt werden.
XSCH5.S=In einer Basistabelle wich die Anzahl der angeforderten Spalten ({0}) von der maximalen Spaltenanzahl ({1}) ab.
XSCH6.S=Der Heap-Container mit der Container-ID {0} ist geschlossen.
XSCH7.S=Die Suche ist nicht positioniert.
XSCH8.S=Das Feature ist nicht implementiert.
XSDA1.S=Es wurde versucht, auf einer Seite auf eine Stelle au\u00DFerhalb des Bereiches zuzugreifen.
XSDA2.S=Es wurde versucht, einen gel\u00F6schten Datensatz zu aktualisieren.
XSDA3.S=Einschr\u00E4nkung\: Der Datensatz wegen unzureichenden Speicherbereichs auf der Seite nicht aktualisiert oder eingef\u00FCgt werden. Verwenden Sie den Parameter derby.storage.pageSize und/oder derby.storage.pageReservedSpace, um diese Einschr\u00E4nkung zu umgehen.
XSDA4.S=Es wurde eine unerwartete Ausnahme ausgel\u00F6st.
XSDA5.S=Es wurde versucht, das L\u00F6schen eines nicht gel\u00F6schten Datensatzes zu widerrufen.
XSDA6.S=Die Spalte {0} der Zeile ist gleich null. Sie muss so konfiguriert werden, dass sie auf ein Objekt zeigt.
XSDA7.S=Beim Wiederherstellen eines serialisierbaren oder SQLData-Objekts der Klasse {0} wurde versucht, mehr Daten zu lesen, als urspr\u00FCnglich gespeichert wurden.
XSDA8.S=Ausnahme beim Wiederherstellen eines serialisierbaren oder SQLData-Objekts der Klasse {0}.
XSDA9.S=Beim Wiederherstellen eines serialisierbaren oder SQLData-Objekts der Klasse {0} wurde die Klasse nicht gefunden.
XSDAA.S=Ung\u00FCltige Zeitmarke {0}. Die Zeitmarke stammt von einer anderen Seite oder von einer inkompatiblen Implementierung.
XSDAB.S=Eine Nullzeitmarke kann nicht gesetzt werden.
XSDAC.S=Es wurde versucht, Zeilen oder Seiten von einem Container in einen anderen zu verschieben.
XSDAD.S=Es wurde versucht, Nullzeilen von einer Seite auf eine andere zu verschieben.
XSDAE.S=Eine interne Datensatzkennung kann nur f\u00FCr eine spezifische Kennungs-ID erstellt werden.
XSDAF.S=Eine spezifische interne Datensatzkennung wird wie eine normale interne Kennung verwendet.
XSDAG.S=Der Container kann nicht durch die erste verschachtelte Zuordnungstransaktion ge\u00F6ffnet werden.
XSDAI.S=Die Seite {0}, die gerade entfernt wird, ist bereits gesperrt, um freigegeben zu werden.
XSDAJ.S=Ausnahme beim Schreiben eines serialisierbaren oder SQLData-Objekts.
XSDAK.S=F\u00FCr die interne Datensatzkennung {0} wurde die falsche Seite abgerufen.
XSDAL.S=Die interne Datensatzkennung {0} zeigt unerwartet auf die \u00DCberlaufseite.
XSDAM.S=Ausnahme beim Wiederherstellen eines SQLData-Objekts der Klasse {0}. Es k\u00F6nnen keine Instanzen der angegebenen Klasse erstellt werden.
XSDAN.S=Ausnahme beim Wiederherstellen eines SQLData-Objekts der Klasse {0}. Die angegebene Klasse hat eine Ausnahme durch unzul\u00E4ssigen Zugriff festgestellt.
XSDB0.D=Unerwartete Ausnahme auf der speicherinternen Seite {0}
XSDB1.D=Unbekanntes Seitenformat auf der Seite {0}
XSDB2.D=Unbekanntes Containerformat im Container {0}\: {1}
XSDB3.D=Einmal geschriebene Containerinformationen k\u00F6nnen nicht ge\u00E4ndert werden. Vorheriger Stand\: {0}; aktueller Stand\: {1}
XSDB4.D=Die Seite {0} hat den Versionsstand {1}. Die Protokolldatei enth\u00E4lt die \u00C4nderungsversion {2}. Es fehlen Protokolls\u00E4tze dieser Seite oder die Seite wurde nicht ordnungsgem\u00E4\u00DF auf den Datentr\u00E4ger geschrieben.
XSDB5.D=Der \u00C4nderungssatz befindet sich auf Seite {0} des Protokolls, die sich au\u00DFerhalb des Containerendes befindet.
XSDB6.D=Die Datenbank {0} wurde m\u00F6glicherweise bereits von einer anderen Derby-Instanz gebootet.
XSDB7.D=WARNUNG\: Derby (Instanz {0}) versucht, die Datenbank {1} zu booten, obwohl Derby (Instanz {2}) noch aktiv sein k\u00F6nnte. Eine Datenbank sollte immer nur von jeweils einer Derby-Instanz gebootet werden. Es k\u00F6nnen schwerwiegende und irreparable Sch\u00E4den eingetreten sein oder noch eintreten.
XSDB8.D=WARNUNG\: Derby (Instanz {0}) versucht, die Datenbank {1} zu booten, obwohl Derby (Instanz {2}) noch aktiv sein k\u00F6nnte. Eine Datenbank sollte immer nur von jeweils einer Derby-Instanz gebootet werden. Es k\u00F6nnen schwerwiegende und irreparable Sch\u00E4den eintreten, wenn zwei Instanzen von Derby gleichzeitig dieselbe Datenbank booten. Das Merkmal db2j.database.forceDatabaseLock\=true wurde gesetzt, so dass die Datenbank erst gebootet wird, wenn db.lck nicht mehr vorhanden ist. Diese Datei wird normalerweise entfernt, wenn die erste Derby-Instanz zum Booten der Datenbank vorhanden ist. Es kann jedoch vorkommen, dass sie beim Herunterfahren nicht gel\u00F6scht wird. In diesem Fall muss die Datei manuell entfernt werden. Vergewissern Sie sich vor dem manuellen L\u00F6schen der Datei db.lck unbedingt, dass keine andere VM auf die Datenbank zugreift.
XSDB9.D=Der Datenstromcontainer {0} ist besch\u00E4digt.
XSDBA.D=Der Versuch, das Objekt {0} zuzuordnen, ist gescheitert.
XSDF0.S=Die Datei {0} konnte nicht erstellt werden, da sie bereits vorhanden ist.
XSDF1.S=Beim Erstellen der Datei {0} f\u00FCr den Container ist eine Ausnahme eingetreten.
XSDF2.S=Beim Erstellen der Datei {0} f\u00FCr den Container ist eine Ausnahme eingetreten. Die Datei konnte nicht entfernt werden. Ausnahme\: {1}.
XSDF3.S=Das Segment {0} kann nicht erstellt werden.
XSDF4.S=Beim Entfernen der Datei {0} f\u00FCr den gel\u00F6schten Container ist eine Ausnahme eingetreten. Die Datei konnte nicht entfernt werden. {1}.
XSDF6.S=Die Zuordnungsseite {0} wurde nicht gefunden.
XSDF7.S=Die neu erstellte Seite {0} konnte nicht gesperrt werden.
XSDF8.S=Die wiederzuverwendende Seite {0} wurde nicht gefunden.
XSDFB.S=Die Operation wird von einer schreibgesch\u00FCtzten Datenbank nicht unterst\u00FCtzt.
XSDFD.S=Auf Seite {0} wurde in zwei Ein-/Ausgaben verschiedene Seitenimages gelesen. Das erste Image hat die falsche Kontrollsumme und das zweite die richtige. Seitenimages\: {1} {2}
XSDFF.S=Die angeforderte Operation ist durch eine unerwartete Ausnahme gescheitert.
XSDFH.S=Die Datenbank kann nicht gesichert werden. Beim Schreiben in die Backup-Containerdatei {0} wurde eine E/A-Ausnahme empfangen.
XSDFI.S=Bei dem Versuch, w\u00E4hrend der Datenbankwiederherstellung Daten auf Platte zu schreiben, wurde ein Fehler festgestellt. \u00DCberpr\u00FCfen Sie, ob die Platte mit der Datenbank voll ist. Sollte dies der Fall sein, l\u00F6schen Sie nicht ben\u00F6tigte Dateien und versuchen Sie erneut, eine Verbindung zur Datenbank herzustellen. Es kann auch sein, dass das Dateisystem schreibgesch\u00FCtzt ist oder ein Datentr\u00E4gerfehler vorliegt. Das System hat bei der Verarbeitung der Seite {0} einen Fehler festgestellt.
XSDG0.D=Die Seite {0} konnte nicht vom Datentr\u00E4ger gelesen werden.
XSDG1.D=Die Seite {0} konnte nicht auf den Datentr\u00E4ger geschrieben werden. Pr\u00FCfen Sie, ob der Datentr\u00E4ger voll ist.
XSDG2.D=Ung\u00FCltige Kontrollsumme auf der Seite {0}. Erwartet\: {1}, Version auf Datentr\u00E4ger\: {2}. Seitenspeicherauszug\: {3}
XSDG3.D=Auf die Metadaten f\u00FCr den Container {0} konnte nicht zugegriffen werden.
XSDG5.D=Die Datenbank befand sich nicht im Erstellungsmodus, als createFinished aufgerufen wurde.
XSDG6.D=Bei der Wiederherstellung wurde das Datensegmentverzeichnis nicht in der Sicherung {0} gefunden. Vergewissern Sie sich, dass es sich um die richtige Sicherungskopie handelt und dass diese nicht besch\u00E4digt ist.
XSDG7.D=Bei der Wiederherstellung konnte das Verzeichnis {0} nicht entfernt werden. Vergewissern Sie sich, dass die notwendigen Berechtigungen vorliegen.
XSDG8.D=Bei der Wiederherstellung konnte das Verzeichnis ''{0}'' nicht nach ''{1}'' kopiert werden. Vergewissern Sie sich, dass genug Speicherplatz verf\u00FCgbar ist und dass die notwendigen Berechtigungen vorliegen. 
XSLA0.D=Die freigegebene Protokolldatei kann nicht auf den Datentr\u00E4ger {0} geschrieben werden.
XSLA1.D=Der Protokollsatz wurde an den Datenstrom gesendet, kann jedoch nicht in den Speicher (Objekt {0}) gestellt werden. Dies kann zu Fehlern bei der Wiederherstellung f\u00FChren.
XSLA2.D=Das System wird heruntergefahren. Beim Zugriff auf die Protokolldatei wurde eine E/A-Ausnahme empfangen.
XSLA3.D=Das Protokoll ist besch\u00E4digt. Der Protokolldatenstrom enth\u00E4lt ung\u00FCltige Daten.
XSLA4.D=Es kann nicht in das Protokoll geschrieben werden. Wahrscheinlich ist das Protokoll voll. L\u00F6schen Sei nicht ben\u00F6tigte Dateien. Es kann auch sein, dass das Dateisystem schreibgesch\u00FCtzt ist oder ein Datentr\u00E4gerfehler vorliegt.
XSLA5.D=Der Protokolldatenstrom f\u00FCr das Zur\u00FCcksetzen der Transaktion {0} kann nicht gelesen werden.
XSLA6.D=Die Datenbank kann nicht wiederhergestellt werden.
XSLA7.D=Die Operation {0} im Protokoll kann nicht wiederholt werden.
XSLA8.D=Die Transaktion {0} kann nicht zur\u00FCckgesetzt werden. Es wird versucht, die Operation {1} durch {2} zu kompensieren.
XSLAA.D=Der Speicher wurde von einer fr\u00FCheren Ausnahme zum Herunterfahren vorgemerkt.
XSLAB.D=Die Protokolldatei {0} wurde nicht gefunden. Vergewissern Sie sich, dass das Merkmal logDevice ordnungsgem\u00E4\u00DF und mit dem richtigen Pfadtrennzeichen f\u00FCr Ihre Plattform angegeben ist.
XSLAC.D=Das Format der Datenbank in {0} ist nicht mit der aktuellen Version der Software kompatibel. Sie wurde m\u00F6glicherweise mit einer neueren Version erstellt oder erweitert.
XSLAD.D=Der Protokollsatz an der Adresse {2} in der Protokolldatei {3} ist besch\u00E4digt. Erwartete Protokollsatzl\u00E4nge\: {0}; tats\u00E4chliche L\u00E4nge\: {1}.
XSLAE.D=Die Steuerdatei in {0} kann nicht geschrieben oder aktualisiert werden.
XSLAF.D=Eine schreibgesch\u00FCtzte Datenbank wurde mit benutzten Datenpuffern erstellt.
XSLAH.D=Sie aktualisieren eine schreibgesch\u00FCtzte Datenbank.
XSLAI.D=Der Pr\u00FCfpunktprotokollsatz kann nicht protokolliert werden.
XSLAJ.D=Das Protokollierungssystem wurde wegen eines fr\u00FCheren Fehlers zum Herunterfahren vorgemerkt und l\u00E4sst weitere Operationen erst nach einem Systemabschluss und einem Neustart des Systems zu.
XSLAK.D=Die Datenbank hat die h\u00F6chste Protokolldateinummer {0} \u00FCberschritten.
XSLAL.D=Die Protokollsatzgr\u00F6\u00DFe {2} \u00FCberschreitet die maximal zul\u00E4ssige Gr\u00F6\u00DFe der Protokolldatei von {3}. In der Protokolldatei {0} wurde an der Position {1} ein Fehler festgestellt.
XSLAM.D=Das Format der Datenbank in {1} kann aufgrund einer E/A-Ausnahme nicht gepr\u00FCft werden.
XSLAN.D=Das Format der Datenbank in {0} ist nicht mit der aktuellen Version der Software kompatibel. Die Datenbank wurde mit der Version {1} erstellt oder erweitert.
XSLAO.D=Die Wiederherstellung ist aufgrund des unerwarteten Fehlers {0} gescheitert.
XSLAP.D=Die Datenbank in {0} hat die Version {1}. F\u00FCr Betadatenbanken ist kein Upgrade m\u00F6glich.
XSLAQ.D=Im Verzeichnis {0} kann keine Protokolldatei erstellt werden.
XSLAR.D=Bei der Wiederherstellung konnte die Protokolldatei ''{0}'' nicht nach ''{1}'' kopiert werden. Vergewissern Sie sich, dass genug Speicherplatz verf\u00FCgbar ist und dass die notwendigen Berechtigungen vorliegen. 
XSLAS.D=Bei der Wiederherstellung wurde das Protokollverzeichnis {0} nicht in der Sicherung gefunden. Vergewissern Sie sich, dass es sich um die richtige Sicherungskopie handelt und dass diese nicht besch\u00E4digt ist.
XSLAT.D=Das Protokollverzeichnis ''{0}'' ist vorhanden, geh\u00F6rt m\u00F6glicherweise jedoch zu einer anderen Datenbank. \u00DCberpr\u00FCfen Sie, ob die f\u00FCr das Attribut logDevice angegebene Position stimmt.
XSLB1.S=Die Protokolloperation {0} hat beim Schreiben ihrer Daten in den Protokolldatenstrom einen Fehler festgestellt. Die Ursache kann eine falsche Protokolloperation oder die Ersch\u00F6pfung der Kapazit\u00E4t des internen Protokollpuffers durch eine zu umfangreiche Protokolloperation sein.
XSLB2.S=Die Protokolloperation {0} protokolliert zu viele Daten. Sie hat den internen Protokollpuffer gef\u00FCllt.
XSLB4.S=truncationLWM {0} wurde nicht gefunden.
XSLB5.S=Unzul\u00E4ssiger truncationLWM-Zeitpunkt {1} f\u00FCr Abschneidepunkt {0}. Der g\u00FCltige Bereich liegt zwischen {2} und {3}.
XSLB6.S=Es wurde versucht, einen Protokollsatz mit der L\u00E4nge 0 oder -ve zu protokollieren.
XSLB8.S=Es wurde versucht, eine Suche auf {0} zur\u00FCckzusetzen. Dieser Wert liegt au\u00DFerhalb der Begrenzung {1}.
XSLB9.S=Es k\u00F6nnen keine weiteren \u00C4nderungen ausgegeben werden. Die Protokoll-Factory wurde gestoppt.
XSRS0.S=Die Datenbank kann nicht eingefroren werden, da sie bereits eingefroren ist.
XSRS1.S=Die Datenbank kann nicht in {0} gesichert werden, da es sich nicht um ein Verzeichnis handelt.
XSRS4.S=W\u00E4hrend der Sicherung ist ein Fehler beim Umbenennen der Datei von {0} in {1} aufgetreten.
XSRS5.S=W\u00E4hrend der Sicherung ist ein Fehler beim Kopieren der Datei von {0} in {1} aufgetreten.
XSRS6.S=Das Sicherungsverzeichnis {0} kann nicht erstellt werden.
XSRS7.S=Die Sicherung hat eine unerwartete Ausnahme abgefangen.
XSRS8.S=Die Protokolleinheit kann nur beim Erstellen der Datenbank definiert und w\u00E4hrend der Verarbeitung nicht ge\u00E4ndert werden.
XSRS9.S=Der Datensatz {0} ist nicht mehr vorhanden.
XSRSA.S=Die Datenbank kann nicht gesichert werden, solange nicht protokollierte Operationen noch nicht festgeschrieben sind. Schreiben Sie die Transaktionen mit den Operationen fest, die die Sicherung blockieren. 
XSRSB.S=F\u00FCr eine Transaktion mit nicht protokollierten und nicht festgeschriebenen Operationen kann keine Sicherung durchgef\u00FChrt werden.
XSRSC.S=Die Datenbank kann nicht in {0} gesichert werden, da es sich nicht um ein Datenbankverzeichnis handelt.
XSTA2.S=Es wurde versucht, eine Transaktion zu aktivieren, obwohl bereits eine andere Transaktion aktiv war.
XSTB0.M=Beim Abbrechen der Transaktion wurde eine Ausnahme ausgel\u00F6st.
XSTB2.M=Die Transaktions\u00E4nderungen k\u00F6nnen nicht protokolliert werden. M\u00F6glicherweise versuchen Sie, in eine schreibgesch\u00FCtzte Datenbank zu schreiben.
XSTB3.M=Die Transaktion kann nicht abgebrochen werden, weil der Protokollmanager - wahrscheinlich aufgrund eines fr\u00FCheren Fehlers - nicht angegeben ist.
XSTB5.M=Beim Erstellen einer Datenbank mit inaktivierter Protokollierung ist ein unerwarteter Fehler aufgetreten.
XSTB6.M=Eine Transaktionstabelle kann nicht durch eine andere ersetzt werden, solange eine der beiden Tabellen verwendet wird.
XXXXX.C.6=Normale Beendigung der Datenbanksitzung.
