ij> --
--   Licensed to the Apache Software Foundation (ASF) under one or more
--   contributor license agreements.  See the NOTICE file distributed with
--   this work for additional information regarding copyright ownership.
--   The ASF licenses this file to You under the Apache License, Version 2.0
--   (the "License"); you may not use this file except in compliance with
--   the License.  You may obtain a copy of the License at
--
--      http://www.apache.org/licenses/LICENSE-2.0
--
--   Unless required by applicable law or agreed to in writing, software
--   distributed under the License is distributed on an "AS IS" BASIS,
--   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
--   See the License for the specific language governing permissions and
--   limitations under the License.
--
AUTOCOMMIT OFF;
ij> -- MODULE DML029
-- SQL Test Suite, V6.0, Interactive SQL, dml029.sql
-- 59-byte ID
-- TEd Version #
-- AUTHORIZATION HU
   set schema HU;
0 rows inserted/updated/deleted
ij> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
HU                                                                                                                              
ij> -- RERUN if USER value does not match preceding AUTHORIZATION comment
-- date_time print
-- TEST:0129 Double quote work in character string literal!
-- setup
     INSERT INTO STAFF
            VALUES('E8','Yang Ling',15,'Xi''an');
1 row inserted/updated/deleted
ij> -- PASS:0129 If 1 row is inserted?
      SELECT GRADE,CITY
           FROM STAFF
           WHERE EMPNUM = 'E8';
GRADE|CITY           
---------------------
15   |Xi'an          
ij> -- PASS:0129 If GRADE = 15 and CITY = 'Xi'an'?
-- restore
     ROLLBACK WORK;
ij> -- END TEST >>> 0129 <<< END TEST
-- ************************************************************
-- TEST:0130 Approximate numeric literal <mantissa>E<exponent>!
-- setup
     INSERT INTO JJ
            VALUES(123.456E3);
1 row inserted/updated/deleted
ij> -- PASS:0130 If 1 row is inserted?
--O      SELECT COUNT(*)
      SELECT *
           FROM JJ
           WHERE FLOATTEST > 123455 AND FLOATTEST < 123457;
FLOATTEST             
----------------------
123456.0              
ij> -- PASS:0130 If count = 1 ?
-- restore
     ROLLBACK WORK;
ij> -- END TEST >>> 0130 <<< END TEST
-- ***************************************************************
-- TEST:0131 Approximate numeric literal with negative exponent!
-- setup
     INSERT INTO JJ
            VALUES(123456E-3);
1 row inserted/updated/deleted
ij> -- PASS:0131 If 1 row is inserted?
--O      SELECT COUNT(*)
      SELECT *
           FROM JJ
           WHERE FLOATTEST > 122 AND FLOATTEST < 124;
FLOATTEST             
----------------------
123.456               
ij> -- PASS:0131 If count = 1 ?
-- restore
     ROLLBACK WORK;
ij> -- END TEST >>> 0131 <<< END TEST
-- ********************************************************
-- TEST:0182 Approx numeric literal with negative mantissa & exponent!
-- setup
     INSERT INTO JJ
            VALUES(-123456E-3);
1 row inserted/updated/deleted
ij> -- PASS:0182 If 1 row is inserted?
--O     SELECT COUNT(*)
     SELECT *
           FROM JJ
           WHERE FLOATTEST > -124 AND FLOATTEST < -122;
FLOATTEST             
----------------------
-123.456              
ij> -- PASS:0182 If count = 1 ?
-- restore
     ROLLBACK WORK;
ij> -- END TEST >>> 0182 <<< END TEST
-- *************************************************////END-OF-MODULE
;
ij> 
