ij> AUTOCOMMIT OFF;
ij> -- MODULE   XTS742

-- SQL Test Suite, V6.0, Interactive SQL, xts742.sql
-- 59-byte ID
-- TEd Version #

-- AUTHORIZATION CTS1
   set schema CTS1;
0 rows inserted/updated/deleted
ij> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
CTS1                                                                                                                            
ij> -- RERUN if USER value does not match preceding AUTHORIZATION comment
   ROLLBACK WORK;
ij> -- date_time print

-- TEST:7042 COUNT ALL <literal>!

   SELECT COUNT(ALL 115.5), COUNT(ALL 'ATHINA'), COUNT(ALL 255), 
         COUNT(*) FROM CL_DATA_TYPE;
1          |2          |3          |4          
-----------------------------------------------
6          |6          |6          |6          
ij> -- PASS:7042 If COUNTs are 6, 6, 6, 6?

--O   INSERT INTO CTS1.CL_DATA_TYPE VALUES(NULL,55,225,10);
   INSERT INTO CL_DATA_TYPE VALUES(NULL,55,225,10);
1 row inserted/updated/deleted
ij> -- PASS:7042 If 1 row inserted successfully?

--O   INSERT INTO CTS1.CL_DATA_TYPE VALUES(NULL,15,140,NULL);
   INSERT INTO CL_DATA_TYPE VALUES(NULL,15,140,NULL);
1 row inserted/updated/deleted
ij> -- PASS:7042 If 1 row inserted successfully?

   SELECT COUNT(*),COUNT(ALL 119), COUNT(ALL 'GIORGOS') ,
         COUNT(CL_CHAR),
         COUNT(CL_REAL) FROM CL_DATA_TYPE;
1          |2          |3          |4          |5          
-----------------------------------------------------------
8          |8          |8          |6          |7          
WARNING 01003: Null values were eliminated from the argument of a column function.
ij> -- PASS:7042 If COUNTs are 8, 8, 8, 6, 7?
-- PASS:7042 If WARNING - null value eliminated in set function?

--O   INSERT INTO CTS1.CL_DATA_TYPE VALUES(NULL,0,0,NULL);
   INSERT INTO CL_DATA_TYPE VALUES(NULL,0,0,NULL);
1 row inserted/updated/deleted
ij> -- PASS:7042 If 1 row inserted successfully?

   SELECT COUNT(*), COUNT(ALL 1000), COUNT(ALL 'STEFOS'),
         COUNT(CL_CHAR),
         COUNT(CL_REAL) FROM CL_DATA_TYPE;
1          |2          |3          |4          |5          
-----------------------------------------------------------
9          |9          |9          |6          |7          
WARNING 01003: Null values were eliminated from the argument of a column function.
ij> -- PASS:7042 If COUNTs = 9, 9, 9, 6, 7?
-- PASS:7042 If WARNING - null value eliminated in set function?

   ROLLBACK WORK;
ij> -- END TEST >>> 7042 <<< END TEST
-- *********************************************
-- *************************************************////END-OF-MODULE
;
ij> 