###################################################
#
# Licensed to the Apache Software Foundation (ASF) under one or more
# contributor license agreements.  See the NOTICE file distributed with
# this work for additional information regarding copyright ownership.
# The ASF licenses this file to You under the Apache License, Version 2.0
# (the "License"); you may not use this file except in compliance with
# the License.  You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#
###################################################

###################################################
#
# DO NOT EDIT THIS FILE!
#
# Instead, edit messages.xml. The ant MessageBuilder task takes
# messages.xml as input and from it generates this file.
#
###################################################


01001=Se ha intentado actualizar o suprimir una fila ya suprimida: no se ha actualizado ni suprimido ninguna fila.

01003=Se han eliminado valores nulos del argumento de una funci\u00F3n de columna.

# Arguments:
#
#    {0} = authorizationID
#
01006=Privilegio no revocado del usuario {0}.

# Arguments:
#
#    {0} = authorizationID
#    {1} = authorizationID
#
01007=El rol {0} no se ha revocado del ID de autenticaci\u00F3n {1}.

# Arguments:
#
#    {0} = authorizationID
#    {1} = authorizationID
#
01008=WITH ADMIN OPTION del rol {0} no revocado del ID de autenticaci\u00F3n {1}.

# Arguments:
#
#    {0} = columnName
#    {1} = tableName
#
01009=La columna generada {0} se ha borrado de la tabla {1}.

0100E=Intento de devolver demasiados juegos de resultados. 

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#
01500=Se ha borrado la restricci\u00F3n {0} de la tabla {1}.

# Arguments:
#
#    {0} = viewName
#
01501=Se ha borrado la vista {0}.

# Arguments:
#
#    {0} = triggerName
#    {1} = tableName
#
01502=Se ha borrado el disparador {0} de la tabla {1}.

# Arguments:
#
#    {0} = columnName
#    {1} = tableName
#
01503=Se ha modificado la columna {0} de la tabla {1} al agregar una restricci\u00F3n no nula.

# Arguments:
#
#    {0} = indexName
#
01504=El nuevo \u00EDndice es un duplicado de un \u00EDndice existente: {0}.

# Arguments:
#
#    {0} = dataValue
#
01505=Puede que el valor {0} est\u00E9 truncado.

# Arguments:
#
#    {0} = synonymName
#    {1} = objectName
#
01522=El sin\u00F3nimo ''{0}'' reci\u00E9n definido se ha resuelto en el objeto ''{1}'' que no est\u00E1 actualmente definido.

# Arguments:
#
#    {0} = databaseName
#
01J01=No se ha creado la base de datos ''{0}'', en su lugar se ha realizado una conexi\u00F3n a una base de datos existente.

01J02=Los cursores sensibles al desplazamiento no est\u00E1n implantados actualmente.

# Arguments:
#
#    {0} = className
#    {1} = columnName
#
01J04=La clase ''{0}'' para la columna ''{1}'' no implanta java.io.Serializable o java.sql.SQLData. Las instancias deben implantar una de estas interfaces para que \u00E9stas se puedan almacenar.

01J05=Actualizaci\u00F3n de base de datos correcta. La base de datos actualizada est\u00E1 preparada ahora para su uso. No se han podido revalidar las sentencias preparadas almacenadas. Consulte la excepci\u00F3n siguiente para obtener detalles sobre el fallo.

01J06=No se puede actualizar ResultSet. La consulta no es v\u00E1lida para generar un ResultSet actualizable.

01J07=ResultSetHoldability est\u00E1 restringido a ResultSet.CLOSE_CURSORS_AT_COMMIT para una transacci\u00F3n global.

# Arguments:
#
#    {0} = resultSetType
#    {1} = resultSetType
#
01J08=No se ha podido abrir el tipo resultSet {0}. Se ha abierto el tipo ResultSet {1}.

01J10=Los juegos de resultados sensibles al desplazamiento no est\u00E1n soportados por el servidor; se realizar\u00E1 una nueva asignaci\u00F3n al cursor de s\u00F3lo avance

01J12=No se ha podido obtener el texto del mensaje del servidor. Consulte la siguiente excepci\u00F3n. El procedimiento almacenado SYSIBM.SQLCAMESSAGE no est\u00E1 instalado en el servidor. P\u00F3ngase en contacto con el administrador de la base de datos.

# Arguments:
#
#    {0} = number
#
01J13=El n\u00FAmero de filas devueltas ({0}) es demasiado grande para un entero; el valor devuelto se truncar\u00E1.

01J14=Se est\u00E1 utilizando la autorizaci\u00F3n SQL sin activar primero la autenticaci\u00F3n.

# Arguments:
#
#    {0} = remainingDays
#    {1} = databaseName
#
01J15=La contrase\u00F1a caducar\u00E1 en {0} d\u00EDas. Utilice el procedimiento SYSCS_UTIL.SYSCS_MODIFY_PASSWORD para cambiar la contrase\u00F1a en la base de datos ''{1}''.

# Arguments:
#
#    {0} = databaseName
#
01J16=La contrase\u00F1a est\u00E1 anticuada. Para proteger la base de datos, debe actualizar la contrase\u00F1a lo antes posible. Utilice el procedimiento SYSCS_UTIL.SYSCS_MODIFY_PASSWORD para cambiar la contrase\u00F1a en la base de datos ''{0}''.

01J17=No puede cifrar, volver a cifrar o descifrar una base de datos que ya est\u00E1 iniciada. Debe cerrar la base de datos antes de intentar estas operaciones.

07000=Al menos un par\u00E1metro de la sentencia actual no est\u00E1 inicializado.

# Arguments:
#
#    {0} = parameterName
#    {1} = procedureName
#
07004=El par\u00E1metro {0} es un par\u00E1metro de procedimiento {1}, por lo que se debe registrar con CallableStatement.registerOutParameter antes de la ejecuci\u00F3n.

07009=Sin par\u00E1metros de entrada.

08000=Conexi\u00F3n cerrada por una interrupci\u00F3n desconocida.

08001.C.10=No se ha podido establecer una conexi\u00F3n porque el token de seguridad es mayor que el m\u00E1ximo permitido por el protocolo de red.

08001.C.11=No se ha podido establecer una conexi\u00F3n porque el ID de usuario tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.

08001.C.12=No se ha podido establecer una conexi\u00F3n porque la contrase\u00F1a tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.

08001.C.13=No se ha podido establecer una conexi\u00F3n porque el nombre externo (EXTNAM) tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.

08001.C.14=No se ha podido establecer una conexi\u00F3n porque el nombre de servidor (SRVNAM) tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.

# Arguments:
#
#    {0} = propertyName
#
08001.C.1=La propiedad Derby DataSource {0} necesaria no est\u00E1 definida.

# Arguments:
#
#    {0} = error
#    {1} = serverName
#    {2} = portNumber
#    {3} = messageText
#
08001.C.2={0}: Error al conectarse al servidor {1} en el puerto {2} con el mensaje {3}.

# Arguments:
#
#    {0} = error
#
08001.C.3=SocketException: ''{0}''

# Arguments:
#
#    {0} = error
#
08001.C.4=No se ha podido abrir el flujo en el socket: ''{0}''.

# Arguments:
#
#    {0} = number
#    {1} = number
#
08001.C.5=La longitud del ID de usuario ({0}) est\u00E1 fuera del rango entre 1 y {1}.

# Arguments:
#
#    {0} = length
#    {1} = number
#
08001.C.6=La longitud de la contrase\u00F1a ({0}) est\u00E1 fuera del rango entre 1 y {1}.

08001.C.7=El ID de usuario no puede ser nulo.

08001.C.8=La contrase\u00F1a no puede ser nula.

# Arguments:
#
#    {0} = databaseName
#
08001.C.9=No se ha podido establecer una conexi\u00F3n porque el nombre de la base de datos ''{0}'' es mayor que la longitud m\u00E1xima permitida por el protocolo de red.

08003=Sin conexi\u00F3n actual.

08003.C.1=getConnection() no v\u00E1lido en PooledConnection cerrado.

08003.C.2=El m\u00E9todo lob llamado despu\u00E9s de una conexi\u00F3n se ha cerrado

08003.C.3=La conexi\u00F3n f\u00EDsica subyacente est\u00E1 anticuada o cerrada.

# Arguments:
#
#    {0} = connectionName
#
08004=Conexi\u00F3n rechazada: {0}

# Arguments:
#
#    {0} = reasonText
#
08004.C.1=Se ha producido un fallo de autenticaci\u00F3n de conexi\u00F3n. Motivo: {0}.

# Arguments:
#
#    {0} = databaseName
#
08004.C.2=Se ha rechazado la conexi\u00F3n porque no se ha encontrado la base de datos {0}.

08004.C.3=Conexi\u00F3n de base de datos rechazada.

# Arguments:
#
#    {0} = authorizationID
#    {1} = databaseName
#
08004.C.4=El usuario ''{0}'' no puede cerrar la sesi\u00F3n de la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.

# Arguments:
#
#    {0} = authorizationID
#    {1} = databaseName
#
08004.C.5=El usuario ''{0}'' no puede volver a cifrar la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.

# Arguments:
#
#    {0} = authorizationID
#    {1} = databaseName
#
08004.C.6=El usuario ''{0}'' no puede realizar una actualizaci\u00F3n de la base de datos ''{1}''. Solo el propietario de la base de datos puede realizar esta operaci\u00F3n.

# Arguments:
#
#    {0} = databaseName
#
08004.C.7=La conexi\u00F3n con la base de datos ''{0}'' ha sido rechazada porque est\u00E1 en modo esclavo de replicaci\u00F3n.

# Arguments:
#
#    {0} = authorizationID
#    {1} = databaseName
#
08004.C.8=El usuario ''{0}'' no puede emitir una operaci\u00F3n de replicaci\u00F3n en la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.

# Arguments:
#
#    {0} = authorizationID
#    {1} = exceptionMsg
#
08004.C.9=Falta el permiso para que usuario ''{0}'' cierre el sistema [{1}].

# Arguments:
#
#    {0} = databaseName
#    {1} = exceptionMsg
#
08004.C.10=No se pueden comprobar los permisos del sistema para crear la base de datos ''{0}'' [{1}].

# Arguments:
#
#    {0} = authorizationID
#    {1} = databaseName
#    {2} = exceptionMsg
#
08004.C.11=Falta el permiso para que el usuario ''{0}'' cree la base de datos ''{1}'' [{2}].

08004.C.12=Se ha producido un fallo en la autenticaci\u00F3n de la conexi\u00F3n. Las credenciales proporcionadas no son v\u00E1lidas o la base de datos utiliza un esquema de cifrado de contrase\u00F1as incompatible con el mecanismo de seguridad de contrase\u00F1as seguras de sustituci\u00F3n. Si este error se inici\u00F3 despu\u00E9s de la actualizaci\u00F3n, consulte la nota t\u00E9cnica obre la versi\u00F3n de DERBY-4483 para consultar las posibles opciones.

08004.C.13=El nombre de usuario o la contrase\u00F1a es nula o tiene una longitud 0.

# Arguments:
#
#    {0} = authorizationID
#    {1} = databaseName
#
08004.C.14=El usuario ''{0}'' no puede descifrar la base de datos ''{1}''. Solo el propietario de la base de datos puede realizar esta operaci\u00F3n.

# Arguments:
#
#    {0} = error
#
08006.C=Se ha encontrado un error de protocolo de red y se ha terminado la conexi\u00F3n: {0}

08006.C.1=Se ha producido un error durante el restablecimiento de la conexi\u00F3n y \u00E9sta se ha terminado. Consulte las excepciones encadenadas para obtener m\u00E1s informaci\u00F3n.

# Arguments:
#
#    {0} = error
#
08006.C.2= SocketException: ''{0}''

# Arguments:
#
#    {0} = error
#
08006.C.3=Se ha detectado un error de comunicaciones: {0}.

08006.C.4=Se ha producido un error durante un restablecimiento de conexi\u00F3n diferido y la conexi\u00F3n se ha terminado. Consulte las excepciones encadenadas para obtener m\u00E1s informaci\u00F3n.

# Arguments:
#
#    {0} = number
#    {1} = number
#
08006.C.5=No hay suficientes datos durante la lectura desde la red: se esperaba un m\u00EDnimo de {0} y s\u00F3lo se han recibido {1} bytes. La conexi\u00F3n se ha terminado.

08006.C.6=Se ha intentado materializar por completo datos lob demasiado grandes para JVM. La conexi\u00F3n se ha terminado.

08006.C.8=org.apache.derby.jdbc.EmbeddedDriver no se ha registrado con el gestor de controladores JDBC

# Arguments:
#
#    {0} = databaseName
#
08006.D=Cierre de la base de datos ''{0}''.

# Arguments:
#
#    {0} = databaseName
#
08006.D.1=Base de datos ''{0}'' borrada.

# Arguments:
#
#    {0} = featureName
#
0A000.S=Funci\u00F3n no implantada: {0}.

# Arguments:
#
#    {0} = commandName
#
0A000.C.6=El comando DRDA {0} no est\u00E1 implantado actualmente. La conexi\u00F3n se ha terminado.

0A000.S.1=El m\u00E9todo JDBC a\u00FAn no se ha implantado.

# Arguments:
#
#    {0} = methodName
#
0A000.S.2=El m\u00E9todo JDBC {0} no est\u00E1 soportado por el servidor. Actualice el servidor.

# Arguments:
#
#    {0} = propertyName
#
0A000.S.3=La propiedad resultSetHoldability {0} no est\u00E1 soportada

0A000.S.4=cancel() no est\u00E1 soportado por el servidor.

# Arguments:
#
#    {0} = mechanismName
#
0A000.S.5=El mecanismo de seguridad ''{0}'' no est\u00E1 soportado.

# Arguments:
#
#    {0} = datatypeName
#
0A000.S.7=El tipo de dato ''{0}'' no est\u00E1 soportado.

# Arguments:
#
#    {0} = roleName
#
0P000=Especificaci\u00F3n de rol no v\u00E1lida, el rol no existe: ''{0}''.

# Arguments:
#
#    {0} = roleName
#
0P000.S.1=Especificaci\u00F3n de rol no v\u00E1lida, no se ha otorgado el rol al usuario actual o PUBLIC: ''{0}''.

21000=La subconsulta escalar s\u00F3lo puede devolver una sola fila.

21000.S.1=Una fila en la tabla de destino cualifica para m\u00E1s de una acci\u00F3n DELETE o UPDATE.

# Arguments:
#
#    {0} = dataType
#    {1} = dataValue
#    {2} = length
#
22001=Se ha producido un error de truncamiento al intentar reducir {0} ''{1}'' a una longitud de {2}.

# Arguments:
#
#    {0} = datatypeName
#
22003=El valor resultante queda fuera del rango para el tipo de dato {0}.

# Arguments:
#
#    {0} = year
#    {1} = year
#
22003.S.1=El a\u00F1o ({0}) excede el m\u00E1ximo ''{1}''.

22003.S.2=El decimal s\u00F3lo puede tener un m\u00E1ximo de 31 d\u00EDgitos.

# Arguments:
#
#    {0} = datatypeName
#    {1} = datatypeName
#
22003.S.3=Se ha producido un desbordamiento durante la conversi\u00F3n del tipo de dato num\u00E9rico de ''{0}'' a {1}.

# Arguments:
#
#    {0} = number
#    {1} = datatypeName
#
22003.S.4=La longitud de ({0}) excede la longitud m\u00E1xima ({1}) para el tipo de dato.

# Arguments:
#
#    {0} = typeName
#    {1} = typeName
#
22005.S.1=No se ha podido convertir un valor del tipo ''{0}'' al tipo ''{1}'' : la codificaci\u00F3n no est\u00E1 soportada.

22005.S.2=El convertidor de caracteres necesario no est\u00E1 disponible.

22005.S.3=La cadena Unicode no se puede convertir a la cadena Ebcdic

# Arguments:
#
#    {0} = typeName
#    {1} = number
#    {2} = number
#
22005.S.4=Tipo JDBC no reconocido. Tipo: {0}, columnCount: {1}, columnIndex: {2}.

# Arguments:
#
#    {0} = parameterName
#
22005.S.5=Tipo JDBC no v\u00E1lido para el par\u00E1metro {0}.

# Arguments:
#
#    {0} = datatypeName
#
22005.S.6=Tipo SQL Java no reconocido {0}.

22005.S.7=La cadena Unicode no se puede convertir en una cadena UTF-8

# Arguments:
#
#    {0} = datatypeName
#    {1} = datatypeName
#
22005=Se ha intentado obtener un valor de datos de tipo ''{0}'' de un valor de datos de tipo ''{1}''.

22007.S.180=La representaci\u00F3n de cadena de un valor de fecha y hora queda fuera de rango.

22007.S.181=La sintaxis de la representaci\u00F3n de cadena de un valor de fecha y hora es incorrecta.

# Arguments:
#
#    {0} = argument
#    {1} = functionName
#
22008.S=''{0}'' es un argumento no v\u00E1lido en la funci\u00F3n {1}.

# Arguments:
#
#    {0} = schemaName
#    {1} = sequenceName
#
2200H.S=El generador de secuencias ''{0}''.''{1}'' no recorre los elementos. No se pueden obtener m\u00E1s valores de este generador de secuencias.

2200L=Los valores asignados a columnas XML deben tener nodos de documento con formato correcto.

# Arguments:
#
#    {0} = parserError
#
2200M=Documento XML no v\u00E1lido: {0}

# Arguments:
#
#    {0} = operatorName
#
2200V=Elemento de contexto no v\u00E1lido para el operador {0}; los elementos de contexto deben ser nodos de documento con formato correcto.

2200W=Error de serializaci\u00F3n de XQuery: se ha intentado serializar uno o m\u00E1s nodos de atributo de nivel superior.

22011=El segundo o tercer argumento de la funci\u00F3n SUBSTR queda fuera de rango.

# Arguments:
#
#    {0} = offset
#    {1} = len
#    {2} = str
#
22011.S.1=El rango especificado para la subcadena con el desplazamiento {0} y la longitud {1} est\u00E1 fuera de rango para la cadena: {2}.

22012=Intento de divisi\u00F3n entre cero.

# Arguments:
#
#    {0} = number
#
22013=Intento de calcular la ra\u00EDz cuadrada de un n\u00FAmero negativo, ''{0}''.

# Arguments:
#
#    {0} = searchString
#    {1} = fromString
#    {2} = startIndex
#
22014=La posici\u00F3n inicial de LOCATE no es v\u00E1lida; debe ser un entero positivo. El \u00EDndice desde el que comenzar la b\u00FAsqueda es ''{2}''. La cadena que se va a buscar es ''{0}''. La cadena desde la que se buscar es ''{1}''. 

# Arguments:
#
#    {0} = functionName
#    {1} = typeName
#    {2} = typeName
#    {3} = typeName
#
22015=La funci\u00F3n ''{0}'' no est\u00E1 permitida en el siguiente juego de tipos. El primer operando es de tipo ''{1}''. El segundo operando es de tipo ''{2}''. El tercer operando (posici\u00F3n inicial) es de tipo ''{3}''.

# Arguments:
#
#    {0} = typeName
#
22018=Formato de cadena de caracteres no v\u00E1lido para el tipo {0}.

# Arguments:
#
#    {0} = sequenceName
#
22019=Secuencia de escape no v\u00E1lida, ''{0}''. La cadena de escape debe contener exactamente un car\u00E1cter. No puede ser nula o contener m\u00E1s de un car\u00E1cter.

# Arguments:
#
#    {0} = string
#
22020=Cadena de recorte no v\u00E1lida, ''{0}''. La cadena de recorte debe estar formada exactamente por un car\u00E1cter o ser nula. No puede tener m\u00E1s de un car\u00E1cter.

22025=El car\u00E1cter de escape debe ir seguido del car\u00E1cter de escape, ''_'' o ''%''. No puede ir seguido de ning\u00FAn otro car\u00E1cter ni al final del patr\u00F3n.

22027=La funci\u00F3n incorporada TRIM() s\u00F3lo soporta un \u00FAnico car\u00E1cter de recorte. Las funciones incorporadas LTRIM() y RTRIM() soportan varios caracteres de recorte.

# Arguments:
#
#    {0} = number
#
22028=La cadena excede la longitud m\u00E1xima de {0}.

22501=Una cl\u00E1usula ESCAPE de NULL devuelve resultados no definidos y no est\u00E1 permitida.

2201X=El recuento de filas de OFFSET no es v\u00E1lido, debe ser >= 0.

2201W=El recuento de filas de FIRST/NEXT debe ser >= 1 y el recuento de filas de LIMIT debe ser >= 0.

# Arguments:
#
#    {0} = string
#
2201Z=Valor NULL no permitido para el argumento {0}.

# Arguments:
#
#    {0} = columnName
#
23502=La columna ''{0}'' no acepta un valor NULL.

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#    {2} = statementType
#    {3} = keyName
#
23503={2} en la tabla ''{1}'' ha causado una violaci\u00F3n de restricci\u00F3n de clave ajena ''{0}'' para la clave {3}. Se ha realizado un rollback en la sentencia.

# Arguments:
#
#    {0} = indexOrConstraintName
#    {1} = tableName
#
23505=Se ha abortado la sentencia porque habr\u00EDa causado un valor de clave duplicado en una restricci\u00F3n de clave \u00FAnica o primaria o en un \u00EDndice \u00FAnico identificado por ''{0}'' definido en ''{1}''.

# Arguments:
#
#    {0} = indexOrConstraintName
#    {1} = tableName
#
23506.T.1=Se ha abortado la transacci\u00F3n debido a una violaci\u00F3n de restricci\u00F3n diferida: duplicada en una restricci\u00F3n de clave \u00FAnica o primaria identificada por ''{0}'' definida en ''{1}''.

# Arguments:
#
#    {0} = indexOrConstraintName
#    {1} = tableName
#
23507.S.1=Violaci\u00F3n de restricci\u00F3n diferida: duplicada en una restricci\u00F3n de clave \u00FAnica o primaria identificada por ''{0}'' definida en ''{1}''.

# Arguments:
#
#    {0} = tableName
#    {1} = constraintName
#
23513=La restricci\u00F3n de comprobaci\u00F3n ''{1}'' se ha violado al realizar un INSERT o UPDATE en la tabla ''{0}''.

# Arguments:
#
#    {0} = indexOrConstraintName
#    {1} = tableName
#    {2} = constraintText
#
23514.T.1=Se ha abortado la transacci\u00F3n debido a una violaci\u00F3n de restricci\u00F3n diferida: restricci\u00F3n de control identificada por ''{0}'' definida en {1} como ''{2}''.

# Arguments:
#
#    {0} = indexOrConstraintName
#    {1} = tableName
#    {2} = constraintText
#
23515.S.1=Violaci\u00F3n de restricci\u00F3n diferida: restricci\u00F3n de control identificada por ''{0}'' definida en {1} como ''{2}''.

# Arguments:
#
#    {0} = indexOrConstraintName
#    {1} = tableName
#    {2} = indexOrConstraintName
#    {3} = tableName
#    {4} = keyName
#
23516.T.1=Se ha abortado la transacci\u00F3n debido a una violaci\u00F3n de restricci\u00F3n diferida: clave ajena ''{0}'' definida en {1} que hace referencia a la restricci\u00F3n ''{2}'' definida en {3}, clave ''{4}''.

# Arguments:
#
#    {0} = indexOrConstraintName
#    {1} = tableName
#    {2} = indexOrConstraintName
#    {3} = tableName
#    {4} = keyName
#
23517.S.1=Violaci\u00F3n de restricci\u00F3n diferida: restricci\u00F3n de clave ajena ''{0}'' definida en {1} que hace referencia a la restricci\u00F3n ''{2}'' definida en {3}, clave ''{4}''.

24000=Estado del cursor no v\u00E1lido: sin fila actual.

24501.S=El cursor identificado no est\u00E1 abierto.

25001=No se puede cerrar una conexi\u00F3n mientras todav\u00EDa siga activa una transacci\u00F3n.

25001.S.1=Estado de transacci\u00F3n no v\u00E1lido: transacci\u00F3n SQL activa.

25501=No se ha podido definir la propiedad de conexi\u00F3n de s\u00F3lo lectura en una transacci\u00F3n activa.

25502=No se permite un cambio de datos SQL en una conexi\u00F3n, usuario o base de datos de s\u00F3lo lectura.

25503=No se permite DDL en una conexi\u00F3n, usuario o base de datos de s\u00F3lo lectura.

25505=Un usuario de s\u00F3lo lectura o un usuario de una base de datos de s\u00F3lo lectura no puede desactivar el modo de s\u00F3lo lectura de una conexi\u00F3n.

# Arguments:
#
#    {0} = authorizationID
#
28502=El nombre de usuario ''{0}'' no es v\u00E1lido. 

2D521.S.1=setAutoCommit(true) no v\u00E1lido durante una transacci\u00F3n global.

2D521.S.2=Rollback o confirmaci\u00F3n no v\u00E1lida para el entorno de ejecuci\u00F3n de la aplicaci\u00F3n.

# Arguments:
#
#    {0} = exception
#
38000=Se ha devuelto la excepci\u00F3n ''{0}'' al evaluar una expresi\u00F3n.

38001=No est\u00E1 permitida la rutina externa para ejecutar sentencias SQL.

38002=La rutina ha intentado modificar los datos, pero \u00E9sta no se ha definido como MODIFIES SQL DATA.

38004=La rutina ha intentado leer los datos, pero la rutina no se ha definido como READS SQL DATA.

# Arguments:
#
#    {0} = type
#
39004=No se puede transferir un valor NULL a un m\u00E9todo que toma un par\u00E1metro de tipo primitivo ''{0}''.

# Arguments:
#
#    {0} = savepointName
#
3B001.S=SAVEPOINT {0} no existe o no est\u00E1 activo en la transacci\u00F3n actual.

3B002.S=Se alcanz\u00F3 el n\u00FAmero m\u00E1ximo de SAVEPOINT. 

3B501.S=Ya existe un SAVEPOINT con el nombre que se ha transferido en la transacci\u00F3n actual.

3B502.S=Se ha especificado una versi\u00F3n o la realizaci\u00F3n de un rollback en un punto de grabaci\u00F3n, pero no existe ning\u00FAn punto de grabaci\u00F3n.

# Arguments:
#
#    {0} = lockCycle
#    {1} = transactionID
#
40001=No se ha podido obtener un bloqueo debido a un interbloqueo, el ciclo de bloqueos y esperas es:\n{0}. El objetivo seleccionado es XID : {1}.

40XC0=Sentencia inoperativa. Puede estar causado por la detecci\u00F3n de un error grave de la transacci\u00F3n dentro de esta sentencia.

40XD0=Se ha cerrado el contenedor.

40XD1=El contenedor se ha abierto en modo de s\u00F3lo lectura.

# Arguments:
#
#    {0} = containerName
#
40XD2=El contenedor {0} no se puede abrir; se ha borrado o no existe.

40XL1=No se ha podido obtener un bloqueo en el tiempo solicitado

# Arguments:
#
#    {0} = tableDump
#
40XL1.T.1=No se ha podido obtener un bloqueo en el tiempo solicitado. El vaciado de lockTable es: {0}

40XL2=Interbloqueo autom\u00E1tico.

40XT0=El m\u00F3dulo RawStore ha identificado un error interno.

40XT1=Se ha devuelto una excepci\u00F3n durante la confirmaci\u00F3n de la transacci\u00F3n.

40XT2=Se ha generado una excepci\u00F3n durante el rollback de SAVEPOINT.

40XT4=Se ha intentado cerrar una transacci\u00F3n que a\u00FAn estaba activa. Se ha abortado la transacci\u00F3n.

40XT5=Se ha devuelto una excepci\u00F3n durante una transacci\u00F3n interna.

40XT6=La base de datos est\u00E1 desactivada y no se puede activar la transacci\u00F3n. Espere hasta que la base de datos se active.

40XT7=La operaci\u00F3n no est\u00E1 soportada en una transacci\u00F3n interna.

# Arguments:
#
#    {0} = internalTransactionState
#
40XT8=El m\u00F3dulo RawStore ha identificado un error interno. El estado interno detallado de la transacci\u00F3n es el siguiente: {0}

42000=Error de sintaxis o violaci\u00F3n de regla de acceso; consulte los errores adicionales para obtener m\u00E1s informaci\u00F3n.

# Arguments:
#
#    {0} = authorizationID
#    {1} = permissionType
#    {2} = schemaNamet
#    {3} = tableName
#
42500=El usuario ''{0}'' no tiene el permiso {1} en la tabla ''{2}''.''{3}''.

# Arguments:
#
#    {0} = authorizationID
#    {1} = permissionType
#    {2} = schemaNamet
#    {3} = tableName
#
42501=El usuario ''{0}'' no tiene el permiso {1} en la tabla ''{2}''.''{3}'' para el otorgamiento.

# Arguments:
#
#    {0} = authorizationID
#    {1} = permissionType
#    {2} = columnName
#    {3} = schemaName
#    {4} = tableName
#
42502=El usuario ''{0}'' no tiene el permiso {1} en la columna ''{2}'' de la tabla ''{3}''.''{4}''.

# Arguments:
#
#    {0} = authorizationID
#    {1} = permissionType
#    {2} = columnName
#    {3} = schemaName
#    {4} = tableName
#
42503=El usuario ''{0}'' no tiene el permiso {1} en la columna ''{2}'' de la tabla ''{3}''.''{4}'' para el otorgamiento.

# Arguments:
#
#    {0} = authorizationID
#    {1} = permissionType
#    {2} = objectName
#    {3} = schemaName
#    {4} = tableName
#
42504=El usuario ''{0}'' no tiene el permiso {1} en {2} ''{3}''.''{4}''.

# Arguments:
#
#    {0} = authorizationID
#    {1} = permissionType
#    {2} = objectName
#    {3} = schemaName
#    {4} = tableName
#
42505=El usuario ''{0}'' no tiene el permiso {1} en {2} ''{3}''.''{4}'' para el otorgamiento.

# Arguments:
#
#    {0} = authorizationID
#    {1} = objectName
#    {2} = schemaName
#    {3} = tableName
#
42506=El usuario ''{0}'' no es el propietario de {1} ''{2}''.''{3}''.

# Arguments:
#
#    {0} = authorizationID
#    {1} = schemaName
#
42507=El usuario ''{0}'' no puede realizar la operaci\u00F3n en el esquema ''{1}''.

# Arguments:
#
#    {0} = authorizationID
#    {1} = schemaName
#
42508=El usuario ''{0}'' no puede crear el esquema ''{1}''. Solo el propietario de la base de datos puede emitir esta sentencia.

# Arguments:
#
#    {0} = objectName
#
42509=La operaci\u00F3n de otorgamiento o revocaci\u00F3n especificada no est\u00E1 permitida en el objeto ''{0}''.

# Arguments:
#
#    {0} = authorizationID
#    {1} = permissionName
#    {2} = schemaName
#    {3} = objectName
#
4250A=El usuario ''{0}'' no tiene el permiso {1} en el objeto ''{2}''.''{3}''.

# Arguments:
#
#    {0} = propertyName
#    {1} = propertyValue
#
4250B=Propiedad de autorizaci\u00F3n de base de datos no v\u00E1lida ''{0}={1}''.

# Arguments:
#
#    {0} = authorizationID
#
4250C=Los usuarios ''{0}'' no pueden estar a la vez en listas de autorizaci\u00F3n de s\u00F3lo lectura y de acceso completo.

# Arguments:
#
#    {0} = listName
#    {1} = authorizationID
#
4250D=Usuarios ''{1}'' repetidos en la lista de acceso ''{0}'';

# Arguments:
#
#    {0} = authorizationID
#
4250E=Error interno: ID {0} no v\u00E1lido en la lista de permisos de sentencia.

# Arguments:
#
#    {0} = sqlText
#
4251A=La sentencia {0} s\u00F3lo la puede emitir el propietario de la base de datos.

4251B=PUBLIC est\u00E1 reservado y no se puede utilizar como identificador de usuario o nombre de rol.

# Arguments:
#
#    {0} = authorizationID
#    {1} = authorizationID
#
4251C=El rol {0} no se puede otorgar a {1} porque crear\u00EDa una circularidad.

4251D=S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.

# Arguments:
#
#    {0} = tableName
#    {1} = columnName
#
4251E=Nadie puede ver la columna ''{0}''.''{1}''.

4251F=No se pueden borrar las credenciales del propietario de la base de datos.

4251G=Defina derby.authentication.builtin.algorithm como un algoritmo de resumen de mensaje v\u00E1lido. El esquema de autenticaci\u00F3n actual es demasiado d\u00E9bil para que lo utilice la autenticaci\u00F3n NATIVE.

4251H=La especificaci\u00F3n de autenticaci\u00F3n NATIVE no es v\u00E1lida. Defina derby.authentication.provider como un valor de la pantalla NATIVE:$credentialsDB o NATIVE:$credentialsDB:LOCAL (en el nivel de sistema).

# Arguments:
#
#    {0} = databaseName
#
4251I=No se puede realizar la autenticaci\u00F3n porque la base de datos de credenciales ''{0}'' no existe.

# Arguments:
#
#    {0} = propertyName
#
4251J=El valor para la propiedad ''{0}'' se ha formateado de forma incorrecta.

4251K=Las primeras credenciales que se creen deben ser las de DBO.

# Arguments:
#
#    {0} = dbName
#
4251L=La propiedad derby.authentication.provider especifica ''{0}'' como el nombre de la base de datos de credenciales. Este nombre no es v\u00E1lido para una base de datos.

# Arguments:
#
#    {0} = columnName
#
42601=En una sentencia ALTER TABLE, la columna ''{0}'' se ha especificado como NOT NULL y no se ha especificado la cl\u00E1usula DEFAULT o bien se ha especificado como DEFAULT NULL.

42601.S.372=La sentencia ALTER TABLE no puede agregar una columna IDENTITY a una tabla.

# Arguments:
#
#    {0} = functionName
#
42605=El n\u00FAmero de argumentos para la funci\u00F3n ''{0}'' es incorrecto.

# Arguments:
#
#    {0} = number
#
42606=Se ha detectado una constante hexadecimal no v\u00E1lida que empieza por ''{0}''.

42610=Todos los argumentos de la funci\u00F3n COALESCE/VALUE no pueden ser par\u00E1metros. La funci\u00F3n necesita al menos un argumento que no sea un par\u00E1metro.

# Arguments:
#
#    {0} = dataType
#
42611=El atributo de longitud, precisi\u00F3n o escala para columna o asignaci\u00F3n de tipo ''{0}'' no es v\u00E1lido. 

# Arguments:
#
#    {0} = clause
#
42613=Hay una o m\u00E1s palabras claves en conflicto con la cl\u00E1usula ''{0}''.

# Arguments:
#
#    {0} = columnName
#
42621=Una restricci\u00F3n de comprobaci\u00F3n o columna generada definida con ''{0}'' no es v\u00E1lida.

# Arguments:
#
#    {0} = name
#    {1} = number
#
42622=El nombre ''{0}'' es demasiado largo. La longitud m\u00E1xima es ''{1}''.

# Arguments:
#
#    {0} = name
#    {1} = context
#
42734=El nombre ''{0}'' especificado en el contexto ''{1}'' no es \u00FAnico.

42802=El n\u00FAmero de valores asignado no coincide con el n\u00FAmero de columnas especificadas o impl\u00EDcitas.

# Arguments:
#
#    {0} = columnName
#
42803=Una expresi\u00F3n que contiene la columna ''{0}'' aparece en la lista SELECT y no forma parte de una cl\u00E1usula GROUP BY.

# Arguments:
#
#    {0} = sqlText
#
42815.S.713=El valor de sustituci\u00F3n para ''{0}'' no es v\u00E1lido.

# Arguments:
#
#    {0} = dataType
#    {1} = dataType
#
42815.S.171=El tipo de dato, longitud o valor de argumentos ''{0}'' y ''{1}'' no es compatible.

# Arguments:
#
#    {0} = type
#    {1} = type
#
42818=No est\u00E1n soportadas las comparaciones entre ''{0}'' y ''{1}''. Los tipos deben ser comparables. Adem\u00E1s, los tipos de cadena tambi\u00E9n deben tener una intercalaci\u00F3n coincidente. Si la intercalaci\u00F3n no coincide, una posible soluci\u00F3n es convertir los operandos para forzarlos a la intercalaci\u00F3n por defecto (por ejemplo: SELECT tablename FROM sys.systables WHERE CAST(tablename AS VARCHAR(128)) = ''T1'')

# Arguments:
#
#    {0} = string
#
42820=El literal de coma flotante ''{0}'' contiene m\u00E1s de 30 caracteres.

# Arguments:
#
#    {0} = type
#    {1} = type
#
42821=Las columnas de tipo ''{0}'' no pueden contener valores de tipo ''{1}''. 

42824=Un operando LIKE no es una cadena o el primer operando no es una columna.

# Arguments:
#
#    {0} = columnName
#
42831=''{0}'' no puede ser una columna de clave primaria o una clave \u00FAnica porque puede contener valores nulos.

# Arguments:
#
#    {0} = columnName
#
42831.S.1=''{0}'' no puede ser una columna de clave primaria porque puede contener valores nulos.

# Arguments:
#
#    {0} = key
#
42834=No se puede especificar SET NULL porque FOREIGN KEY ''{0}'' no puede contener valores nulos. 

# Arguments:
#
#    {0} = tableName
#    {1} = columnName
#
42837=ALTER TABLE ''{0}'' ha especificado atributos para la columna ''{1}'' que no son compatibles con la columna existente.

# Arguments:
#
#    {0} = type
#    {1} = type
#
42846=No se pueden convertir los tipos ''{0}'' a ''{1}''.

# Arguments:
#
#    {0} = columnName
#
42877=No est\u00E1 permitido un nombre de columna cualificado ''{0}'' en la cl\u00E1usula ORDER BY.

42878=La cl\u00E1usula ORDER BY de la sentencia SELECT UNION s\u00F3lo soporta referencias de columnas no cualificadas y n\u00FAmeros de posici\u00F3n de columna. Actualmente, no est\u00E1n soportadas otras expresiones.

# Arguments:
#
#    {0} = columnName
#
42879=La cl\u00E1usula ORDER BY no puede contener la columna ''{0}'', ya que la consulta contiene la clave DISTINCT y esa columna no aparece en el resultado de la consulta.

4287A=La cl\u00E1usula ORDER BY no puede especificar ninguna expresi\u00F3n, ya que la consulta especifica DISTINCT.

4287B=En este contexto, la cl\u00E1usula ORDER BY solo puede especificar un n\u00FAmero de columna.

# Arguments:
#
#    {0} = routineName
#    {1} = type
#
42884=No se ha encontrado ninguna rutina autorizada denominada ''{0}'' de tipo ''{1}'' que tenga argumentos compatibles.

# Arguments:
#
#    {0} = parameterMode
#    {1} = parameterName
#
42886=El par\u00E1metro {1} {0} necesita un marcador de par\u00E1metro ''?''.

# Arguments:
#
#    {0} = columnName
#
42894=El valor DEFAULT o el valor del atributo IDENTITY no es v\u00E1lido para la columna ''{0}''.

428C1=S\u00F3lo est\u00E1 permitida una columna de identidad en una tabla.

428EK=El cualificador para un nombre de tabla temporal global declarada debe ser SESSION.

42903=Uso no v\u00E1lido de una funci\u00F3n de agregaci\u00F3n.

42908=La sentencia CREATE VIEW no incluye una lista de columnas.

42909=La sentencia CREATE TABLE no incluye ninguna lista de columnas.

# Arguments:
#
#    {0} = key
#    {1} = detailedReason
#
42915=La clave ajena ''{0}'' no es v\u00E1lida por el siguiente motivo: ''{1}''. 

# Arguments:
#
#    {0} = synonym2
#    {1} = synonym1
#
42916=No se puede crear el sin\u00F3nimo ''{0}'' para ''{1}'' puesto que dar\u00EDa lugar a una cadena de sin\u00F3nimos circular.

# Arguments:
#
#    {0} = schemaNamet
#
42939=No se puede crear un objeto con el nombre de esquema ''{0}''.

# Arguments:
#
#    {0} = authorizationID
#
4293A=No se puede crear un rol con el nombre ''{0}'', el prefijo SYS est\u00E1 reservado.

# Arguments:
#
#    {0} = columnName
#
42962=No se permite el par\u00E1metro ''{0}'' o la columna del tipo long en las definiciones de procedimientos o tablas temporales globales declaradas. 

42995=La funci\u00F3n solicitada no se aplica a tablas temporales globales.

# Arguments:
#
#    {0} = error
#
42X01=Error de sintaxis: {0}.

# Arguments:
#
#    {0} = parserException
#
42X02={0}.

# Arguments:
#
#    {0} = columnName
#
42X03=El nombre de columna ''{0}'' est\u00E1 en m\u00E1s de una tabla de la lista FROM.

# Arguments:
#
#    {0} = columnName
#    {1} = columnName
#
42X04=La columna ''{0}'' no est\u00E1 en ninguna tabla de la lista FROM o aparece en una especificaci\u00F3n de uni\u00F3n y est\u00E1 fuera del \u00E1mbito de la especificaci\u00F3n de uni\u00F3n o bien aparece en una cl\u00E1usula HAVING y no est\u00E1 en la lista GROUP BY. Si se trata de una sentencia CREATE o ALTER TABLE, ''{0}'' no es una columna de la tabla destino.

# Arguments:
#
#    {0} = objectName
#
42X05=La tabla/vista ''{0}'' no existe.

# Arguments:
#
#    {0} = tableName
#
42X06=Se han especificado demasiadas columnas de resultados para la tabla ''{0}''.

42X07=NULL s\u00F3lo est\u00E1 permitido en una cl\u00E1usula VALUES en una sentencia INSERT.

# Arguments:
#
#    {0} = className
#    {1} = constructorName
#
42X08=El constructor para la clase ''{0}'' no se puede utilizar como tabla virtual externa porque la clase no implanta''{1}''. 

# Arguments:
#
#    {0} = tableName
#
42X09=La tabla o nombre de alias ''{0}'' se utiliza m\u00E1s de una vez en la lista FROM.

# Arguments:
#
#    {0} = tableName
#
42X10=''{0}'' no es un nombre de tabla expuesto en el \u00E1mbito en el que aparece.

# Arguments:
#
#    {0} = columnName
#
42X12=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE TABLE. 

# Arguments:
#
#    {0} = columnName
#
42X13=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la lista de columnas de una sentencia INSERT. 

# Arguments:
#
#    {0} = columnName
#    {1} = tableOrVTIName
#
42X14=''{0}'' no es una columna en la tabla o VTI ''{1}''.

# Arguments:
#
#    {0} = columnName
#
42X15=El nombre de columna ''{0}'' aparece en una sentencia sin una lista FROM.

# Arguments:
#
#    {0} = columnName
#
42X16=El nombre de columna ''{0}'' aparece varias veces en la cl\u00E1usula SET de una sentencia UPDATE.

# Arguments:
#
#    {0} = joinOrder
#
42X17=En la lista de propiedades de una cl\u00E1usula FROM, el valor ''{0}'' no es v\u00E1lido como especificaci\u00F3n joinOrder. S\u00F3lo son v\u00E1lidos los valores FIXED y UNFIXED. 

# Arguments:
#
#    {0} = dataType
#
42X19.S.1=La cl\u00E1usula WHERE, WHEN o HAVING o la definici\u00F3n CHECK CONSTRAINT es una expresi\u00F3n ''{0}''. Debe ser una expresi\u00F3n BOOLEAN.

42X19.S.2=La cl\u00E1usula WHERE o HAVING o la definici\u00F3n CHECK CONSTRAINT es una expresi\u00F3n de par\u00E1metro sin tipo. Debe ser una expresi\u00F3n BOOLEAN.

42X20=Error de sintaxis; se esperaba un valor literal entero.

# Arguments:
#
#    {0} = cursorName
#
42X23=El cursor {0} no es actualizable.

# Arguments:
#
#    {0} = columnName
#
42X24=Se hace referencia a la columna {0} en la cl\u00E1usula HAVING pero no en la lista GROUP BY.

# Arguments:
#
#    {0} = functionName
#    {1} = 1
#
42X25=La funci\u00F3n ''{0}'' no est\u00E1 permitida en el tipo ''{1}''.

# Arguments:
#
#    {0} = className
#    {1} = columnName
#
42X26=La clase ''{0}'' para la columna ''{1}'' no existe o no es accesible. Esto puede ocurrir si la clase no es p\u00FAblica.

# Arguments:
#
#    {0} = tableName
#    {1} = cursorName
#
42X28=La supresi\u00F3n de la tabla ''{0}'' no es el destino del cursor ''{1}''.

# Arguments:
#
#    {0} = tableName
#    {1} = cursorName
#
42X29=La actualizaci\u00F3n de la tabla ''{0}'' no es el destino del cursor ''{1}''.

# Arguments:
#
#    {0} = cursorName
#
42X30=No se ha encontrado el cursor ''{0}''. Verifique que la confirmaci\u00F3n autom\u00E1tica est\u00E1 desactivada.

# Arguments:
#
#    {0} = columnName
#    {1} = cursorName
#
42X31=La columna ''{0}'' no est\u00E1 en la lista FOR UPDATE del cursor ''{1}''.

# Arguments:
#
#    {0} = tableName
#
42X32=El n\u00FAmero de columnas en la lista de columnas derivadas debe coincidir con el n\u00FAmero de columnas de la tabla ''{0}''.

# Arguments:
#
#    {0} = columnName
#
42X33=La lista de columnas derivadas contiene un nombre de columna duplicado ''{0}''.

42X34=Hay un par\u00E1metro ? en la lista de selecci\u00F3n. No est\u00E1 permitido.

# Arguments:
#
#    {0} = operatorName
#
42X35=No est\u00E1 permitido que ambos operandos de ''{0}'' sean par\u00E1metros ?.

# Arguments:
#
#    {0} = operatorName
#
42X36=No est\u00E1 permitido que el operador ''{0}'' tome un par\u00E1metro ? como operando.

# Arguments:
#
#    {0} = operatorName
#    {1} = type
#
42X37=El operador unario ''{0}'' no est\u00E1 permitido sobre el tipo ''{1}''.

42X38=''SELECT *'' s\u00F3lo est\u00E1 permitido en subconsultas EXISTS y NOT EXISTS.

42X39=La subconsulta s\u00F3lo puede devolver una sola columna.

42X40=Una sentencia NOT tiene un operando que no es booleano. El operando de NOT se debe evaluar en TRUE, FALSE o UNKNOWN. 

# Arguments:
#
#    {0} = propertyName
#    {1} = propertyValue
#
42X41=En la cl\u00E1usula de propiedades de una lista FROM , la propiedad ''{0}'' no es v\u00E1lida (la propiedad se hab\u00EDa definido como ''{1}''). 

# Arguments:
#
#    {0} = columnName
#
42X42=Nombre de correlaci\u00F3n no permitido para la columna ''{0}'' porque forma parte de la lista FOR UPDATE.

# Arguments:
#
#    {0} = className
#
42X43=El ResultSetMetaData devuelto para la clase/objeto ''{0}'' es nulo. Para poder utilizar esta clase como tabla virtual externa, el valor de ResultSetMetaData no puede ser nulo. 

# Arguments:
#
#    {0} = number
#
42X44=Longitud ''{0}'' no v\u00E1lida en la especificaci\u00F3n de columna.

# Arguments:
#
#    {0} = dataType
#    {1} = argumentNumber
#    {2} = operatorName
#
42X45={0} es un tipo no v\u00E1lido para el n\u00FAmero de argumento {1} de {2}.

# Arguments:
#
#    {0} = functionName
#
42X46=Existen varias funciones denominadas ''{0}''. Utilice la firma completa o el nombre espec\u00EDfico.

# Arguments:
#
#    {0} = procedureName
#
42X47=Existen varios procedimientos denominados ''{0}''. Utilice la firma completa o el nombre espec\u00EDfico.

# Arguments:
#
#    {0} = dataType
#    {1} = number
#
42X48=El valor ''{1}'' no es una precisi\u00F3n v\u00E1lida para {0}.

# Arguments:
#
#    {0} = invalidNumber
#
42X49=El valor ''{0}'' no es un literal entero v\u00E1lido.

# Arguments:
#
#    {0} = className
#    {1} = methodName
#    {2} = parameterTypes
#
42X50=No se ha encontrado ning\u00FAn m\u00E9todo que coincida con la llamada de m\u00E9todo {0}.{1}({2}) despu\u00E9s de probar todas las combinaciones de los tipos de objeto y primitivo y todas las conversiones de tipos posibles de todos los par\u00E1metros que pudiera tener la llamada de m\u00E9todo. El m\u00E9todo puede existir, pero no es p\u00FAblico y/o est\u00E1tico o los tipos de par\u00E1metro no son convertibles por la invocaci\u00F3n del m\u00E9todo.

# Arguments:
#
#    {0} = className
#
42X51=La clase ''{0}'' no existe o es inaccesible. Esto puede ocurrir si la clase no es p\u00FAblica.

# Arguments:
#
#    {0} = methodName
#    {1} = type
#
42X52=No est\u00E1 permitido que el m\u00E9todo de llamada (''{0}'') que utilice un receptor del tipo primitivo de Java ''{1}''.

# Arguments:
#
#    {0} = type
#
42X53=El predicado LIKE s\u00F3lo puede tener los operandos ''CHAR'' o ''VARCHAR''. El tipo ''{0}'' no est\u00E1 permitido.

# Arguments:
#
#    {0} = methodName
#
42X54=El m\u00E9todo Java ''{0}'' tiene ? como receptor. No est\u00E1 permitido.

# Arguments:
#
#    {0} = tableName
#    {1} = tableName
#
42X55=El nombre de tabla ''{1}'' debe ser el mismo que ''{0}''.

# Arguments:
#
#    {0} = viewName
#
42X56=El n\u00FAmero de columnas de la lista de columnas de la vista no coincide con el n\u00FAmero de columnas de la expresi\u00F3n de consulta subyacente en la definici\u00F3n de la vista para ''{0}''.

# Arguments:
#
#    {0} = tableName
#    {1} = number
#
42X57=getColumnCount() de la tabla virtual externa ''{0}'' ha devuelto un valor no v\u00E1lido ''{1}''. Los valores v\u00E1lidos son mayores o iguales que 1. 

# Arguments:
#
#    {0} = tableName
#
42X58=El n\u00FAmero de columnas en los lados izquierdo y derecho de ''{0}'' debe ser el mismo.

42X59=El n\u00FAmero de columnas en cada constructor VALUES debe ser el mismo.

# Arguments:
#
#    {0} = insertMode
#    {1} = tableName
#
42X60=Se ha especificado un valor no v\u00E1lido ''{0}'' para la propiedad insertMode de la tabla ''{1}''.

# Arguments:
#
#    {0} = dataType
#    {1} = dataType
#    {2} = sqlOperator
#
42X61=Los tipos ''{0}'' y ''{1}'' no son compatibles con {2}.

# Arguments:
#
#    {0} = sqlText
#    {1} = schemaName
#
42X62=''{0}'' no est\u00E1 permitido en el esquema ''{1}''.

42X63=La cl\u00E1usula USING a\u00FAn no ha devuelto ning\u00FAn resultado. No se pueden definir par\u00E1metros. 

# Arguments:
#
#    {0} = propertyValue
#
42X64=En la lista de propiedades se ha especificado el valor ''{0}'' no v\u00E1lido para la propiedad useStatistics. Los \u00FAnicos valores v\u00E1lidos son TRUE o FALSE. 

# Arguments:
#
#    {0} = index
#
42X65=El \u00EDndice ''{0}'' no existe.

# Arguments:
#
#    {0} = columnName
#
42X66=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE INDEX.

# Arguments:
#
#    {0} = fieldName
#    {1} = className
#
42X68=No se ha encontrado ning\u00FAn campo ''{0}'' que pertenezca a la clase ''{1}''. Puede que el campo exista, pero no es p\u00FAblico o que la clase no exista o no sea p\u00FAblica.

# Arguments:
#
#    {0} = fieldName
#    {1} = type
#
42X69=No est\u00E1 permitido hacer referencia a un campo (''{0}'') utilizando una expresi\u00F3n de referencia del tipo primitivo Java ''{1}''.

# Arguments:
#
#    {0} = tableName
#
42X70=El n\u00FAmero de columnas indicado en la lista de columnas de la tabla no coincide con el n\u00FAmero de columnas de la expresi\u00F3n de consulta asociada a la definici\u00F3n de tabla de ''{0}''.

# Arguments:
#
#    {0} = datatypeName
#    {1} = columnName
#
42X71=Tipo de dato no v\u00E1lido ''{0}'' para la columna ''{1}''.

# Arguments:
#
#    {0} = fieldName
#    {1} = className
#
42X72=No se ha encontrado ning\u00FAn campo est\u00E1tico ''{0}'' que pertenezca a la clase ''{1}''. El campo puede existir, pero no es p\u00FAblico y/o est\u00E1tico o la clase no existe o \u00E9sta no es p\u00FAblica.  

# Arguments:
#
#    {0} = className
#    {1} = methodName
#    {2} = parameterTypes
#
42X73=Resoluci\u00F3n ambigua del m\u00E9todo para la firma {0}.{1}({2}). (No hay un m\u00E9todo espec\u00EDfico que sea m\u00E1s importante).

42X74=Sintaxis de la sentencia CALL no v\u00E1lida.

# Arguments:
#
#    {0} = className
#    {1} = parameterTypes
#
42X75=No se ha encontrado ning\u00FAn constructor con la firma {0}({1}). Puede que los tipos de par\u00E1metro no sean convertibles por la invocaci\u00F3n del m\u00E9todo.

# Arguments:
#
#    {0} = columnName
#
42X76=Al menos una columna ''{0}'' en la clave primaria que se va a agregar es nula. Todas las columnas de una clave primaria no deben se nulas.

# Arguments:
#
#    {0} = columnPosition
#
42X77=La posici\u00F3n de la columna ''{0}'' est\u00E1 fuera del rango de la expresi\u00F3n de consulta.

# Arguments:
#
#    {0} = columnName
#
42X78=La columna ''{0}'' no est\u00E1 en el resultado de la expresi\u00F3n de consulta.

# Arguments:
#
#    {0} = columnName
#
42X79=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en el resultado de la expresi\u00F3n de consulta.

42X80=La cl\u00E1usula VALUES debe contener al menos un elemento. Los elementos vac\u00EDos no est\u00E1n permitidos. 

42X81=Una expresi\u00F3n de consulta debe devolver al menos una columna.

42X82=La cl\u00E1usula USING ha devuelto m\u00E1s de una fila. S\u00F3lo se permiten ResultSets de una sola fila.

# Arguments:
#
#    {0} = index
#    {1} = constraintName
#
42X84=El \u00EDndice ''{0}'' se ha creado para forzar la restricci\u00F3n ''{1}''. S\u00F3lo se puede borrar si se borra la restricci\u00F3n.

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#
42X85=Es necesario que la restricci\u00F3n ''{0}'' est\u00E9 en el mismo esquema que la tabla ''{1}''.

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#
42X86=Error de ALTER TABLE. No existe ninguna restricci\u00F3n ''{0}'' en la tabla ''{1}''. 

42X87=Al menos una expresi\u00F3n de resultado (THEN o ELSE) de la expresi\u00F3n CASE debe tener un tipo conocido.

42X88=Un condicional tiene un operando no booleano. El operando de un condicional debe dar como resultado TRUE, FALSE o UNKNOWN. 

# Arguments:
#
#    {0} = type
#    {1} = type
#
42X89=Los tipos ''{0}'' y ''{1}'' no son compatibles. Ning\u00FAn tipo se puede asignar al otro tipo. 

# Arguments:
#
#    {0} = tableName
#
42X90=Se ha especificado m\u00E1s de una restricci\u00F3n de clave primaria para la tabla ''{0}''.

# Arguments:
#
#    {0} = constraintName
#
42X91=El nombre de la restricci\u00F3n ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE TABLE. 

# Arguments:
#
#    {0} = columnName
#
42X92=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en una lista de columnas de la restricci\u00F3n.

# Arguments:
#
#    {0} = tableName
#    {1} = columnName
#
42X93=La tabla ''{0}'' contiene una definici\u00F3n de restricci\u00F3n con la columna ''{1}'' que no est\u00E1 en la tabla.

# Arguments:
#
#    {0} = sqlObjectType
#    {1} = objectName
#
42X94={0} ''{1}'' no existe.

# Arguments:
#
#    {0} = fileName
#
42X96=La classpath de la base de datos contiene un archivo jar ''{0}'' desconocido.

42X97=Caracter\u00EDsticas de la restricci\u00F3n en conflicto para la restricci\u00F3n.

42X98=No se permiten par\u00E1metros en una definici\u00F3n VIEW.

42X99=No se permiten par\u00E1metros en una definici\u00F3n de TABLE.

# Arguments:
#
#    {0} = columnName
#    {1} = datatypeName
#
42XA0=La cl\u00E1usula de generaci\u00F3n de la columna ''{0}'' tiene el tipo de dato ''{1}'', que no se puede asignar al tipo de dato declarado de la columna.

# Arguments:
#
#    {0} = columnName
#
42XA1=La cl\u00E1usula de generaci\u00F3n de la columna ''{0}'' contiene un agregado. No est\u00E1 permitido.

# Arguments:
#
#    {0} = sqlObjectName
#
42XA2=''{0}'' no puede aparecer en una cl\u00E1usula de generaci\u00F3n porque puede devolver resultados no fiables.

# Arguments:
#
#    {0} = columnName
#
42XA3=No se puede sustituir el valor de la columna generada ''{0}''.

# Arguments:
#
#    {0} = columnName
#
42XA4=La cl\u00E1usula de generaci\u00F3n de la columna ''{0}'' hace referencia a otras columnas generadas. No est\u00E1 permitido.

# Arguments:
#
#    {0} = routineName
#
42XA5=La rutina ''{0}'' puede emitir SQL; por lo que no puede aparecer en este contexto.

# Arguments:
#
#    {0} = columnName
#
42XA6=''{0}'' es una columna generada. No puede formar parte de una clave ajena cuya acci\u00F3n referencial para DELETE sea SET NULL o SET DEFAULT o cuya acci\u00F3n referencial para UPDATE sea CASCADE.

# Arguments:
#
#    {0} = columnName
#
42XA7=''{0}'' es una columna generada o de identidad. No puede cambiar su valor por defecto.

# Arguments:
#
#    {0} = columnName
#    {1} = columnName
#
42XA8=No se puede cambiar el nombre de ''{0}'' porque est\u00E1 referenciada por la cl\u00E1usula de generaci\u00F3n de la columna ''{1}''.

# Arguments:
#
#    {0} = columnName
#
42XA9=La columna ''{0}'' necesita un tipo de dato expl\u00EDcito. El tipo de dato se puede omitir s\u00F3lo en columnas con cl\u00E1usulas de generaci\u00F3n.

# Arguments:
#
#    {0} = columnName
#
42XAA=El valor NEW de la columna generada ''{0}'' se menciona en la acci\u00F3n BEFORE de un disparador. No est\u00E1 permitido.

42XAB=NOT NULL s\u00F3lo est\u00E1 permitido si se declara de forma expl\u00EDcita un tipo de dato.

42XAC=El valor ''INCREMENT BY'' no puede ser cero.

# Arguments:
#
#    {0} = argName
#    {1} = datatypeName
#    {2} = minValue
#    {3} = maxValue
#
42XAE=El valor ''{0}'' est\u00E1 fuera de rango con respecto al tipo de dato ''{1}''. Debe estar entre ''{2}'' y ''{3}''.

# Arguments:
#
#    {0} = minValue
#    {1} = maxValue
#
42XAF=Valor ''MINVALUE'' ''{0}'' no v\u00E1lido. Debe ser inferior a ''MAXVALUE: {1}''.

# Arguments:
#
#    {0} = startValue
#    {1} = minValue
#    {2} = maxValue
#
42XAG=Valor ''START WITH'' ''{0}'' no v\u00E1lido. Debe estar entre ''{1}'' y ''{2}''.

42XAH=Puede que una expresi\u00F3n NEXT VALUE FOR no aparezca en varios contextos, incluidas las cl\u00E1usulas WHERE, ON, HAVING, ORDER BY, DISTINCT, CASE, GENERATION y AGGREGATE, as\u00ED como en las funciones WINDOW y en las restricciones CHECK.

# Arguments:
#
#    {0} = sequenceName
#
42XAI=La sentencia hace referencia a la siguiente secuencia m\u00E1s de una vez: ''{0}''.

# Arguments:
#
#    {0} = clauseName
#
42XAJ=La sentencia CREATE SEQUENCE contiene la cl\u00E1usula redundante ''{0}''.

42XAK=La tabla de destino de una sentencia MERGE debe ser una tabla base.

42XAL=La tabla de origen de una sentencia MERGE debe ser una tabla base o una funci\u00F3n de tabla.

42XAM=Las tablas de origen y destino de una sentencia MERGE no pueden tener el mismo nombre de correlaci\u00F3n.

42XAN=Caracter\u00EDsticas de restricci\u00F3n no permitidas para NOT NULL.

42XAO=No se permiten las subconsultas en las cl\u00E1usulas WHEN [ NOT ] MATCHED de las sentencias MERGE.

42XAP=No se permiten los sin\u00F3nimos como las tablas de origen o destino de las sentencias MERGE.

42XAQ=Las tablas de origen y destino de las sentencias MERGE no pueden tener listas de columnas derivadas.

42XAR=El operador NEXT VALUE no se puede utilizar en un generador de secuencia propiedad del sistema.

42XBA=El esquema, la tabla o la columna no existe o la columna no es un tipo de cadena.

42XBB=La tabla no tiene ninguna clave primaria.

# Arguments:
#
#    {0} = typeName
#
42XBC=Tipo no soportado por la herramienta opcional Lucene: ''{0}''

# Arguments:
#
#    {0} = invalidCharacter
#
42XBD=Car\u00E1cter no permitido en los identificadores Derby utilizados por la herramienta opcional Lucene: ''{0}''

42XBE=No existe el \u00EDndice de Lucene.

42XBF=El esquema no existe o el usuario actual no es el DBO y no es propietario del esquema.

42XBG=Ya se ha cargado la herramienta Lucene Support.

42XBH=Ya se ha descargado la herramienta Lucene Support.

# Arguments:
#
#    {0} = directoryName
#
42XBI=No se puede borrar ''{0}'' porque no es un directorio.

# Arguments:
#
#    {0} = columnName
#
42XBJ=No se puede crear un \u00EDndice de Lucene que conlleve una columna denominada ''{0}''. Int\u00E9ntelo cambiando el nombre de la columna mediante la declaraci\u00F3n de una vista.

# Arguments:
#
#    {0} = luceneVersion
#    {1} = indexVersion
#
42XBK=La versi\u00F3n actual de Lucene ''{0}'' no puede leer un \u00EDndice creado por la versi\u00F3n de Lucene ''{1}''.

42XBL=Los \u00EDndices de Lucene no se pueden crear en una base de datos cifrada y, del mismo modo, no se puede cifrar una base de datos que contenga un \u00EDndice de Lucene.

# Arguments:
#
#    {0} = argumentName
#
42XBM=El argumento ''{0}'' no puede ser nulo.

# Arguments:
#
#    {0} = fieldName
#
42XBN=Un campo y una clave tienen el mismo nombre: ''{0}''

# Arguments:
#
#    {0} = fieldName
#
42XBO=Nombre de campo duplicado o nulo: ''{0}''

# Arguments:
#
#    {0} = className
#
42Y00=La clase ''{0}'' no implanta org.apache.derby.iapi.db.AggregateDefinition y por tanto no se puede utilizar como una expresi\u00F3n de agregaci\u00F3n.

# Arguments:
#
#    {0} = constraintName
#
42Y01=La restricci\u00F3n ''{0}'' no es v\u00E1lida.

# Arguments:
#
#    {0} = statement
#
42Y03.S.0=''{0}'' no se reconoce como una funci\u00F3n o procedimiento.

# Arguments:
#
#    {0} = statement
#
42Y03.S.1=''{0}'' no se reconoce como un procedimiento.

# Arguments:
#
#    {0} = statement
#
42Y03.S.2=''{0}'' no se reconoce como una funci\u00F3n.

# Arguments:
#
#    {0} = statement
#
42Y03.S.3=''{0}'' es un procedimiento pero se utiliza como funci\u00F3n.

# Arguments:
#
#    {0} = statement
#
42Y03.S.4=''{0}'' es una funci\u00F3n pero se llama como a un procedimiento.

# Arguments:
#
#    {0} = name
#
42Y04=No se puede crear un procedimiento o funci\u00F3n con EXTERNAL NAME ''{0}'' porque no es una lista separada por puntos. El formato esperado es <ruta de acceso java completa>.<nombre de m\u00E9todo>.

# Arguments:
#
#    {0} = key
#
42Y05=No existe una clave ajena denominada ''{0}''.

# Arguments:
#
#    {0} = schemaNamet
#
42Y07=El esquema ''{0}'' no existe.

42Y08=Las restricciones de clave ajena no est\u00E1n permitidas en tablas del sistema.

42Y09=Los m\u00E9todos nulos s\u00F3lo est\u00E1n permitidos en una sentencia CALL.

42Y10=Un constructor de tabla que no est\u00E1 en una sentencia INSERT tiene todos los par\u00E1metros ? en una de sus columnas. En cada columna, al menos una de las filas debe tener un valor que no sea un par\u00E1metro.

# Arguments:
#
#    {0} = clauseName
#
42Y11=Se necesita una especificaci\u00F3n de uni\u00F3n con la cl\u00E1usula ''{0}''.

# Arguments:
#
#    {0} = expressionType
#
42Y12=La cl\u00E1usula ON de JOIN es una expresi\u00F3n ''{0}''. Debe ser una expresi\u00F3n BOOLEAN.

# Arguments:
#
#    {0} = columnName
#
42Y13=El nombre de columna ''{0}'' aparece m\u00E1s de una vez en la sentencia CREATE VIEW.

# Arguments:
#
#    {0} = methodName
#    {1} = className
#
42Y16=No se ha encontrado ning\u00FAn m\u00E9todo est\u00E1tico p\u00FAblico ''{0}'' en la clase ''{1}''. Puede que el m\u00E9todo exista pero que no sea p\u00FAblico ni est\u00E1tico.

# Arguments:
#
#    {0} = aggregateType
#    {1} = type
#
42Y22=La agregaci\u00F3n {0} no puede funcionar en el tipo {1}.

# Arguments:
#
#    {0} = colunmName
#
42Y23=Se ha devuelto una informaci\u00F3n de tipo JDBC incorrecta para la columna {0}.

# Arguments:
#
#    {0} = viewName
#
42Y24=La vista ''{0}'' no se puede actualizar. (Actualmente no se pueden actualizar las vistas.) 

# Arguments:
#
#    {0} = tableName
#
42Y25=''{0}'' es una tabla del sistema. Los usuarios no pueden modificar el contenido de esta tabla.

42Y26.S.0=No est\u00E1n permitidos los agregados en la lista GROUP BY.

42Y26.S.1=No se permiten las subconsultas en la lista GROUP BY.

42Y27=No est\u00E1n permitidos los par\u00E1metros en la acci\u00F3n del disparador.

42Y29=La lista SELECT de una consulta no agrupada contiene al menos una expresi\u00F3n no v\u00E1lida. Cuando la lista SELECT contenga al menos una agregaci\u00F3n, todas las entradas deben ser expresiones de agregaci\u00F3n v\u00E1lidas.

42Y30=La lista SELECT de una consulta agrupada contiene al menos una expresi\u00F3n no v\u00E1lida. Si una lista SELECT tiene un GROUP BY, la lista s\u00F3lo puede contener expresiones de agrupaci\u00F3n v\u00E1lidas y expresiones de agregaci\u00F3n v\u00E1lidas. 

# Arguments:
#
#    {0} = className
#    {1} = aggregateName
#    {2} = type
#
42Y32=La clase de agregador ''{0}'' para la agregaci\u00F3n ''{1}'' en el tipo {2} no implanta org.apache.derby.iapi.sql.execute.ExecAggregator. 

# Arguments:
#
#    {0} = aggregateName
#
42Y33=El agregado {0} contiene uno o m\u00E1s agregados.

# Arguments:
#
#    {0} = columnName
#    {1} = tableName
#
42Y34=El nombre de columna ''{0}'' coincide con m\u00E1s de una columna de resultado en la tabla ''{1}''.

# Arguments:
#
#    {0} = reference
#
42Y35=La referencia de columna ''{0}'' no es v\u00E1lida. Cuando la lista SELECT contenga al menos una agregaci\u00F3n, todas las entradas deben ser expresiones de agregaci\u00F3n v\u00E1lidas. 

# Arguments:
#
#    {0} = reference
#
42Y36=La referencia de columna ''{0}'' no es v\u00E1lida o forma parte de una expresi\u00F3n no v\u00E1lida. Para una lista SELECT con GROUP BY, las columnas y expresiones que se seleccionan s\u00F3lo pueden contener expresiones de agrupaci\u00F3n y de agregado v\u00E1lidas.

# Arguments:
#
#    {0} = javaTypeName
#
42Y37=''{0}'' es un primitivo Java y no se puede utilizar con este operador.

# Arguments:
#
#    {0} = tableName
#
42Y38=insertMode = la sustituci\u00F3n no est\u00E1 permitida en una inserci\u00F3n donde se hace referencia a la tabla destino ''{0}'' en SELECT.

# Arguments:
#
#    {0} = sqlObjectName
#
42Y39=Puede que ''{0}'' no aparezca en una definici\u00F3n CHECK CONSTRAINT porque puede devolver resultados no determinantes.

# Arguments:
#
#    {0} = columnName
#    {1} = triggerName
#
42Y40=''{0}'' aparece varias veces en la lista de columnas UPDATE OF para el disparador ''{1}''.

# Arguments:
#
#    {0} = storedPreparedStatementName
#
42Y41=No se puede llamar directamente a ''{0}'' a trav\u00E9s de EXECUTE STATEMENT porque forma parte de un disparador.

# Arguments:
#
#    {0} = dataType
#    {1} = scaleValue
#
42Y42=La escala ''{1}'' no es una escala v\u00E1lida para un ''{0}''.

# Arguments:
#
#    {0} = scaleValue
#    {1} = precision
#
42Y43=La escala ''{0}'' no es una escala v\u00E1lida con precisi\u00F3n de ''{1}''.

# Arguments:
#
#    {0} = key
#    {1} = key
#
42Y44=Se ha especificado una clave ''{0}'' no v\u00E1lida en la lista de propiedades de una lista FROM. Las claves sensibles a may\u00FAsculas/min\u00FAsculas actualmente soportadas son ''{1}''. 

# Arguments:
#
#    {0} = vtiName
#
42Y45=No se puede enlazar VTI ''{0}'' porque es una VTI de disparador especial y esta sentencia no forma parte de una acci\u00F3n de disparador o cl\u00E1usula WHEN.

# Arguments:
#
#    {0} = index
#    {1} = tableName
#
42Y46=Lista de propiedades no v\u00E1lida en la lista FROM. No existe ning\u00FAn \u00EDndice ''{0}'' en la tabla ''{1}''.

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#
42Y48=Lista de propiedades no v\u00E1lida en lista FROM. No hay ninguna restricci\u00F3n con nombre ''{0}'' en la tabla ''{1}'' o la restricci\u00F3n no tiene un \u00EDndice de copia de seguridad.

# Arguments:
#
#    {0} = key
#
42Y49=Se han especificado varios valores para la clave de propiedad ''{0}''. 

# Arguments:
#
#    {0} = tableName
#
42Y50=La lista de propiedades de la tabla ''{0}'' puede contener valores de \u00EDndice o de restricci\u00F3n, pero no ambos.

# Arguments:
#
#    {0} = sqlText
#    {1} = sqlObjectName
#
42Y55=No se puede realizar ''{0}'' en ''{1}'' porque no existe.

# Arguments:
#
#    {0} = strategyValue
#    {1} = tableName
#
42Y56=Se ha especificado una estrategia de uni\u00F3n ''{0}'' en la lista de propiedades de la tabla ''{1}''. Los valores soportados actualmente para una estrategia de uni\u00F3n son: ''hash'' y ''nestedloop''.

# Arguments:
#
#    {0} = invalidNumber
#    {1} = optimizerOverrideName
#
42Y58=Se ha producido una excepci\u00F3n NumberFormatException al convertir el valor ''{0}'' para la sustituci\u00F3n del optimizador ''{1}''.

# Arguments:
#
#    {0} = invalidNumber
#
42Y59=Valor no v\u00E1lido ''{0}'' especificado para la sustituci\u00F3n hashInitialCapacity. El valor debe ser mayor que 0.

# Arguments:
#
#    {0} = invalidNumber
#
42Y60=Valor no v\u00E1lido ''{0}'' especificado para la sustituci\u00F3n hashLoadFactor. El valor debe ser mayor que 0.0 y menor o igual a 1.0.

# Arguments:
#
#    {0} = invalidNumber
#
42Y61=Valor no v\u00E1lido ''{0}'' especificado para la sustituci\u00F3n de hashMaxCapacity. El valor debe ser mayor que 0.

# Arguments:
#
#    {0} = statement
#    {1} = viewName
#
42Y62=''{0}'' no est\u00E1 permitida en ''{1}'' porque es una vista.

# Arguments:
#
#    {0} = index
#    {1} = tableName
#
42Y63=La uni\u00F3n hash requiere un predicado de uni\u00F3n igualitaria optimizable en una columna del \u00EDndice o pila seleccionado. No existe un predicado de uni\u00F3n igualitaria optimizable en ninguna columna de la tabla o \u00EDndice ''{0}''. Utilice la sustituci\u00F3n del optimizador ''index'' para especificar dicho \u00EDndice o pila en la tabla ''{1}''.

# Arguments:
#
#    {0} = invalidNumber
#
42Y64=El valor bulkFetch de ''{0}'' no es v\u00E1lido. El valor m\u00EDnimo para bulkFetch es 1.

# Arguments:
#
#    {0} = joinType
#
42Y65=bulkFetch no est\u00E1 permitido en uniones ''{0}''.

42Y66=bulkFetch no est\u00E1 permitido en cursores actualizables.

# Arguments:
#
#    {0} = schemaNamet
#
42Y67=El esquema ''{0}'' no se puede borrar.

42Y69=No se ha encontrado un plan de ejecuci\u00F3n v\u00E1lido para esta sentencia. Puede deberse a varios motivos: 1) ha especificado una estrategia de uni\u00F3n hash cuando la uni\u00F3n hash no est\u00E1 permitida (uni\u00F3n igualitaria no optimizable), 2) est\u00E1 intentando unir dos tablas virtuales externas, que se referencian entre ellas, y por tanto no se puede evaluar la sentencia, 3) ha especificado la forma de un plan que el optimizador nunca considerar\u00EDa.

42Y70=El usuario ha especificado una orden de uni\u00F3n no v\u00E1lida. Esto podr\u00EDa estar causado porque se est\u00E1 transfiriendo como par\u00E1metro una columna de uni\u00F3n desde una tabla interna a una tabla virtual externa.

# Arguments:
#
#    {0} = procedureName
#
42Y71=La funci\u00F3n del sistema o el procedimiento ''{0}'' no se puede borrar.

# Arguments:
#
#    {0} = statement
#
42Y82=La sentencia preparada almacenada generada por el sistema ''{0}'' no se puede borrar mediante DROP STATEMENT. Forma parte de un disparador.

# Arguments:
#
#    {0} = aggregateName
#
42Y83=No se permite un NULL sin tipo como argumento del agregado {0}. Convierta el NULL a un tipo adecuado.

# Arguments:
#
#    {0} = sqlText
#
42Y84=''{0}'' no puede aparecer en una definici\u00F3n DEFAULT.

42Y85=La palabra clave DEFAULT s\u00F3lo est\u00E1 permitida en una cl\u00E1usula VALUES cuando la cl\u00E1usula VALUES aparece dentro de una sentencia INSERT.

42Y90=No se permite FOR UPDATE en este tipo de sentencia. 

42Y91=La cl\u00E1usula USING no est\u00E1 permitida en EXECUTE STATEMENT para una acci\u00F3n de disparador.

# Arguments:
#
#    {0} = sqlKeyword
#    {1} = sqlKeyword
#
42Y92=Los disparadores {0} s\u00F3lo pueden hacer referencia a variables/tablas de transici\u00F3n {1}.

42Y93=Cl\u00E1usula REFERENCING no v\u00E1lida: s\u00F3lo se permite un nombre para cada tipo de variable/tabla de transici\u00F3n.

42Y94=Un AND u OR tienen un operando no booleano. Los operandos de AND y OR se deben evaluar como TRUE, FALSE o UNKNOWN. 

# Arguments:
#
#    {0} = operatorName
#    {1} = operandType
#    {2} = operandType
#
42Y95=El operador ''{0}'' con un tipo de operando izquierdo de ''{1}'' y un tipo de operando derecho de ''{2}'' no est\u00E1 soportado.

# Arguments:
#
#    {0} = lineNumber
#    {1} = columnName
#
42Y97=Car\u00E1cter de escape en la l\u00EDnea ''{0}'', columna ''{1}''.

# Arguments:
#
#    {0} = sqlObjectName
#
42Y98=''{0}'' no puede aparecer en este contexto porque podr\u00EDa devolver resultados no fiables.

42Z02=En este momento no est\u00E1n soportados varios agregados DISTINCT.

42Z07=No se permiten agregados en la cl\u00E1usula ON.

# Arguments:
#
#    {0} = tableName
#    {1} = triggerName
#
42Z08=La sustituci\u00F3n mediante inserci\u00F3n en bloque no est\u00E1 permitida en ''{0}'' porque tiene un disparador activado ({1}).

42Z09=No se permiten agregados en la cl\u00E1usula coincidente MERGE.

# Arguments:
#
#    {0} = columnName
#
42Z15=Se ha especificado un tipo no v\u00E1lido para la columna ''{0}''. No se puede cambiar el tipo de una columna. 

42Z16=S\u00F3lo se puede modificar la longitud de las columnas VARCHAR, CLOB y BLOB. 

# Arguments:
#
#    {0} = columnName
#
42Z17=Se ha especificado una longitud no v\u00E1lida para la columna ''{0}''. La longitud debe ser mayor que la longitud de columna actual.

# Arguments:
#
#    {0} = columnName
#    {1} = constraintName
#
42Z18=La columna ''{0}'' forma parte de una restricci\u00F3n de clave ajena ''{1}''. Para modificar la longitud de esta columna, primero debe borrar la restricci\u00F3n, ejecutar ALTER TABLE y volver a crear la restricci\u00F3n.

# Arguments:
#
#    {0} = columnName
#    {1} = constraintName
#
42Z19=Se hace referencia a la columna ''{0}'' por al menos una restricci\u00F3n de clave ajena ''{1}''. Para modificar la longitud de esta columna, debe borrar las restricciones de referencia, ejecutar ALTER TABLE y volver a crear las restricciones.

# Arguments:
#
#    {0} = columnName
#
42Z20=La columna ''{0}'' no se puede convertir en nula. Forma parte de una clave primaria o restricci\u00F3n \u00FAnica, que no puede tener columnas con valores nulos.

# Arguments:
#
#    {0} = columnName
#
42Z20.S.1=La columna ''{0}'' no se puede convertir en nula. Forma parte de una clave primaria, que no puede tener columnas con valores nulos.

# Arguments:
#
#    {0} = columnName
#
42Z21=Se ha especificado un incremento no v\u00E1lido para la identidad de la columna ''{0}''. El incremento no puede ser cero. 

# Arguments:
#
#    {0} = columnName
#
42Z22=Se ha especificado un tipo no v\u00E1lido para la columna de identidad ''{0}''. Los \u00FAnicos tipos v\u00E1lidos para columnas de identidad son BIGINT, INT y SMALLINT.

# Arguments:
#
#    {0} = columnName
#
42Z23=Se ha intentado modificar una columna de identidad ''{0}''. 

# Arguments:
#
#    {0} = tableName
#    {1} = columnName
#
42Z24=Se ha producido un desbordamiento en el valor de identidad de la columna ''{1}'' de la tabla ''{0}''.

42Z25=Error interno de contador de identidad. Se ha llamado a la actualizaci\u00F3n sin argumentos con el valor actual = NULL.

# Arguments:
#
#    {0} = columnName
#
42Z26=Una columna ''{0}'' con un valor por defecto de identidad no se puede convertir en nula.

# Arguments:
#
#    {0} = columnName
#
42Z27=Una columna que acepta valores nulos, ''{0}'', no se puede modificar para que tenga un valor por defecto de identidad.

# Arguments:
#
#    {0} = queryTreeNodeIdentifier
#
42Z50=Error interno: No se ha podido generar el c\u00F3digo para {0}.

# Arguments:
#
#    {0} = number
#
42Z53=Error interno: se desconoce el tipo de activaci\u00F3n que se va a generar para la elecci\u00F3n del nodo {0}.

# Arguments:
#
#    {0} = sqlText
#    {1} = propertyName
#    {2} = propertyValue
#
42Z60=No se permite {0} a menos que la propiedad de base de datos {1} tenga el valor ''{2}''.

42Z70=El enlace directo a un valor XML no est\u00E1 permitido; intente utilizar XMLPARSE.

42Z71=Los valores XML no est\u00E1n permitidos en juegos de resultados de nivel superior; intente utilizar XMLSERIALIZE.

# Arguments:
#
#    {0} = keywords
#    {1} = lineNumber
#    {2} = columnNumber
#
42Z72=Faltan palabras clave de SQL/XML ''{0}'' en la l\u00EDnea {1}, columna {2}.

# Arguments:
#
#    {0} = typeName
#
42Z73=Tipo de destino no v\u00E1lido para XMLSERIALIZE: ''{0}''.

# Arguments:
#
#    {0} = featureName
#
42Z74=Funci\u00F3n XML no soportada: ''{0}''.

42Z75=La expresi\u00F3n de consulta XML debe ser un literal de cadena.

42Z76=No se permiten varios elementos de contexto XML.

# Arguments:
#
#    {0} = dataType
#
42Z77=El elemento de contexto debe ser de tipo ''XML''; ''{0}'' no se permite.

42Z79=No se ha podido determinar el tipo de par\u00E1metro para XMLPARSE; intente utilizar CAST.

# Arguments:
#
#    {0} = className
#
42Z90=La clase ''{0}'' no devuelve un ResultSet actualizable.

# This is a kind of query fragment, which may or may not appear in certain query contexts.
#
42Z91=SELECT

# A transaction isolation level. See http://en.wikipedia.org/wiki/Isolation_%28database_systems%29
#
42Z92=lectura repetible

# Arguments:
#
#    {0} = constraintName
#    {1} = constraintName
#
42Z93=Las restricciones ''{0}'' y ''{1}'' tienen el mismo juego de columnas, lo cual no est\u00E1 permitido. 

# Arguments:
#
#    {0} = columnName
#    {1} = constraintName
#
42Z97=Si se cambia el nombre de la columna ''{0}'' la restricci\u00F3n de comprobaci\u00F3n ''{1}'' se interrumpir\u00E1.

42Z99=El literal hexadecimal o de cadena no puede exceder de 64 K.

# A transaction isolation level. See http://en.wikipedia.org/wiki/Isolation_%28database_systems%29
#
42Z9A=lectura no confirmada

42Z9D.S.1=Los procedimientos que modifican datos SQL no est\u00E1n permitidos en disparadores BEFORE.

# Arguments:
#
#    {0} = statement
#    {1} = triggerName
#
42Z9D=Las sentencias ''{0}'' no est\u00E1n permitidas en disparadores ''{1}''.

# Arguments:
#
#    {0} = constraintName
#    {1} = constraintType
#
42Z9E=La restricci\u00F3n ''{0}'' no es una restricci\u00F3n ''{1}''.

# Arguments:
#
#    {0} = index
#    {1} = tableName
#    {2} = number
#
42Z9F=Demasiados \u00EDndices ({0}) en la tabla {1}. El l\u00EDmite es {2}. 

42ZA0=La sentencia es demasiado compleja. Intente volver a escribir la consulta para eliminar la complejidad. La eliminaci\u00F3n de muchas expresiones duplicadas o la interrupci\u00F3n  de la consulta y el almacenamiento de los resultados temporales en una tabla temporal suele resolver este error.

# Arguments:
#
#    {0} = batch
#
42ZA1=SQL no v\u00E1lido en el lote: ''{0}''.

# Arguments:
#
#    {0} = dataType
#    {1} = collationType
#    {2} = dataType
#    {3} = collationType
#
42ZA2=El operando del predicado LIKE de tipo {0} e intercalaci\u00F3n {1} no es compatible con el patr\u00F3n del operando LIKE de tipo {2} e intercalaci\u00F3n {3}.

# Arguments:
#
#    {0} = collationType
#    {1} = schemaName
#
42ZA3=La tabla tendr\u00E1 el tipo de intercalaci\u00F3n {0}, que es distinto al del esquema {1}, ya que que esta operaci\u00F3n no est\u00E1 soportada.

42ZB1=El estilo de par\u00E1metro DERBY_JDBC_RESULT_SET s\u00F3lo est\u00E1 permitido para funciones de tabla.

42ZB2=Las funciones de tabla s\u00F3lo pueden tener el estilo de par\u00E1metro DERBY_JDBC_RESULT_SET.

42ZB3=XML no se permite como tipo de dato de un agregado definido por el usuario o de una columna devuelta por una funci\u00F3n de tabla.

# Arguments:
#
#    {0} = schemaName
#    {1} = functionName
#
42ZB4=''{0}''.''{1}'' no identifica una funci\u00F3n de tabla.

# Arguments:
#
#    {0} = className
#
42ZB5=La clase ''{0}'' implanta VTICosting, pero no proporciona un constructor sin argumentos p\u00FAblico.

42ZB6=Se espera un valor escalar, no un juego de filas devuelto por una funci\u00F3n de tabla.

# Arguments:
#
#    {0} = columnName
#
42ZB7=VTI o la funci\u00F3n de tabla ha hecho una referencia no v\u00E1lida a la columna ''{0}''.

# Arguments:
#
#    {0} = windowName
#
42ZC0=La ventana ''{0}'' no se ha definido.

42ZC1=S\u00F3lo est\u00E1 soportada una ventana.

# Arguments:
#
#    {0} = clauseName
#
42ZC2=La funci\u00F3n de ventana no es v\u00E1lida en este contexto: cl\u00E1usula ''{0}''

# Arguments:
#
#    {0} = aggregateName
#
42ZC3=Puede que una agregaci\u00F3n definida por el usuario no tenga el nombre de un agregado definido por el est\u00E1ndar SQL o que el nombre de una funci\u00F3n Derby incorporada tenga un argumento: ''{0}''

# Arguments:
#
#    {0} = schemaName
#    {1} = aggregateName
#    {2} = className
#
42ZC4=El agregado definido por el usuario ''{0}''.''{1}'' est\u00E1 enlazado a la clase externa ''{2}''. Los tipos de par\u00E1metro de esa clase no se han podido resolver.

# Arguments:
#
#    {0} = schemaName
#    {1} = aggregateName
#    {2} = javaDataType
#    {3} = javaDataType
#
42ZC6=El agregado definido por el usuario ''{0}''.''{1}'' se ha declarado con este tipo Java de entrada: ''{2}''. Esto no ampl\u00EDa el siguiente tipo Java de entrada delimitador real: ''{3}''.

# Arguments:
#
#    {0} = schemaName
#    {1} = aggregateName
#    {2} = javaDataType
#    {3} = javaDataType
#
42ZC7=El agregado definido por el usuario ''{0}''.''{1}'' se ha declarado con este tipo Java de retorno: ''{2}''. Esto no ampl\u00EDa el siguiente tipo Java de retorno delimitador real: ''{3}''.

# Arguments:
#
#    {0} = className
#    {1} = schemaName
#    {2} = aggregateName
#    {3} = detailedMessage
#
42ZC8=La clase de implantaci\u00F3n ''{0}'' para el agregado definido por el usuario ''{1}''.''{2}'' no se ha podido instanciar o tiene un formato incorrecto. Aparece el siguiente mensaje detallado: {3}

42ZC9=Una rutina de varargs debe tener un estilo de par\u00E1metro DERBY o DERBY_JDBC_RESULT_SET.

42ZCA=El estilo de par\u00E1metro DERBY solo se permite para rutinas de varargs.

42ZCB=Un procedimiento de varargs no puede devolver juegos de resultados.

# Arguments:
#
#    {0} = rowSourceCountInPlan
#    {1} = actualRowSourceCount
#
42ZCC=Sustituci\u00F3n de optimizador incorrecta. Hay {0} or\u00EDgenes de fila en el plan pero deber\u00EDa haber {1}.

42ZCD=Sustituci\u00F3n de optimizador incorrecta. El plan no es un \u00E1rbol de profundidad izquierda.

42ZCE=Sustituci\u00F3n de optimizador incorrecta. No se han resuelto los or\u00EDgenes de fila.

# Arguments:
#
#    {0} = codePage
#    {1} = codePage
#
57017.C=No existe ninguna conversi\u00F3n disponible para la p\u00E1gina de c\u00F3digo de origen, {0}, a la p\u00E1gina de c\u00F3digo de destino, {1}. La conexi\u00F3n se ha terminado.

58009.C.10=Excepci\u00F3n de protocolo de red: s\u00F3lo una longitud de VCM o VCS puede ser mayor que 0. La conexi\u00F3n se ha terminado.

58009.C.11=La conexi\u00F3n se ha terminado porque la codificaci\u00F3n no est\u00E1 soportada.

# Arguments:
#
#    {0} = codePoint
#    {1} = codePoint
#
58009.C.12=Excepci\u00F3n de protocolo de red: el punto de c\u00F3digo real, {0}, no coincide con el punto de c\u00F3digo esperado, {1}. La conexi\u00F3n se ha terminado.

58009.C.13=Excepci\u00F3n de protocolo de red: la recopilaci\u00F3n DDM contiene menos de 4 bytes de datos. La conexi\u00F3n se ha terminado.

58009.C.14=Excepci\u00F3n de protocolo de red: la pila de recopilaci\u00F3n no est\u00E1 vac\u00EDa al final del mismo an\u00E1lisis de cadena de ID. La conexi\u00F3n se ha terminado.

58009.C.15=Excepci\u00F3n de protocolo de red: la longitud de DSS no es 0 al final del mismo an\u00E1lisis de cadena de ID. La conexi\u00F3n se ha terminado.

58009.C.16=Excepci\u00F3n de protocolo de red: DSS encadenado con el mismo ID al final del mismo an\u00E1lisis de cadena de ID. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = number
#
58009.C.17=Excepci\u00F3n de protocolo de red: se ha alcanzado anticipadamente el final del flujo al leer InputStream, par\u00E1metro #{0}. La conexi\u00F3n se ha terminado.

58009.C.18=Excepci\u00F3n de protocolo de red: FDOCA LID no v\u00E1lido. La conexi\u00F3n se ha terminado.

58009.C.19=Excepci\u00F3n de protocolo de red: no se ha devuelto SECTKN. La conexi\u00F3n se ha terminado.

58009.C.20=Excepci\u00F3n de protocolo de red: s\u00F3lo uno de NVCM o NVCS puede ser no nulo. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = length
#
58009.C.21=Excepci\u00F3n de protocolo de red: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBNAM. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = length
#
58009.C.7=Excepci\u00F3n de protocolo de red: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBCOLID. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = length
#
58009.C.8=Excepci\u00F3n de protocolo de red: la longitud de SCLDTA, {0}, no es v\u00E1lida para PKGID. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = length
#    {1} = sqlApplicationManager
#
58009.C.9=Excepci\u00F3n de protocolo de red: la longitud PKGNAMCSN, {0}, no es v\u00E1lida en SQLAM {1}. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = managerCodePoint
#    {1} = level
#
58010.C=Se ha encontrado un error de protocolo de red. No se ha podido establecer una conexi\u00F3n debido a que el gestor {0} en el nivel {1} no est\u00E1 soportado en el servidor. 

# Arguments:
#
#    {0} = distributedDataManagementCommand
#
58014.C=No est\u00E1 soportado el comando DDM 0x{0}. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = distributedDataManagementObject
#
58015.C=No est\u00E1 soportado el objeto DDM 0x{0}. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = distributedDataManagementParameter
#
58016.C=No est\u00E1 soportado el par\u00E1metro DDM 0x{0}. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = distributedDataManagementParameterValue
#
58017.C=No est\u00E1 soportado el valor del par\u00E1metro DDM 0x{0}. Puede que una variable de host de entrada no est\u00E9 en el rango soportado por el servidor. La conexi\u00F3n se ha terminado.

# Arguments:
#
#    {0} = columnName
#
X0A00.S=La lista de selecci\u00F3n menciona la columna ''{0}'' dos veces. Esto no est\u00E1 permitido en consultas con las cl\u00E1usulas GROUP BY o HAVING. Intente crear un alias de una de las columnas en conflicto que sea un nombre \u00FAnico.

# Arguments:
#
#    {0} = tableName
#    {1} = mode
#
X0X02.S=La tabla ''{0}'' no se puede bloquear en modo ''{1}''.

X0X03.S=Estado de transacci\u00F3n no v\u00E1lido: el cursor retenido necesita el mismo nivel de aislamiento

# Arguments:
#
#    {0} = tableName
#
X0X05.S=La tabla/vista ''{0}'' no existe.

# Arguments:
#
#    {0} = fileName
#    {1} = classpath
#
X0X07.S=No se puede eliminar el archivo jar ''{0}'' porque est\u00E1 en derby.database.classpath ''{0}''.

# Arguments:
#
#    {0} = columnArrayLength
#
X0X0D.S=Longitud de matriz de columna no v\u00E1lida ''{0}''. Para devolver claves generadas, la matriz de columna debe ser de longitud 1 y contener solo la columna de identidad.

# Arguments:
#
#    {0} = columnPosition
#    {1} = tableName
#
X0X0E.S=La tabla ''{1}'' no contiene ninguna columna generada autom\u00E1ticamente en la posici\u00F3n de columna ''{0}''.

# Arguments:
#
#    {0} = columnName
#    {1} = tableName
#
X0X0F.S=La tabla ''{1}'' no contiene ninguna columna generada autom\u00E1ticamente denominada ''{0}''.

X0X10.S=La cl\u00E1usula USING ha devuelto m\u00E1s de una fila; solamente se permiten ResultSets de una sola fila.

X0X11.S=La cl\u00E1usula USING no ha devuelto ning\u00FAn resultado, por tanto no se pueden definir par\u00E1metros. 

# Arguments:
#
#    {0} = fileName
#    {1} = schemaNamet
#
X0X13.S=El archivo jar ''{0}'' no existe en el esquema ''{1}''.

# Arguments:
#
#    {0} = type
#
X0X57.S=Se ha realizado un intento de colocar un valor Java de tipo ''{0}'' en un valor SQL, pero no existe el tipo SQL correspondiente. El valor Java es probablemente el resultado de una llamada al m\u00E9todo o acceso de campo.

# Arguments:
#
#    {0} = cursorName
#
X0X60.S=Ya existe un cursor con el nombre ''{0}''.

# Arguments:
#
#    {0} = indexName
#    {1} = schemaName
#    {2} = tableName
#    {3} = rowLocation
#    {4} = columnName
#    {5} = dataValue
#    {6} = dataValue
#    {7} = indexKey
#
X0X61.S=Los valores para la columna ''{4}'' del \u00EDndice ''{0}'' y la tabla ''{1}.{2}'' no coinciden con la ubicaci\u00F3n de fila {3}. El valor del \u00EDndice es ''{5}'', mientras que el valor de la tabla base es ''{6}''. La clave de \u00EDndice completa, incluida la ubicaci\u00F3n de la fila, es ''{7}''. La acci\u00F3n correctiva sugerida es volver a crear el \u00EDndice.

# Arguments:
#
#    {0} = tableName
#    {1} = indexName
#    {2} = rowLocation
#    {3} = indexKey
#
X0X62.S=Se ha encontrado una incoherencia entre la tabla ''{0}'' y el \u00EDndice ''{1}''. Error al intentar recuperar la ubicaci\u00F3n de la fila ''{2}'' de la tabla. La clave de \u00EDndice completa, incluida la ubicaci\u00F3n de la fila, es ''{3}''. La acci\u00F3n correctiva sugerida es volver a crear el \u00EDndice.

# Arguments:
#
#    {0} = exceptionText
#
X0X63.S=Se ha obtenido IOException ''{0}''.

# Arguments:
#
#    {0} = type
#
X0X67.S=Las columnas de tipo ''{0}'' no se pueden utilizar en sentencias CREATE INDEX, ORDER BY, GROUP BY, UNION, INTERSECT, EXCEPT o DISTINCT, porque no est\u00E1n soportadas las comparaciones de ese tipo.

# Arguments:
#
#    {0} = sqlObjectType
#    {1} = sqlObjectName
#
X0X81.S={0} ''{1}'' no existe.

# Arguments:
#
#    {0} = indexName
#    {1} = indexType
#
X0X85.S=No se ha creado el \u00EDndice ''{0}'' porque ''{1}'' no es un tipo de \u00EDndice v\u00E1lido.

X0X86.S=0 es un valor de par\u00E1metro no v\u00E1lido para ResultSet.absolute(int row).

X0X87.S=No se puede llamar a ResultSet.relative(int row) si el cursor no est\u00E1 colocado en una fila.

# Arguments:
#
#    {0} = operationName
#    {1} = objectName
#
X0X95.S=No se puede realizar la operaci\u00F3n ''{0}'' en el objeto ''{1}'' porque existe un ResultSet abierto que depende de ese objeto.

# Arguments:
#
#    {0} = indexName
#
X0X99.S=El \u00EDndice ''{0}'' no existe.

# Arguments:
#
#    {0} = sqlObjectName
#
X0Y16.S=''{0}'' no es una vista. Si es una tabla, utilice en su lugar DROP TABLE.

# Arguments:
#
#    {0} = operationName
#    {1} = objectName
#    {2} = viewName
#
X0Y23.S=No se puede realizar la operaci\u00F3n ''{0}'' en el objeto ''{1}'' porque VIEW ''{2}'' depende de ese objeto.

# Arguments:
#
#    {0} = operationName
#    {1} = objectName
#    {2} = statement
#
X0Y24.S=No se puede realizar la operaci\u00F3n ''{0}'' en el objeto ''{1}'' porque STATEMENT ''{2}'' depende de se objeto.

# Arguments:
#
#    {0} = operationName
#    {1} = sqlObjectName
#    {2} = sqlObjectType
#    {3} = sqlObjectName
#
X0Y25.S=No se puede realizar la operaci\u00F3n ''{0}'' en el objeto ''{1}'' porque {2} ''{3}'' depende de ese objeto.

# Arguments:
#
#    {0} = indexName
#    {1} = tableName
#
X0Y26.S=Es necesario que el \u00EDndice ''{0}'' est\u00E9 en el mismo esquema que la tabla ''{1}''.

# Arguments:
#
#    {0} = indexName
#    {1} = tableName
#
X0Y28.S=No se puede crear el \u00EDndice ''{0}'' en la tabla del sistema ''{1}''. Los usuarios no pueden crear \u00EDndices en tablas del sistema.

# Arguments:
#
#    {0} = operationName
#    {1} = objectName
#    {2} = tableName
#
X0Y29.S=No se puede realizar la operaci\u00F3n ''{0}'' en el objeto ''{1}'' porque TABLE ''{2}'' depende de ese objeto.

# Arguments:
#
#    {0} = operationName
#    {1} = objectName
#    {2} = routineName
#
X0Y30.S=No se puede realizar la operaci\u00F3n ''{0}'' en el objeto ''{1}'' porque ROUTINE ''{2}'' depende de ese objeto.

# Arguments:
#
#    {0} = sqlObjectType
#    {1} = sqlObjectName
#    {2} = sqlObjectType
#    {3} = sqlObjectName
#
X0Y32.S={0} ''{1}'' ya existe en {2} ''{3}''.

# Arguments:
#
#    {0} = indexName
#    {1} = tableName
#
X0Y38.S=No se puede crear el \u00EDndice ''{0}'' porque la tabla ''{1}'' no existe.

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#    {2} = tableName
#
X0Y41.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida porque la tabla a la que hace referencia {1} no tiene una clave primaria. Agregue una clave primaria a {1} o especifique expl\u00EDcitamente las columnas de una restricci\u00F3n \u00FAnica a las que haga referencia esta clave ajena.

# Arguments:
#
#    {0} = constraintName
#
X0Y42.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida: los tipos de las columnas de la clave ajena no coinciden con los tipos de las columnas a las que se hace referencia.

# Arguments:
#
#    {0} = constraintName
#    {1} = number
#    {2} = number
#
X0Y43.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida: el n\u00FAmero de columnas ({1}) no coincide con el n\u00FAmero de columnas de la clave a la que se hace referencia ({2}).

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#
X0Y44.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida: no existe una restricci\u00F3n de clave \u00FAnica o primaria en la tabla ''{1}'' que coincida con el n\u00FAmero y tipos de las columnas de la clave ajena.

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#
X0Y45.S=La restricci\u00F3n de clave ajena ''{0}'' no se puede agregar o activar en la tabla {1} porque una o m\u00E1s claves ajenas no tienen claves de referencia coincidentes. 

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#
X0Y46.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida: la tabla a la que se hace referencia {1} no existe.

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#
X0Y47.S=La restricci\u00F3n ''{0}'' no es v\u00E1lida: la restricci\u00F3n de clave primaria o \u00FAnica en la tabla ''{1}'' es diferible y la acci\u00F3n de referencia es CASCADE o SET NULL.

# Arguments:
#
#    {0} = schemaNamet
#
X0Y54.S=El esquema ''{0}'' no se puede borrar porque no est\u00E1 vac\u00EDo.

# Arguments:
#
#    {0} = indexName
#    {1} = schemaNamet
#    {2} = tableName
#    {3} = number
#    {4} = number
#
X0Y55.S=El n\u00FAmero de filas de la tabla base no coincide con el n\u00FAmero de filas de al menos 1 de los \u00EDndices de la tabla. El \u00EDndice ''{0}'' de la tabla ''{1}.{2}'' tiene {3} filas, pero la tabla base tiene {4} filas. La acci\u00F3n correctiva sugerida es volver a crear el \u00EDndice.

# Arguments:
#
#    {0} = sqlText
#    {1} = tableName
#
X0Y56.S=''{0}'' no se permite en la tabla del sistema ''{1}''.

# Arguments:
#
#    {0} = tableName
#
X0Y57.S=No se puede agregar una columna que no puede ser nula a la tabla ''{0}'' porque la tabla contiene al menos una fila. Las columnas que no pueden ser nulas s\u00F3lo se pueden agregar a tablas vac\u00EDas.

# Arguments:
#
#    {0} = tableName
#
X0Y58.S=Fallo al intentar agregar una restricci\u00F3n de clave primaria en la tabla ''{0}'' porque la tabla ya tiene una restricci\u00F3n de ese tipo. Una tabla s\u00F3lo puede tener una sola restricci\u00F3n de clave primaria.

# Arguments:
#
#    {0} = constraintName
#    {1} = tableName
#    {2} = rowCount
#
X0Y59.S=Fallo al agregar o activar las restricciones en la tabla ''{1}'' porque la tabla contiene {2} filas que violan las siguientes restricciones de comprobaci\u00F3n: {0}.

# Arguments:
#
#    {0} = tableName
#
X0Y63.S=Fallo del comando en la tabla ''{0}'' porque se han encontrado datos nulos en las columnas de clave primaria o restricci\u00F3n/\u00EDndice \u00FAnico. Todas las columnas de una clave primaria o de \u00EDndice \u00FAnico no pueden ser nulas. 

# Arguments:
#
#    {0} = tableName
#
X0Y63.S.1=Fallo del comando en la tabla ''{0}'' porque se han encontrado datos nulos en las columnas de \u00EDndice o clave primaria. Todas las columnas de una clave primaria no deben ser nulas. 

X0Y66.S=No se puede emitir la confirmaci\u00F3n en una conexi\u00F3n anidada si existe una operaci\u00F3n pendiente en la conexi\u00F3n principal.

X0Y67.S=No se puede emitir un rollback en una conexi\u00F3n anidada si existe una operaci\u00F3n pendiente en la conexi\u00F3n principal.

# Arguments:
#
#    {0} = sqlObjectType
#    {1} = sqlObjectName
#
X0Y68.S={0} ''{1}'' ya existe.

# Arguments:
#
#    {0} = triggerName
#
X0Y69.S=DDL no soportado en el disparador {0}.

# Arguments:
#
#    {0} = triggerName
#    {1} = tableName
#
X0Y70.S=No se permite INSERT, UPDATE y DELETE en la tabla {1} porque el disparador {0} est\u00E1 activo.

# Arguments:
#
#    {0} = triggerName
#
X0Y71.S=No se permite la manipulaci\u00F3n de transacciones como SET ISOLATION porque el disparador {0} est\u00E1 activo.

# Arguments:
#
#    {0} = tableName
#    {1} = triggerName
#
X0Y72.S=La sustituci\u00F3n mediante inserci\u00F3n en bloque no est\u00E1 permitida en ''{0}'' porque tiene un disparador activado ({1}).

X0Y77.S=No se puede emitir la definici\u00F3n del nivel de la sentencia de aislamiento en una transacci\u00F3n global que est\u00E1 en curso porque podr\u00EDa haber confirmado de forma impl\u00EDcita la transacci\u00F3n global.

X0Y78.S=No se puede llamar a Statement.executeQuery() con una sentencia que devuelve un recuento de columnas.

# Arguments:
#
#    {0} = javaInterfaceName
#    {1} = javaInterfaceName
#
X0Y78.S.1=No se puede llamar a {0}.executeQuery() porque se han devuelto m\u00FAltiples juegos de resultados. Utilice {1}.execute() para obtener m\u00FAltiples resultados.

# Arguments:
#
#    {0} = javaInterfaceName
#    {1} = javaInterfaceName
#
X0Y78.S.2=Se ha llamado a {0}.executeQuery() pero no se ha devuelto ning\u00FAn juego de resultados. Utilice {1}.executeUpdate() si no se trata de consultas.

X0Y79.S=No se puede llamar a Statement.executeUpdate() con una sentencia que devuelve un ResultSet.

# Arguments:
#
#    {0} = tableName
#    {1} = columnName
#
X0Y80.S=Fallo de la tabla ALTER ''{0}''. Se han encontrado datos nulos en la columna ''{1}''.

# Arguments:
#
#    {0} = rowName
#    {1} = id
#
X0Y83.S=Advertencia: al suprimir una fila de la tabla, no se ha encontrado la fila de \u00EDndice de la fila de la tabla base {0} en el \u00EDndice con el ID de conglomerado {1}. Este problema se ha corregido autom\u00E1ticamente como parte de la operaci\u00F3n de supresi\u00F3n.

# Arguments:
#
#    {0} = sequenceName
#
X0Y84.T=Demasiada contenci\u00F3n en la secuencia {0}. Probablemente se deba a una exploraci\u00F3n no confirmada del cat\u00E1logo SYS.SYSSEQUENCES. No consulte este cat\u00E1logo directamente. Utilice la funci\u00F3n SYSCS_UTIL.SYSCS_PEEK_AT_SEQUENCE para ver el valor actual de un generador de secuencias.

# Arguments:
#
#    {0} = propertyName
#    {1} = className
#
X0Y85.S=La propiedad Derby ''{0}'' identifica una clase que no se puede instanciar: ''{1}''. Consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n.

# Arguments:
#
#    {0} = propertyName
#
X0Y85.S.1=La propiedad Derby ''{0}'' identifica una clase que no se implementa en la interfaz org.apache.derby.catalog.SequencePreallocator.

# Arguments:
#
#    {0} = schemaName
#    {1} = sequenceName
#
X0Y86.S=Derby no ha podido obtener los bloqueos necesarios para liberar los valores asignados previamente, que no se han utilizado para la secuencia ''{0}''.''{1}''. Por lo tanto, puede que aparezcan intervalos no esperados en esta secuencia.

# Arguments:
#
#    {0} = schemaName
#    {1} = aggregateOrFunctionName
#
X0Y87.S=Ya existe una agregaci\u00F3n o una funci\u00F3n con un argumento cuyo nombre es ''{0}''.''{1}''.

# Arguments:
#
#    {0} = toolName
#
X0Y88.S=Herramienta opcional desconocida: ''{0}''

# Arguments:
#
#    {0} = className
#
X0Y88.S.1=La clase ''{0}'' no implementa la interfaz org.apache.derby.iapi.sql.dictionary.OptionalTool.

X0Y89.S=Se han transferido argumentos incorrectos a SYSCS_UTIL.SYSCS_REGISTER_TOOL(). Consulte la secci\u00F3n Manual de referencia que describe el procedimiento del sistema.

# Arguments:
#
#    {0} = className
#
X0Y90.S=No se puede crear la instancia de {0}. Es posible que esta clase no est\u00E9 visible en la classpath. Puede que no tenga un constructor de 0 argumentos.

# Arguments:
#
#    {0} = constraintName
#
X0Y91.S=No se puede cambiar el modo de restricci\u00F3n de {0}. No es una restricci\u00F3n diferible.

X0Y92.S=No se pueden cambiar los nombres de las columnas de funciones de tabla.

# Arguments:
#
#    {0} = cacheName
#    {1} = keyValue
#
XBCA0.S=No se puede crear un nuevo objeto con la clave {1} en la cach\u00E9 {0}. El objeto ya existe en la cach\u00E9. 

# Arguments:
#
#    {0} = className
#
XBCM1.S=Error de enlace Java generado durante la carga de la clase generada {0}.

# Arguments:
#
#    {0} = className
#
XBCM2.S=No se puede crear una instancia de la clase generada {0}.

# Arguments:
#
#    {0} = className
#    {1} = methodName
#
XBCM3.S=El m\u00E9todo {1}() no existe en la clase generada {0}.

# Arguments:
#
#    {0} = className
#    {1} = limitDescriptor
#
XBCM4.S=Se ha excedido el l\u00EDmite o los l\u00EDmites de formato de clase Java: {1} en la clase generada {0}.

XBCX0.S=Excepci\u00F3n del proveedor de cifrado. Consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n.

XBCX1.S=Inicializando cifrado con modo no v\u00E1lido, debe ser CipherFactory.ENCRYPT o CipherFactory.DECRYPT.

# Arguments:
#
#    {0} = number
#
XBCX2.S=Inicializando cifrado con una contrase\u00F1a de inicio demasiado corta. La contrase\u00F1a debe tener al menos {0} caracteres de longitud.  

XBCX5.S=No se puede cambiar la contrase\u00F1a de inicio a nula.

XBCX6.S=No se puede cambiar la contrase\u00F1a de inicio a un tipo serializable que no es de cadena.

XBCX7.S=Formato incorrecto para cambiar la contrase\u00F1a de inicio. El formato debe ser: contrase\u00F1a_inicio_anterior, contrase\u00F1a_inicio_nueva.

XBCX8.S=No se puede cambiar la contrase\u00F1a de inicio de una base de datos no cifrada.

XBCX9.S=No se puede cambiar la contrase\u00F1a de inicio de una base de datos de s\u00F3lo lectura. 

XBCXA.S=Contrase\u00F1a de inicio incorrecta.

# Arguments:
#
#    {0} = paddingDirective
#
XBCXB.S=Relleno de cifrado ''{0}'' incorrecto o no se ha especificado relleno. Se debe utilizar ''NoPadding''.

# Arguments:
#
#    {0} = algorithmName
#    {1} = providerName
#
XBCXC.S=El algoritmo de cifrado ''{0}'' no existe. Compruebe que el proveedor ''{1}'' seleccionado soporta este algoritmo.

XBCXD.S=El algoritmo de cifrado no se puede cambiar despu\u00E9s de crear la base de datos.

XBCXE.S=El proveedor de cifrado no se puede cambiar despu\u00E9s de crear la base de datos.

# Arguments:
#
#    {0} = className
#
XBCXF.S=No se ha encontrado la clase ''{0}'' que representa el proveedor de cifrado.

# Arguments:
#
#    {0} = className
#
XBCXF.S.1=La clase ''{0}'' no implementa la interfaz java.security.Provider.

# Arguments:
#
#    {0} = providerName
#
XBCXG.S=El proveedor de cifrado ''{0}'' no existe.

# Arguments:
#
#    {0} = algorithmName
#
XBCXH.S=encryptionAlgorithm ''{0}'' no tiene el formato correcto. El formato correcto es algoritmo/modo_comentarios/NoPadding.

# Arguments:
#
#    {0} = mode
#
XBCXI.S=El modo de comentarios ''{0}'' no est\u00E1 soportada. Los modos de comentarios soportados son CBC, CFB, OFB y ECB.

XBCXJ.S=La aplicaci\u00F3n est\u00E1 utilizando una versi\u00F3n de JCE (Java Cryptography Extension) anterior a la 1.2.1. Actualice a JCE 1.2.1 y vuelva a intentar la operaci\u00F3n.  

XBCXK.S=La clave de cifrado proporcionada no coincide con la clave de cifrado utilizada al crear la base de datos. Aseg\u00FArese de utilizar la clave de cifrado correcta y vuelva a intentarlo. 

XBCXL.S=El proceso de verificaci\u00F3n para la clave de cifrado no se ha realizado correctamente. Esto puede estar causado por un error al acceder al archivo adecuado para realizar el proceso de verificaci\u00F3n. Consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n. 

XBCXM.S=La longitud de la clave de cifrado externa debe ser un n\u00FAmero par.

XBCXN.S=La clave de cifrado externa contiene uno o m\u00E1s caracteres no permitidos. Los caracteres permitidos para un n\u00FAmero hexadecimal son 0-9, a-f y A-F.

XBCXO.S=No se puede cifrar, volver a cifrar o descifrar la base de datos cuando existe una transacci\u00F3n global con estado preparado.

XBCXQ.S=No se puede cifrar, volver a cifrar o descifrar una base de datos de solo lectura.

XBCXS.S=No se puede cifrar, volver a cifrar o descifrar una base de datos cuando est\u00E1 en modo archive log.

# Arguments:
#
#    {0} = failureMessage
#
XBCXU.S=Error al cifrar, volver a cifrar o descifrar una base de datos: {0}

# Arguments:
#
#    {0} = algorithmName
#
XBCXW.S=El algoritmo de resumen de mensajes ''{0}'' no est\u00E1 soportado en ninguno de los proveedores de criptograf\u00EDa disponibles. Instale un proveedor de criptograf\u00EDa que soporte ese algoritmo o  especifique otro algoritmo en la propiedad derby.authentication.builtin.algorithm.

XBM01.D=Fallo en el inicio debido a una excepci\u00F3n. Consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n. 

# Arguments:
#
#    {0} = moduleName
#
XBM02.D=Error de inicio porque falta una funci\u00F3n para {0}. Aseg\u00FArese de que la classpath incluya el software de Derby correcto.

# Arguments:
#
#    {0} = productName
#
XBM05.D=Error de inicio porque falta informaci\u00F3n sobre la versi\u00F3n del producto para {0}.

XBM06.D=Error de inicio. No se puede acceder a una base de datos cifrada sin la contrase\u00F1a de inicio correcta. 

XBM07.D=Error de inicio. La contrase\u00F1a de inicio debe tener al menos 8 bytes de longitud.

# Arguments:
#
#    {0} = subSubProtocol
#    {1} = className
#
XBM08.D=No se ha podido instanciar la clase StorageFactory {1} de {0}.

# Arguments:
#
#    {0} = directoryName
#    {1} = servicePropertiesName
#
XBM0A.D=El directorio de base de datos ''{0}'' existe. Sin embargo, no contiene el archivo ''{1}''. Es posible que Derby haya ca\u00EDdo durante el proceso de creaci\u00F3n de esta base de datos. Puede que desee suprimir este directorio e intentar volver a crear la base de datos.

# Arguments:
#
#    {0} = errorMessage
#
XBM0B.D=Fallo al escribir/editar el archivo de propiedades de servicio: {0}

# Arguments:
#
#    {0} = operation
#    {1} = path
#    {2} = errorMessage
#
XBM0C.D=Falta el privilegio para la operaci\u00F3n ''{0}'' en el archivo ''{1}'': {2}

XBM0G.D=Fallo al iniciar el motor de cifrado. Aseg\u00FArese de que est\u00E1 ejecutando Java 2 y que ha descargado un proveedor de cifrado como jce y lo ha ubicado en la classpath.

# Arguments:
#
#    {0} = directoryName
#
XBM0H.D=No se puede crear el directorio {0}.

# Arguments:
#
#    {0} = directoryName
#
XBM0I.D=No se puede eliminar el directorio {0}.

# Arguments:
#
#    {0} = directoryName
#
XBM0J.D=El directorio {0} ya existe.

# Arguments:
#
#    {0} = databaseName
#
XBM0K.D=Subprotocolo desconocido para el nombre de base de datos {0}.

# Arguments:
#
#    {0} = className
#    {1} = interfaceName
#
XBM0L.D=La clase de esquema de autenticaci\u00F3n especificada {0} implanta la interfaz de autenticaci\u00F3n {1}.

# Arguments:
#
#    {0} = className
#    {1} = detail
#
XBM0M.D=Error al crear una instancia de una clase denominada ''{0}''. Este nombre de clase era el valor de la propiedad derby.authentication.provider y se esperaba que fuese el nombre de una implantaci\u00F3n proporcionada por la aplicaci\u00F3n de org.apache.derby.authentication.UserAuthenticator. El problema subyacente fue: {1}

XBM0N.D=No se ha podido registrar el controlador JDBC con java.sql.DriverManager. Consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n. 

XBM0P.D=El proveedor de servicio es de s\u00F3lo lectura. Operaci\u00F3n no permitida. 

# Arguments:
#
#    {0} = fileName
#
XBM0Q.D=No se ha encontrado el archivo {0}. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrupta.

# Arguments:
#
#    {0} = fileName
#
XBM0R.D=No se ha podido eliminar el archivo {0}.  

# Arguments:
#
#    {0} = fileName
#    {1} = fileName
#
XBM0S.D=No se ha podido cambiar el nombre del archivo ''{0}'' a ''{1}''

# Arguments:
#
#    {0} = databaseName
#
XBM0T.D=Subprotocolo ambiguo para el nombre de base de datos {0}.  

# Arguments:
#
#    {0} = identifierName
#
XBM0U.S=No se han registrado clases para el identificador {0}.

# Arguments:
#
#    {0} = identifierName
#    {1} = className
#
XBM0V.S=Se ha generado una excepci\u00F3n al cargar la clase {1} registrada para el identificador {0}.

# Arguments:
#
#    {0} = identifierName
#    {1} = className
#
XBM0W.S=Se ha generado una excepci\u00F3n al crear una instancia de la clase {1} registrada para el identificador {0}.

# Arguments:
#
#    {0} = localeID
#
XBM0X.D=La descripci\u00F3n de configuraci\u00F3n regional suministrada ''{0}'' no es v\u00E1lida, se esperaba ln[_CO[_variante]]\nln=c\u00F3digo de idioma ISO-639 de dos letras en min\u00FAsculas, CO=c\u00F3digo de pa\u00EDs ISO-3166 de dos letras en may\u00FAsculas, consulte java.util.Locale.

# Arguments:
#
#    {0} = collationName
#
XBM03.D=El valor proporcionado ''{0}'' como atributo de intercalaci\u00F3n no es v\u00E1lido. Se esperaba UCS_BASIC o TERRITORY_BASED.

# Arguments:
#
#    {0} = localeName
#
XBM04.D=El soporte de intercalaci\u00F3n no est\u00E1 disponible de JVM para la configuraci\u00F3n regional de la base de datos ''{0}''.

# Arguments:
#
#    {0} = directoryName
#
XBM0Y.D=No se ha encontrado el directorio de copia de seguridad de base de datos {0}. Aseg\u00FArese de que la ruta de acceso de copia de seguridad especificada es la correcta.

# Arguments:
#
#    {0} = fileName
#    {1} = fileName
#
XBM0Z.D=No se ha podido copiar el archivo ''{0}'' en ''{1}''. Aseg\u00FArese de que haya suficiente espacio y que los permisos son los correctos. 

XBDA0.C.1=Se ha excedido el timeout de conexi\u00F3n.

# Arguments:
#
#    {0} = operationName
#
XCL01.S=El juego de resultados no devuelve filas. Operaci\u00F3n {0} no permitida. 

# Arguments:
#
#    {0} = operationName
#
XCL05.S=Activaci\u00F3n cerrada, operaci\u00F3n {0} no permitida.

# Arguments:
#
#    {0} = cursorName
#
XCL07.S=El cursor ''{0}'' est\u00E1 cerrado. Verifique que la confirmaci\u00F3n autom\u00E1tica est\u00E9 desactivada.

# Arguments:
#
#    {0} = cursorName
#
XCL08.S=El cursor ''{0}'' no est\u00E1 en una fila.

# Arguments:
#
#    {0} = methodName
#
XCL09.S=Se ha transferido una activaci\u00F3n al m\u00E9todo ''{0}'' que no coincide con PreparedStatement.

XCL10.S=Se ha realizado una nueva compilaci\u00F3n de PreparedStatement y los par\u00E1metros han cambiado. Si utiliza JDBC debe volver a preparar la sentencia. 

# Arguments:
#
#    {0} = datatypeName
#    {1} = datatypeName
#
XCL12.S=Se ha intentado ubicar un valor de datos de tipo ''{0}'' en un valor de datos de tipo ''{1}''.

# Arguments:
#
#    {0} = parameterPosition
#    {1} = number
#
XCL13.S=La posici\u00F3n del par\u00E1metro ''{0}'' est\u00E1 fuera de rango. El n\u00FAmero de par\u00E1metros de esta sentencia preparada es ''{1}''.

# Arguments:
#
#    {0} = columnPosition
#    {1} = number
#
XCL14.S=La posici\u00F3n de la columna ''{0}'' est\u00E1 fuera de rango. El n\u00FAmero de columnas de esta sentencia ResultSet es ''{1}''.

# Arguments:
#
#    {0} = object
#    {1} = className
#
XCL15.S=Se ha producido una ClassCastException al llamar al m\u00E9todo compareTo() sobre un objeto ''{0}''. El par\u00E1metro para compareTo() es de clase ''{1}''.

# Arguments:
#
#    {0} = operation
#
XCL16.S=ResultSet no se ha abierto. La operaci\u00F3n ''{0}'' no est\u00E1 permitida. Verifique que la confirmaci\u00F3n autom\u00E1tica est\u00E9 desactivada.

XCL18.S=El valor LOB o flujo no se puede recuperar m\u00E1s de una vez

# Arguments:
#
#    {0} = tableName
#    {1} = key
#
XCL19.S=Falta una fila en la tabla ''{0}'' para la clave ''{1}''.

# Arguments:
#
#    {0} = versionNumber
#    {1} = versionNumber
#
XCL20.S=Los cat\u00E1logos del nivel de versi\u00F3n ''{0}'' no se pueden actualizar al nivel de versi\u00F3n ''{1}''.

XCL21.S=Est\u00E1 intentando ejecutar una sentencia de definici\u00F3n de datos (CREATE, DROP o ALTER) mientras prepara una sentencia diferente. Esta acci\u00F3n no est\u00E1 permitida. Puede que se ejecute una sentencia de definici\u00F3n de datos desde un inicializador est\u00E1tico de una clase Java que se est\u00E1 utilizando desde una sentencia SQL.

# Arguments:
#
#    {0} = parameterName
#
XCL22.S=No se puede registrar el par\u00E1metro ''{0}'' como un par\u00E1metro OUT porque es un par\u00E1metro IN. 

# Arguments:
#
#    {0} = type
#
XCL23.S=El n\u00FAmero de tipo SQL ''{0}'' no es un tipo soportado por registerOutParameter().

# Arguments:
#
#    {0} = parameterName
#    {1} = type
#
XCL24.S=El par\u00E1metro {0} parece un par\u00E1metro de salida, pero no ha sido designado de esa forma por registerOutParameter(). Si no es un par\u00E1metro de salida, se debe definir como del tipo {1}.

# Arguments:
#
#    {0} = parameterName
#    {1} = type
#    {2} = type
#
XCL25.S=El par\u00E1metro {0} no se puede registrar como tipo {1} porque se asigna al tipo {2} y son incompatibles.

# Arguments:
#
#    {0} = parameterName
#
XCL26.S=El par\u00E1metro {0} no es un par\u00E1metro de salida.

XCL27.S=No se pueden definir los par\u00E1metros de salida.

# Arguments:
#
#    {0} = dataType
#
XCL30.S=Se ha generado IOException al leer ''{0}'' de InputStream.

XCL31.S=Sentencia cerrada.

# Arguments:
#
#    {0} = tableName
#
XCL33.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de reglas de supresi\u00F3n. (La relaci\u00F3n es de autorreferencia y ya existe una relaci\u00F3n de autorreferencia con la norma de supresi\u00F3n SET NULL). 

# Arguments:
#
#    {0} = tableName
#
XCL34.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de reglas de supresi\u00F3n. (La relaci\u00F3n forma un ciclo de dos o m\u00E1s tablas que hacen que la tabla est\u00E9 conectada para suprimirse a s\u00ED misma (todas las otras normas de supresi\u00F3n en el ciclo deber\u00EDan ser CASCADE)). 

# Arguments:
#
#    {0} = tableName
#
XCL35.S=No se puede definir la tabla como dependiente de la tabla {0} debido a restricciones de reglas de supresi\u00F3n. (La relaci\u00F3n hace que la tabla sea conectada para suprimir con la tabla indicada a trav\u00E9s de varias relaciones y la norma de supresi\u00F3n de la relaci\u00F3n existente es SET NULL.). 

# Arguments:
#
#    {0} = sqlText
#
XCL36.S=La regla de supresi\u00F3n de la clave ajena debe ser {0}. (La restricci\u00F3n de referencia es de autorreferencia y una restricci\u00F3n de autorreferencia tiene la regla de supresi\u00F3n indicada (NO ACTION, RESTRICT o CASCADE)).

# Arguments:
#
#    {0} = sqlText
#
XCL37.S=La regla de supresi\u00F3n de la clave ajena debe ser {0}. (La restricci\u00F3n de referencia es de autorreferencia y la tabla es dependiente en una relaci\u00F3n con una regla de supresi\u00F3n de CASCADE).

# Arguments:
#
#    {0} = ruleName
#
XCL38.S=La regla de supresi\u00F3n de la clave ajena debe ser {0}. (La relaci\u00F3n har\u00EDa que la tabla estuviera conectada para supresi\u00F3n a la misma tabla a trav\u00E9s de distintas relaciones y dichas relaciones deben tener la misma regla de supresi\u00F3n (NO ACTION, RESTRICT o CASCADE)). 

XCL39.S=La regla de supresi\u00F3n de la clave ajena no puede ser CASCADE. (Existe una restricci\u00F3n de autorreferencia con una regla de supresi\u00F3n de SET NULL, NO ACTION o RESTRICT). 

XCL40.S=La regla de supresi\u00F3n de la clave ajena no puede ser CASCADE. (La relaci\u00F3n formar\u00EDa un ciclo que har\u00EDa que una tabla pudiera estar conectada para supresi\u00F3n consigo misma. Una de las reglas de supresi\u00F3n existentes en el ciclo no es CASCADE, de forma que se puede definir esta relaci\u00F3n si la regla de supresi\u00F3n no es CASCADE). 

XCL41.S=La regla de supresi\u00F3n de la clave ajena no puede ser CASCADE. (La relaci\u00F3n har\u00EDa que otra tabla estuviera conectada para suprimir con la misma tabla a trav\u00E9s de distintas v\u00EDas con distintas reglas de supresi\u00F3n o con reglas de supresi\u00F3n iguales a SET NULL). 

# Arguments:
#
#    {0} = sqlText
#    {1} = versionNumber
#    {2} = versionNumber
#
XCL47.S=El uso de ''{0}'' necesita que se actualice la base de datos de la versi\u00F3n {1} a la versi\u00F3n {2} o posterior.

# Arguments:
#
#    {0} = tableName
#
XCL48.S= No se permite TRUNCATE TABLE en ''{0}'' porque las restricciones de clave ajenas de otras tablas hacen referencia a las restricciones de clave primaria/\u00FAnica de esta tabla. 

# Arguments:
#
#    {0} = tableName
#    {1} = triggerName
#
XCL49.S= No se permite TRUNCATE TABLE en ''{0}'' porque tiene activado un disparador DELETE ({1}).

# Arguments:
#
#    {0} = versionNumber
#    {1} = versionNumber
#
XCL50.S=No est\u00E1 soportada una actualizaci\u00F3n de base de datos de una versi\u00F3n anterior. La base de datos a la que se accede est\u00E1 al nivel de versi\u00F3n ''{0}'', este software est\u00E1 al nivel de versi\u00F3n ''{1}''.  

XCL51.S=La funci\u00F3n solicitada no puede hacer referencia a tablas en el esquema SESSION.

XCL52.S=La sentencia se ha cancelado o se ha producido un timeout.

# Arguments:
#
#    {0} = versionID
#    {1} = versionID
#
XCW00.D=Actualizaci\u00F3n no soportada de ''{0}'' a ''{1}''.

XCXA0.S=Identificador no v\u00E1lido.

# Arguments:
#
#    {0} = classpath
#
XCXB0.S=Classpath de base de datos no v\u00E1lida: ''{0}''.

XCXC0.S=Lista de ID no v\u00E1lida.

XCXE0.S=Est\u00E1 intentando realizar una operaci\u00F3n que utiliza la configuraci\u00F3n regional de la base de datos, pero la base de datos no tiene una configuraci\u00F3n regional.

# Arguments:
#
#    {0} = propertyName
#    {1} = propertyValue
#
XCY00.S=Valor no v\u00E1lido para la propiedad ''{0}''=''{1}''.

# Arguments:
#
#    {0} = propertyName
#    {1} = propertyValue
#
XCY02.S=El cambio de propiedad solicitado no est\u00E1 soportado ''{0}''=''{1}''.

# Arguments:
#
#    {0} = propertyName
#
XCY03.S=La propiedad necesaria ''{0}'' no se ha definido.

XCY04.S=Sintaxis no v\u00E1lida para los modificadores de optimizador. La sintaxis debe ser -- DERBY-PROPERTIES propertyName = valor [, propertyName = valor]*

XCY05.S.2=Valor no v\u00E1lido de la propiedad derby.authentication.provider. Esta propiedad ya se ha definido para activar la autenticaci\u00F3n NATIVE y no se puede cambiar.

XCY05.S.3=Valor no v\u00E1lido de la propiedad derby.authentication.provider. Para activar la autenticaci\u00F3n NATIVE, utilice el procedimiento SYSCS_UTIL.SYSCS_CREATE_USER a fin de almacenar credenciales para el propietario de la base de datos.

# Arguments:
#
#    {0} = permissionName
#
XCZ00.S=Permiso ''{0}'' desconocido.

# Arguments:
#
#    {0} = authorizationID
#
XCZ01.S=Usuario ''{0}'' desconocido.

# Arguments:
#
#    {0} = propertyName
#    {1} = propertyValue
#
XCZ02.S=Par\u00E1metro ''{0}''=''{1}'' no v\u00E1lido.

XD004.S=No se han podido almacenar las dependencias.

XIE01.S=Conexi\u00F3n nula.

# Arguments:
#
#    {0} = lineNumber
#    {1} = columnName
#
XIE03.S=Se han encontrado datos en la l\u00EDnea {0} de la columna {1} despu\u00E9s del delimitador de parada. 

# Arguments:
#
#    {0} = fileName
#
XIE04.S=No se ha encontrado el archivo de datos: {0}

XIE05.S=El archivo de datos no puede ser nulo. 

XIE06.S=Nombre de entidad nulo.

XIE07.S=Los separadores de campo y registro no pueden ser subcadenas uno de otro. 

# Arguments:
#
#    {0} = columnName
#
XIE08.S=No existe una columna denominada: {0}. 

# Arguments:
#
#    {0} = number
#
XIE09.S=El n\u00FAmero total de columnas en la fila es: {0}. 

# Arguments:
#
#    {0} = columnName
#    {1} = type
#
XIE0B.S=La columna {0} de la tabla de tipo {1}, no est\u00E1 soportada por la funci\u00F3n de importaci\u00F3n/exportaci\u00F3n.  

# Arguments:
#
#    {0} = lineNumber
#
XIE0D.S=No se ha encontrado el separador de registro en la l\u00EDnea {0}.

# Arguments:
#
#    {0} = lineNumber
#
XIE0E.S=Se ha le\u00EDdo un fin de archivo en un lugar inesperado de la l\u00EDnea {0}.

XIE0I.S=Se ha producido una excepci\u00F3n de E/S al escribir datos en el archivo.

XIE0J.S=Un delimitador no es v\u00E1lido o se ha utilizado m\u00E1s de una vez.

XIE0K.S=El punto se ha especificado como un delimitador de cadena de caracteres.

# Arguments:
#
#    {0} = tableName
#
XIE0M.S=La tabla ''{0}'' no existe. 

# Arguments:
#
#    {0} = hexString
#
XIE0N.S=Se ha detectado una cadena hexadecimal no v\u00E1lida, ''{0}'', en el archivo de importaci\u00F3n.

# Arguments:
#
#    {0} = fileName
#
XIE0P.S=No se ha encontrado el archivo de datos LOB {0} al que se hace referencia en el archivo de importaci\u00F3n.

XIE0Q.S=El nombre del archivo de datos LOB no puede se nulo. 

# Arguments:
#
#    {0} = lineNumber
#    {1} = fileName
#    {2} = details
#
XIE0R.S=Error de importaci\u00F3n en la l\u00EDnea {0} del archivo {1}: {2} 

# Arguments:
#
#    {0} = fileName
#
XIE0S.S=No se ha realizado la operaci\u00F3n de exportaci\u00F3n porque ya existe el archivo de salida especificado ({0}). Como medida de seguridad, y para evitar posibles da\u00F1os a los archivos, el proceso de exportaci\u00F3n no sustituir\u00E1 ninguno de los archivos existentes aunque tenga permiso para escribir en ellos. Por favor, cambie el nombre del archivo de salida en los argumentos del procedimiento de exportaci\u00F3n para indicar un archivo que no exista, o bien borre el archivo existente y vuelva a intentar la operaci\u00F3n de exportaci\u00F3n.

# Arguments:
#
#    {0} = fileName
#
XIE0T.S=No se ha realizado la operaci\u00F3n de exportaci\u00F3n porque ya existe el archivo auxiliar de objetos grandes especificado ({0}). Como medida de seguridad, y para posibles da\u00F1os a los archivos, el proceso de exportaci\u00F3n no sustituir\u00E1 ninguno de los archivos existentes aunque tenga permiso para escribir en ellos. Por favor, cambie el nombre del archivo auxiliar de objetos grandes en los argumentos del procedimiento de exportaci\u00F3n para indicar un archivo que no exista, o bien borre el archivo existente y vuelva a intentar la operaci\u00F3n de exportaci\u00F3n.

# Arguments:
#
#    {0} = databaseName
#
XJ004.C=No se ha encontrado la base de datos ''{0}''.

XJ008.S=No se ha podido realizar un rollback o liberar un punto de grabaci\u00F3n en modo de confirmaci\u00F3n autom\u00E1tica.

# Arguments:
#
#    {0} = sqlText
#
XJ009.S=Es necesario utilizar CallableStatement con llamadas de procedimientos almacenados o utilizar par\u00E1metros de salida: {0}

XJ010.S=No se puede emitir un SAVEPOINT cuando la validaci\u00F3n autom\u00E1tica est\u00E1 activada.

XJ011.S=No se puede transferir un valor nulo como nombre de SAVEPOINT.

# Arguments:
#
#    {0} = interfaceName
#
XJ012.S=''{0}'' ya est\u00E1 cerrado.

XJ013.S=No hay identificador para los SAVEPOINT con nombre.

XJ014.S=No hay nombre para SAVEPOINT sin nombre.

XJ015.M=Cierre del sistema Derby.

# Arguments:
#
#    {0} = methodName
#
XJ016.S=El m\u00E9todo ''{0}'' no est\u00E1 permitido en una sentencia preparada.

XJ017.S=No se permite el comando de punto de grabaci\u00F3n dentro de un c\u00F3digo de disparador.

XJ018.S=El nombre de columna no puede ser nulo.

# Arguments:
#
#    {0} = typeName
#
XJ020.S=El tipo de objeto no es convertible al tipo ''{0}'', valor java.sql.Types no v\u00E1lido o el objeto es nulo.

XJ021.S=El tipo no est\u00E1 soportado.

# Arguments:
#
#    {0} = name
#
XJ022.S=No se ha podido definir el flujo: ''{0}''.

XJ023.S=El flujo de entrada no conten\u00EDa la cantidad exacta de datos que la longitud solicitada.

XJ025.S=El flujo de entrada no puede tener una longitud negativa.

# Arguments:
#
#    {0} = urlValue
#
XJ028.C=La URL ''{0}'' no tiene el formato correcto.

XJ030.S=No se puede definir la activaci\u00F3n de la confirmaci\u00F3n autom\u00E1tica si est\u00E1 en una conexi\u00F3n anidada.

# Arguments:
#
#    {0} = databaseName
#    {1} = classLoader
#
XJ040.C=No se ha podido iniciar la base de datos ''{0}'' con el cargador de clases {1}, consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n.

# Arguments:
#
#    {0} = databaseName
#
XJ041.C=No se ha podido crear la base de datos ''{0}'', consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n.

# Arguments:
#
#    {0} = propertyValue
#    {1} = propertyName
#
XJ042.S=''{0}'' no es un valor v\u00E1lido para la propiedad ''{1}''.

# Arguments:
#
#    {0} = number
#
XJ044.S=''{0}'' no es una escala v\u00E1lida.

# Arguments:
#
#    {0} = levelName
#
XJ045.S=Se ha pasado a un nivel de aislamiento no v\u00E1lido o no soportado (actualmente), ''{0}'', a Connection.setTransactionIsolation(). Los valores soportados actualmente son java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED y java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.

# Arguments:
#
#    {0} = attributes
#
XJ048.C=Se han especificado atributos de inicio que entran en conflicto: {0}

XJ049.C=Se han especificado atributos de creaci\u00F3n que entran en conflicto.

XJ04B.S=El lote no puede contener un comando que intente devolver un juego de resultados.

XJ04C.S=El lote CallableStatement no puede contener par\u00E1metros de salida.

XJ056.S=No puede definir la activaci\u00F3n de la confirmaci\u00F3n autom\u00E1tica si est\u00E1 en una conexi\u00F3n XA.

XJ057.S=No se puede confirmar una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de confirmaci\u00F3n debe ir a trav\u00E9s de la interfaz XAResource.

XJ058.S=No se puede realizar un rollback de una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de confirmaci\u00F3n debe ir a trav\u00E9s de la interfaz XAResource.

XJ059.S=No se puede cerrar una conexi\u00F3n mientras siga activa una transacci\u00F3n global.

# Arguments:
#
#    {0} = attributeName
#    {1} = attributeValue
#    {2} = attributeValues
#
XJ05B.C=El atributo de JDBC ''{0}'' tiene un valor ''{1}'' no v\u00E1lido, los valores v\u00E1lidos son ''{2}''.

XJ05C.S=No se puede definir la constante de retenci\u00F3n ResultSet.HOLD_CURSORS_OVER_COMMIT para una transacci\u00F3n global.

# Arguments:
#
#    {0} = methodName
#
XJ061.S=El m\u00E9todo ''{0}'' s\u00F3lo est\u00E1 permitido en cursores de desplazamiento.

# Arguments:
#
#    {0} = invalidNumber
#
XJ062.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para ResultSet.setFetchSize(int rows).

# Arguments:
#
#    {0} = invalidNumber
#
XJ063.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxRows(int maxRows). El valor del par\u00E1metro debe ser >= 0.

# Arguments:
#
#    {0} = invalidNumber
#
XJ064.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para setFetchDirection(int direction).

# Arguments:
#
#    {0} = invalidNumber
#
XJ065.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setFetchSize(int rows).

# Arguments:
#
#    {0} = invalidNumber
#
XJ066.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxFieldSize(int max).

XJ067.S=El puntero de texto SQL es nulo.

XJ068.S=S\u00F3lo est\u00E1n permitidos executeBatch y clearBatch en mitad de un lote.

XJ069.S=No se permiten m\u00E9todos SetXXX en el caso de la sentencia de ejecuci\u00F3n USING.

# Arguments:
#
#    {0} = argument
#
XJ070.S=Se ha transferido un argumento de posici\u00F3n negativo o cero ''{0}'' en un m\u00E9todo Blob o Clob.

# Arguments:
#
#    {0} = argument
#
XJ071.S=Se ha transferido un argumento de longitud negativo ''{0}'' en un m\u00E9todo BLOB o CLOB.

XJ072.S=Se ha transferido un patr\u00F3n o searchStr nulo a un m\u00E9todo de posici\u00F3n BLOB o CLOB.

XJ073.S=Los datos de este BLOB o CLOB ya no est\u00E1n disponibles. La transacci\u00F3n de BLOB / CLOB se puede confirmar, su conexi\u00F3n se ha cerrado o se ha liberado.

# Arguments:
#
#    {0} = invalidNumber
#
XJ074.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setQueryTimeout(int seconds).

# Arguments:
#
#    {0} = positionArgument
#
XJ076.S=El argumento de posici\u00F3n ''{0}'' excede el tama\u00F1o del BLOB/CLOB.

XJ077.S=Se ha obtenido una excepci\u00F3n al intentar leer el primer byte/car\u00E1cter del patr\u00F3n BLOB/CLOB mediante getBytes/getSubString.

# Arguments:
#
#    {0} = invalidNumber
#
XJ078.S=El desplazamiento ''{0}'' es inferior a cero o es demasiado grande para el BLOB/CLOB actual.

# Arguments:
#
#    {0} = number
#
XJ079.S=La longitud ''{0}'' especificada excede  el tama\u00F1o del BLOB/CLOB.

# Arguments:
#
#    {0} = number
#    {1} = number
#
XJ080.S=La sentencia de ejecuci\u00F3n USING ha transferido {0} par\u00E1metros en lugar de {1}.

XJ081.C=Se han especificado atributos de creaci\u00F3n/restauraci\u00F3n/recuperaci\u00F3n que entran en conflicto.

# Arguments:
#
#    {0} = parameterValue
#    {1} = parameterName
#    {2} = methodName
#
XJ081.S=Se ha transferido el valor ''{0}'' no v\u00E1lido como par\u00E1metro ''{1}'' al m\u00E9todo ''{2}''

XJ085.S=El flujo ya se ha le\u00EDdo, se ha alcanzado el fin de archivo y no se puede volver a utilizar.

XJ086.S=No se puede llamar a este m\u00E9todo mientras el cursor no est\u00E9 en la fila de inserci\u00F3n o si la simultaneidad de este objeto ResultSet sea CONCUR_READ_ONLY.

# Arguments:
#
#    {0} = pos
#    {1} = length
#
XJ087.S=La suma de la posici\u00F3n(''{0}'') y la longitud(''{1}'') es mayor que el tama\u00F1o del LOB m\u00E1s uno.

XJ088.S=Operaci\u00F3n no v\u00E1lida: se ha llamado a wasNull() sin datos recuperados.

XJ090.S=Par\u00E1metro no v\u00E1lido: el calendario es nulo.

# Arguments:
#
#    {0} = indexNumber
#
XJ091.S=Argumento no v\u00E1lido: el \u00EDndice de par\u00E1metro {0} no es un par\u00E1metro OUT o INOUT.

# Arguments:
#
#    {0} = number
#    {1} = number
#
XJ093.S=La longitud de BLOB/CLOB, {0}, es demasiado grande. La longitud no puede exceder de {1}.

XJ095.S=Fallo al intentar ejecutar una acci\u00F3n con privilegios.

XJ097.S=No se puede realizar un rollback o liberar un punto de grabaci\u00F3n que no haya sido creado por esta conexi\u00F3n.

# Arguments:
#
#    {0} = keyValue
#
XJ098.S=El valor de claves generadas autom\u00E1ticamente {0} no es v\u00E1lido

XJ099.S=El objeto lector/flujo no contiene caracteres de longitud

XJ100.S=La escala proporcionada por el m\u00E9todo registerOutParameter no coincide con el m\u00E9todo setter. Puede que se pierda la precisi\u00F3n.

XJ103.S=El nombre de tabla no puede ser nulo

# Arguments:
#
#    {0} = invalidNumber
#
XJ104.S=La longitud de clave compartida no es v\u00E1lida: {0}.

# Arguments:
#
#    {0} = number
#    {1} = number
#
XJ105.S=La clave DES tiene una longitud incorrecta; longitud esperada {0}, longitud obtenida {1}.

XJ106.S=No existe dicho relleno 

XJ107.S=Relleno incorrecto

XJ108.S=Tama\u00F1o de bloque no v\u00E1lido

XJ110.S=El nombre de tabla primaria no puede ser nulo

XJ111.S=El nombre de tabla ajena no puede ser nulo

XJ112.S=Se ha encontrado una excepci\u00F3n de seguridad, consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n.

# Arguments:
#
#    {0} = fileName
#    {1} = error
#
XJ113.S=No se ha podido abrir el archivo {0} : {1}

# Arguments:
#
#    {0} = cursorName
#
XJ114.S=Nombre de cursor no v\u00E1lido ''{0}''

# Arguments:
#
#    {0} = invalidNumber
#
XJ115.S=No se ha podido abrir resultSet con la capacidad de retenci\u00F3n solicitada {0}.

# Arguments:
#
#    {0} = number
#
XJ116.S=No se pueden agregar m\u00E1s de {0} comandos a un \u00FAnico lote.

XJ117.S=El proceso por lotes de consultas no est\u00E1 permitido seg\u00FAn el cumplimiento con J2EE.

XJ118.S=Se ha solicitado un lote de consultas en una sentencia que no es de consulta.

XJ121.S=Operaci\u00F3n no v\u00E1lida en la posici\u00F3n actual del cursor.

XJ122.S=No se han llamado a m\u00E9todos updateXXX en esta fila.

XJ123.S=Se debe llamar a este m\u00E9todo para actualizar los valores de la fila actual o de la fila de inserci\u00F3n.

XJ124.S=Columna no actualizable.

XJ125.S=S\u00F3lo se debe llamar a este m\u00E9todo en objetos ResultSet que sean desplazables (tipo TYPE_SCROLL_INSENSITIVE).

XJ126.S=No se debe llamar a este m\u00E9todo en cursores din\u00E1micos sensibles.

# Arguments:
#
#    {0} = interfaceName
#
XJ128.S=No se ha podido desajustar para ''{0}''

# Arguments:
#
#    {0} = number
#
XJ200.S=Se ha excedido el n\u00FAmero m\u00E1ximo de secciones {0}

# Arguments:
#
#    {0} = cursorName
#
XJ202.S=Nombre de cursor no v\u00E1lido ''{0}''.

# Arguments:
#
#    {0} = cursorName
#
XJ203.S=El nombre de cursor ''{0}'' ya est\u00E1 en uso

# Arguments:
#
#    {0} = holdValue
#
XJ204.S=No se ha podido abrir el juego de resultados con la capacidad de retenci\u00F3n solicitada {0}.

# Arguments:
#
#    {0} = sqlText
#
XJ206.S=El texto SQL ''{0}'' no contiene se\u00F1ales.

XJ207.S=No se puede utilizar el m\u00E9todo executeQuery para la actualizaci\u00F3n.

XJ208.S=Fallo del lote no at\u00F3mico. El lote se ha enviado pero al menos se ha producido una excepci\u00F3n en un miembro individual del lote. Utilice getNextException() para recuperar las excepciones para los elementos por lotes espec\u00EDficos.

XJ209.S=El proceso almacenado necesario no est\u00E1 instalado en el servidor.

XJ210.S=No se ha encontrado el nombre del m\u00F3dulo de carga para el procedimiento almacenado en el servidor.

XJ211.S=Se ha producido una excepci\u00F3n de ruptura de cadena no recuperable durante el proceso por lotes. El lotes termina de manera no at\u00F3mica.

# Arguments:
#
#    {0} = attributeSyntax
#
XJ212.S=Sintaxis de atributo no v\u00E1lida: {0}

XJ213.C=La propiedad de conexi\u00F3n traceLevel no tiene un formato v\u00E1lido para un n\u00FAmero.

XJ214.S=Se ha producido un error de E/S al llamar a free() en un CLOB o BLOB.

XJ215.S=No puede llamar a otro m\u00E9todo java.sql.Clob o java.sql.Blob despu\u00E9s de haber llamado al m\u00E9todo free() ni despu\u00E9s de haber confirmado o realizado un rollback en la transacci\u00F3n de Blob/Clob.

XJ216.S=La longitud de este BLOB/CLOB a\u00FAn no est\u00E1 disponible. Cuando se accede a BLOB o CLOB como un flujo, la longitud no est\u00E1 disponible hasta que se ha procesado el flujo completo.

XJ217.S=El localizador proporcionado para este CLOB/LOB no es v\u00E1lido.

# Arguments:
#
#    {0} = reason
#
XK000.S=No se ha podido volver a cargar la pol\u00EDtica de seguridad: {0}

XK001.S=No se ha encontrado el nombre de usuario en SYS.SYSUSERS.

XN001.S=No se permite un restablecimiento de la conexi\u00F3n dentro de una unidad de trabajo.

XN008.S=El proceso de consulta se ha terminado debido a un error en el servidor.

XN009.S=Error al obtener la longitud del objeto BLOB/CLOB, a continuaci\u00F3n se obtiene una excepci\u00F3n.

XN010.S=El nombre del procedimiento no puede ser nulo.

# Arguments:
#
#    {0} = number
#    {1} = number
#
XN011.S=La longitud del nombre de procedimiento {0} no est\u00E1 dentro del rango v\u00E1lido entre 1 y {1}.

# Arguments:
#
#    {0} = operatingSystemName
#    {1} = versionNumber
#    {2} = versionNumber
#
XN012.S=En plataformas {0}, XA soporta la versi\u00F3n {1} y superiores, \u00E9sta es la versi\u00F3n {2}

XN013.S=Orientaci\u00F3n de desplazamiento no v\u00E1lida.

# Arguments:
#
#    {0} = number
#    {1} = messageText
#
XN014.S=Se ha encontrado una excepci\u00F3n al leer en el flujo especificado por el par\u00E1metro #{0}. Los datos restantes esperados por el servidor se han rellenado con 0x0. La excepci\u00F3n ten\u00EDa el mensaje siguiente: {1}.

# Arguments:
#
#    {0} = number
#
XN015.S=Error de protocolo de red: el tama\u00F1o especificado de InputStream, par\u00E1metro #{0}, es inferior a la longitud real de InputStream.

# Arguments:
#
#    {0} = number
#    {1} = messageText
#
XN016.S=Se ha encontrado una excepci\u00F3n al intentar verificar la longitud del flujo especificado por el par\u00E1metro #{0}. La excepci\u00F3n ten\u00EDa el siguiente mensaje: {1}.

# Arguments:
#
#    {0} = number
#
XN017.S=Se ha alcanzado el final del flujo antes de tiempo al leer el flujo especificado por el par\u00E1metro #{0}. Los datos restantes esperados por el servidor se han rellenado con 0x0.

# Arguments:
#
#    {0} = number
#
XN018.S=Error de protocolo de red: el tama\u00F1o especificado del lector par\u00E1metro #{0}, es inferior a la longitud real de InputStream.

# Arguments:
#
#    {0} = xaFunctionName
#    {1} = xaError
#
XN019.S=Error al ejecutar {0}, el servidor ha devuelto {1}.

# Arguments:
#
#    {0} = messageDetail
#
XN020.S=Error al canalizar o anular la canalizaci\u00F3n de un tipo definido por el usuario: {0}

# Arguments:
#
#    {0} = sourceClassName
#    {1} = targetClassName
#
XN021.S=Un objeto de tipo {0} no se puede convertir en un objeto de tipo {1}.

XN022.C=Una cadena de escritura que ha transmitido datos al servidor no se puede restablecer hasta que finalice la solicitud y termine la cadena.

# Arguments:
#
#    {0} = number
#
XN023.C=El flujo especificado por el par\u00E1metro #{0} est\u00E1 basado en un localizador y requiere una solicitud anidada en la misma conexi\u00F3n para materializarse. Esto no est\u00E1 soportado.

# Arguments:
#
#    {0} = number
#    {1} = messageText
#
XN024.C=Se ha encontrado una excepci\u00F3n que ha terminado la conexi\u00F3n al leer del flujo especificado por el par\u00E1metro #{0}. La excepci\u00F3n ten\u00EDa el siguiente mensaje: ''{1}''.

XRE00=Este m\u00F3dulo LogFactory no soporta la replicaci\u00F3n.

XRE01=El log recibido del principal est\u00E1 corrupto.

XRE02=El maestro y el esclavo tienen versiones diferentes. No se ha podido continuar con la replicaci\u00F3n.

XRE03=Error inesperado de replicaci\u00F3n. Consulte derby.log para ver los detalles.

# Arguments:
#
#    {0} = dbname
#    {1} = hostname
#    {2} = portname
#
XRE04.C.1=No se ha podido establecer conexi\u00F3n con el igual de la base de datos replicada ''{0}'' en la direcci\u00F3n ''{1}:{2}''.

# Arguments:
#
#    {0} = dbname
#
XRE04.C.2=Se ha perdido la conexi\u00F3n a la base de datos replicada ''{0}''.

# Arguments:
#
#    {0} = dbname
#    {1} = masterfile
#    {2} = masteroffset
#    {3} = slavefile
#    {4} = slaveoffset
#
XRE05.C=Los archivos log en el maestro y esclavo no est\u00E1n sincronizados para la base de datos replicada ''{0}''. El instant\u00E1neo de log maestro es {1}:{2}, mientras que el instant\u00E1neo de log esclavo es {3}:{4}. Esto es muy grave para la replicaci\u00F3n y por tanto, se parar\u00E1.

# Arguments:
#
#    {0} = dbname
#
XRE06=Los intentos de conexi\u00F3n con el esclavo de replicaci\u00F3n de la base de datos {0} han excedido el timeout especificado.

XRE07=La operaci\u00F3n no ha se podido realizar porque la base de datos no est\u00E1 en modo maestro de replicaci\u00F3n.

# Arguments:
#
#    {0} = dbname
#
XRE08=El modo esclavo de replicaci\u00F3n se ha iniciado correctamente para la base de datos ''{0}''. Se ha rechazado la conexi\u00F3n porque la base de datos est\u00E1 en modo esclavo de replicaci\u00F3n. 

# Arguments:
#
#    {0} = dbname
#
XRE09.C=No se puede iniciar el modo esclavo de replicaci\u00F3n para la base de datos ''{0}''. La base de datos ya se ha iniciado.

# Arguments:
#
#    {0} = attribute
#
XRE10=Se han especificado atributos que entran en conflicto. Consulte el manual de referencia para obtener informaci\u00F3n sobre los atributos permitidos en combinaci\u00F3n con el atributo de replicaci\u00F3n ''{0}''.

# Arguments:
#
#    {0} = command
#    {1} = dbname
#
XRE11.C=No se ha podido realizar la operaci\u00F3n ''{0}'' porque la base de datos ''{1}'' no se ha iniciado.

# Arguments:
#
#    {0} = dbname
#    {1} = expectedtype
#    {2} = receivedtype
#
XRE12=Error de protocolo de red de replicaci\u00F3n para la base de datos ''{0}''. Se esperaba el tipo de mensaje ''{1}'', pero se ha recibido ''{2}''.

# Arguments:
#
#    {0} = dbname
#
XRE20.D=Se ha realizado un failover correctamente para la base de datos ''{0}'', la base de datos se ha cerrado.

# Arguments:
#
#    {0} = dbname
#
XRE21.C=Se ha producido un error al realizar el failover para la base de datos ''{0}''. Se ha abortado el intento de failover.

# Arguments:
#
#    {0} = dbname
#
XRE22.C=Ya se ha iniciado el maestro de replicaci\u00F3n para la base de datos ''{0}''

XRE23=No se ha podido iniciar el maestro de replicaci\u00F3n porque hay en curso operaciones sin registrar. Realice una descongelaci\u00F3n para permitir que las operaciones no registradas se completen y reinicie la replicaci\u00F3n.

XRE40=La operaci\u00F3n no se ha podido realizar porque la base de datos no est\u00E1 en modo esclavo de replicaci\u00F3n.

XRE41.C=Se ha rechazado la operaci\u00F3n de replicaci\u00F3n ''failover'' o ''stopSlave'' en la base de datos esclava porque la conexi\u00F3n con el maestro est\u00E1 en activa. En su lugar, emita la operaci\u00F3n de ''failover'' o ''stopMaster'' en la base de datos maestra.

# Arguments:
#
#    {0} = dbname
#
XRE42.C=La base de datos replicada ''{0}'' se ha cerrado.

XRE43=Error inesperado al intentar parar el modo esclavo de replicaci\u00F3n. Para parar el modo esclavo de replicaci\u00F3n, utilice la operaci\u00F3n ''stopSlave'' o ''failover''.

# Arguments:
#
#    {0} = conglomerateNumber
#
XSAI2.S=El conglomerado ({0}) solicitado no existe.

XSAI3.S=Funci\u00F3n no implantada.

# Arguments:
#
#    {0} = interfaceName
#
XSAM0.S=Se he encontrado una excepci\u00F3n al intentar iniciar el m\u00F3dulo para ''{0}''.

# Arguments:
#
#    {0} = conglomID
#
XSAM2.S=No existe ning\u00FAn \u00EDndice o conglomerado con el ID de conglomerado ''{0}'' que borrar.

# Arguments:
#
#    {0} = conglomID
#
XSAM3.S=No existe un \u00EDndice o conglomerado con ID de conglomerado ''{0}''.

# Arguments:
#
#    {0} = sortName
#
XSAM4.S=No existe una clasificaci\u00F3n denominada ''{0}''.

XSAM5.S=La exploraci\u00F3n se debe abrir y colocar llamando a next() antes de realizar otras llamadas.

# Arguments:
#
#    {0} = containerName
#    {1} = pageNumber
#    {2} = recordNumber
#
XSAM6.S=No se ha encontrado el registro {2} de la p\u00E1gina {1} en el contenedor {0}.

XSAS0.S=Se ha llamado a un m\u00E9todo de interfaz de controlador de exploraci\u00F3n que no es apropiado para una exploraci\u00F3n en un orden.

XSAS1.S=Se ha intentado recuperar una fila antes de iniciar el orden o despu\u00E9s de terminarlo.

XSAS3.S=El tipo de fila insertada en la clasificaci\u00F3n no coincide con la plantilla de orden.

XSAS6.S=No se han podido adquirir los recursos para el orden.

XSAX0.S=Violaci\u00F3n de protocolo XA.

XSAX1.S=Se ha intentado iniciar una transacci\u00F3n global con un Xid de una transacci\u00F3n global existente.

XSCB0.S=No se ha podido crear el contenedor.

# Arguments:
#
#    {0} = containerName
#
XSCB1.S=No se ha encontrado el contenedor {0}.

# Arguments:
#
#    {0} = propertyName
#
XSCB2.S=No se ha encontrado la propiedad necesaria {0} en la lista de propiedades dada para createConglomerate() de un \u00EDndice secundario de \u00E1rbol B.

XSCB3.S=Funci\u00F3n no implantada.

# Arguments:
#
#    {0} = number
#
XSCB4.S=Se ha llamado a un m\u00E9todo de una exploraci\u00F3n abierta de \u00E1rbol B antes de colocar la exploraci\u00F3n en la primera fila (es decir, no se ha realizado a\u00FAn una llamada next()). El estado actual de la exploraci\u00F3n es ({0}).

XSCB5.S=No se ha encontrado la fila en el \u00E1rbol durante una operaci\u00F3n deshacer l\u00F3gica de una inserci\u00F3n o supresi\u00F3n de \u00E1rbol B.

XSCB6.S=Limitaci\u00F3n: no se puede actualizar o insertar el registro de un \u00EDndice secundario de \u00E1rbol B debido a la falta de espacio en la p\u00E1gina. Utilice los par\u00E1metros derby.storage.pageSize y/o derby.storage.pageReservedSpace para solucionar esta limitaci\u00F3n.

# Arguments:
#
#    {0} = trueOrFalse
#    {1} = trueOrFalse
#
XSCB7.S=Se ha producido un error interno durante una exploraci\u00F3n de \u00E1rbol B - current_rh es nulo = {0}, clave de posici\u00F3n nula = {1}.

# Arguments:
#
#    {0} = conglomerateNumber
#
XSCB8.S=El conglomerado de \u00E1rbol B {0} est\u00E1 cerrado.

XSCB9.S=Reservado para pruebas.

XSCG0.S=No se ha podido crear una plantilla.

XSCH0.S=No se ha podido crear el contenedor.

# Arguments:
#
#    {0} = containerName
#
XSCH1.S=No se ha encontrado el contenedor {0}.

XSCH4.S=No se ha podido crear el conglomerado.

# Arguments:
#
#    {0} = number
#    {1} = number
#
XSCH5.S=Existe datos no coincidentes en la tabla base entre el n\u00FAmero de columna solicitado {0} y el n\u00FAmero m\u00E1ximo de columnas {1}.

# Arguments:
#
#    {0} = containerID
#
XSCH6.S=El contenedor de pila con ID de contenedor {0} est\u00E1 cerrado.

XSCH7.S=La exploraci\u00F3n no est\u00E1 posicionada.

XSCH8.S=La funci\u00F3n no est\u00E1 implantada.

XSDA1.S=Se ha intentado acceder a una ranura fuera de rango de una p\u00E1gina

XSDA2.S=Se ha intentado actualizar un registro suprimido

XSDA3.S=Limitaci\u00F3n: no se puede actualizar o insertar el registro debido a la falta de espacio en la p\u00E1gina. Utilice los par\u00E1metros derby.storage.pageSize y/o derby.storage.pageReservedSpace para solucionar esta limitaci\u00F3n.

XSDA4.S=Se ha devuelto una excepci\u00F3n inesperada

XSDA5.S=Se ha intentado anular la supresi\u00F3n de un registro que no ha sido suprimido

# Arguments:
#
#    {0} = columnName
#
XSDA6.S=La columna {0} de la fila es nula, se debe asignar un valor para que apunte a un objeto.

# Arguments:
#
#    {0} = className
#
XSDA7.S=La restauraci\u00F3n de un objeto serializable o un objeto SQLData de clase {0} ha intentado leer m\u00E1s datos que los almacenados originalmente

# Arguments:
#
#    {0} = className
#
XSDA8.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto serializable o un objeto SQLData de clase {0}

# Arguments:
#
#    {0} = className
#
XSDA9.S=No se ha encontrado la clase durante la restauraci\u00F3n de un objeto SQLData o un objeto serializable de clase {0}

# Arguments:
#
#    {0} = timestamp
#
XSDAA.S=Registro de hora {0} no permitido, bien procede de una p\u00E1gina diferente o de una implantaci\u00F3n incompatible

XSDAB.S=No se puede definir un registro de hora nulo.

XSDAC.S=Se ha intentado mover p\u00E1ginas o filas de un contenedor a otro.

XSDAD.S=Se intentan mover cero filas de una p\u00E1gina a otra.

XSDAE.S=S\u00F3lo se puede crear un manejador de registro para un ID de manejador de registro especial.

XSDAF.S=Se ha utilizado un manejador de registro especial como si fuese uno normal.

XSDAG.S=La transacci\u00F3n superior anidada de asignaci\u00F3n no puede abrir el contenedor.

# Arguments:
#
#    {0} = page
#
XSDAI.S=La p\u00E1gina {0} que se est\u00E1 eliminando ya ha sido bloqueada para anular su asignaci\u00F3n.

XSDAJ.S=Excepci\u00F3n durante la escritura de un objeto serializable o un objeto SQLData

# Arguments:
#
#    {0} = recordHandle
#
XSDAK.S=Se ha obtenido una p\u00E1gina incorrecta para el manejador de registro {0}.

# Arguments:
#
#    {0} = recordHandle
#
XSDAL.S=El manejador de registro {0} apunta inesperadamente a una p\u00E1gina de desbordamiento.

# Arguments:
#
#    {0} = className
#
XSDAM.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto SQLData de clase {0}. No se puede instanciar la clase especificada.

# Arguments:
#
#    {0} = className
#
XSDAN.S=Excepci\u00F3n durante la restauraci\u00F3n de un objeto SQLData de clase {0}. La clase especificada ha encontrado una excepci\u00F3n de acceso no v\u00E1lida.

# Arguments:
#
#    {0} = pageNumber
#
XSDAO.S=Error interno: la p\u00E1gina {0} a la que se intenta acceder tiene un doble bloqueo interno.

# Arguments:
#
#    {0} = pageId
#    {1} = pageDump
#    {2} = slot
#    {3} = recordId
#    {4} = columnList
#    {5} = nextColumn
#    {6} = updateMode
#    {7} = nextPortionHandle
#
XSDAP.S=Se ha producido un error inesperado de falta de espacio al intentar actualizar una fila en la p\u00E1gina {0}. Los valores de los campos internos eran los siguientes en el momento del error: slot = {2}, recordId = {3}, newColumnList = {4}, nextColumn = {5}, mode = {6}, nextPortionHandle = {7}, page dump = {1}.

# Arguments:
#
#    {0} = page
#
XSDB0.D=Excepci\u00F3n inesperada en la p\u00E1gina en memoria {0}

# Arguments:
#
#    {0} = page
#
XSDB1.D=Formato de p\u00E1gina desconocido en la p\u00E1gina {0}

# Arguments:
#
#    {0} = containerName
#    {1} = number
#
XSDB2.D=Formato de contenedor desconocido en el contenedor {0} : {1}

# Arguments:
#
#    {0} = number
#    {1} = number
#
XSDB3.D=La informaci\u00F3n del contenedor no se puede cambiar una vez escrita: era {0}, ahora {1}

# Arguments:
#
#    {0} = page
#    {1} = versionNumber
#    {2} = versionNumber
#
XSDB4.D=La p\u00E1gina {0} es de la versi\u00F3n {1}, el archivo log contiene un cambio en la versi\u00F3n {2} o faltan registros de log de esta p\u00E1gina o esta p\u00E1gina no se ha escrito correctamente en el disco.

# Arguments:
#
#    {0} = page
#
XSDB5.D=El log tiene un registro de cambio en la p\u00E1gina {0} que va m\u00E1s all\u00E1 del fin del contenedor.

# Arguments:
#
#    {0} = databaseName
#
XSDB6.D=Puede que otra instancia de Derby haya iniciado ya la base de datos {0}.

# Arguments:
#
#    {0} = derbyInstanceID
#    {1} = databaseName
#    {2} = derbyInstanceID
#
XSDB7.D=Advertencia: Derby (instancia {0}) est\u00E1 intentando iniciar la base de datos {1} aunque puede que Derby (instancia {2}) est\u00E9 activa todav\u00EDa. S\u00F3lo una instancia de Derby debe arrancar una base de datos al mismo tiempo. Los datos podr\u00EDan da\u00F1arse de forma irreversible , aunque puede que ya se hayan da\u00F1ado.

# Arguments:
#
#    {0} = derbyInstanceID
#    {1} = databaseName
#    {2} = derbyInstanceID
#
XSDB8.D=Advertencia: Derby (instancia {0}) est\u00E1 intentando iniciar la base de datos {1} aunque es posible que Derby (instancia {2}) est\u00E9 activa todav\u00EDa. Es conveniente que una sola instancia de Derby inicie una base de datos a la vez. Los datos podr\u00EDan da\u00F1arse de forma irreversible si dos instancias de Derby inician la misma base de datos simult\u00E1neamente. Se ha definido la propiedad derby.database.forceDatabaseLock=true, por lo tanto la base de datos no se iniciar\u00E1 hasta que db.lck ya no est\u00E9 presente. En general, este archivo se elimina cuando se cierra la primera instancia de Derby que se inicia en la base de datos; sin embargo, algunas veces permanece despu\u00E9s de cerrarse. El tal caso, el archivo deber\u00E1 eliminarse manualmente. Antes de eliminar manualmente el archivo db.lck, es importante comprobar que no haya otras m\u00E1quinas virtuales que intentan acceder a la base de datos.

# Arguments:
#
#    {0} = containerName
#
XSDB9.D=El contenedor de flujo {0} est\u00E1 corrupto.

# Arguments:
#
#    {0} = object
#
XSDBA.D=Fallo al intentar asignar el objeto {0}.

# Arguments:
#
#    {0} = page
#    {1} = hexDump
#
XSDBB.D=Formato de p\u00E1gina desconocido en la p\u00E1gina {0}, se realizar\u00E1 un volcado de p\u00E1gina: {1} 

# Arguments:
#
#    {0} = container
#
XSDBC.D=Fallo al escribir la informaci\u00F3n de contenedor en la p\u00E1gina 0 del contenedor {0}. Para obtener m\u00E1s informaci\u00F3n, consulte el error anidado. 

# Arguments:
#
#    {0} = fileName
#
XSDF0.S=No se ha podido crear el archivo {0} porque ya existe.

# Arguments:
#
#    {0} = fileName
#
XSDF1.S=Excepci\u00F3n durante la creaci\u00F3n del archivo {0} del contenedor

# Arguments:
#
#    {0} = fileName
#    {1} = exceptionText
#
XSDF2.S=Excepci\u00F3n durante la creaci\u00F3n del archivo {0} del contenedor, no se ha podido eliminar el archivo. Excepci\u00F3n: {1}.

# Arguments:
#
#    {0} = segmentName
#
XSDF3.S=No se puede crear el segmento {0}.

# Arguments:
#
#    {0} = fileName
#    {1} = detailedException
#
XSDF4.S=Excepci\u00F3n durante la eliminaci\u00F3n del archivo {0} del contenedor borrado, no se ha podido eliminar el archivo {1}.

# Arguments:
#
#    {0} = page
#
XSDF6.S=No se ha encontrado la p\u00E1gina de asignaci\u00F3n {0}.

# Arguments:
#
#    {0} = pageKey
#
XSDF7.S=Fallo al realizar un bloqueo interno de la p\u00E1gina reci\u00E9n creada {0}

# Arguments:
#
#    {0} = page
#
XSDF8.S=No se ha encontrado la p\u00E1gina {0} que se va a volver a utilizar.

XSDFB.S=Operaci\u00F3n no soportada por una base de datos de s\u00F3lo lectura

# Arguments:
#
#    {0} = page
#    {1} = hexDump
#    {2} = hexDump
#
XSDFD.S=Se ha le\u00EDdo una imagen de p\u00E1gina diferente en 2 E/S de la p\u00E1gina {0}, la primera imagen tiene una suma de comprobaci\u00F3n incorrecta, la segunda imagen tiene una suma de comprobaci\u00F3n correcta. Im\u00E1genes de p\u00E1gina: {1} {2}

XSDFF.S=La operaci\u00F3n solicitada ha fallado debido a una excepci\u00F3n inesperada.

# Arguments:
#
#    {0} = fileName
#
XSDFH.S=No se puede realizar una copia de seguridad de la base de datos, se ha producido una excepci\u00F3n de E/S al escribir en el archivo contenedor de copia de seguridad {0}.

# Arguments:
#
#    {0} = page
#
XSDFI.S=Se ha producido un error al intentar escribir datos en el disco durante la recuperaci\u00F3n de la base de datos. Compruebe que el disco de la base de datos no est\u00E9 lleno. Si est\u00E1 lleno, suprima los archivos innecesarios y vuelva a intentar conectarse a la base de datos. Tambi\u00E9n es posible que el sistema de archivos sea de s\u00F3lo lectura, que el disco haya fallado o que se haya producido alg\u00FAn otro problema con los medios. El sistema ha encontrado un error mientras procesaba la p\u00E1gina {0}.

# Arguments:
#
#    {0} = fileName
#
XSDFJ.S=Se ha producido un error al intentar eliminar el archivo de la base de datos {0}, como parte del cifrado o descifrado de los archivos de la base de datos. La eliminaci\u00F3n del archivo podr\u00EDa haber fallado por un archivo, una propiedad de directorio o un permiso incorrectos. Tambi\u00E9n podr\u00EDa deberse a los procesos no controlados por Derby, como los comprobadores de virus o copias de seguridad.

# Arguments:
#
#    {0} = fileName
#
XSDFK.S=Se ha producido un error al intentar eliminar el archivo jar {0} almacenado en la base de datos. La eliminaci\u00F3n del archivo podr\u00EDa haber fallado por un archivo, una propiedad de directorio o un permiso incorrectos. Tambi\u00E9n podr\u00EDa deberse a los procesos no controlados por Derby, como los comprobadores de virus o copias de seguridad.

# Arguments:
#
#    {0} = page
#
XSDG0.D=No se ha podido leer la p\u00E1gina {0} del disco.

# Arguments:
#
#    {0} = page
#
XSDG1.D=No se ha podido escribir la p\u00E1gina {0} en el disco, compruebe si el disco est\u00E1 lleno o si se ha alcanzado un l\u00EDmite en el sistema de archivos, como por ejemplo una cuota o un tama\u00F1o m\u00E1ximo de archivo.

# Arguments:
#
#    {0} = page
#    {1} = number
#    {2} = number
#    {3} = hexDump
#
XSDG2.D=Suma de comprobaci\u00F3n no v\u00E1lida en la p\u00E1gina {0}, se esperaba {1}, versi\u00F3n en disco {2}, vaciado de p\u00E1gina: {3}

# Arguments:
#
#    {0} = containerName
#    {1} = type
#    {2} = file
#
XSDG3.D=No se ha podido acceder a los metadatos de {0} en {1} {2}

# Arguments:
#
#    {0} = pageArrayLength
#    {1} = containerArrayLength
#    {2} = maxBorrowedSpace
#    {3} = borrowedSpaceOffset
#    {4} = borrowedSpaceLength
#    {5} = arraycopySourcePosition
#    {6} = maxBorrowableSpace
#    {7} = hexdump
#
XSDG4.D=Se ha producido un error interno irrecuperable al intentar leer los metadatos de bajo nivel sobre la tabla o el \u00EDndice. Proporcione a su organizaci\u00F3n de soporte la siguiente informaci\u00F3n de excepci\u00F3n. Fallo: copia de matriz de byte de p\u00E1gina embrionaria [{0}] al byte de informaci\u00F3n de contenedor [{1}]. Valores de variables y constantes: MAX_BORROWED_SPACE: {2}, BORROWED_SPACE_OFFSET({3}) + BORROWED_SPACE_LENG({4}) = {5}; arraycopylength: {6}; p\u00E1gina embrionaria {7}.

XSDG5.D=La base de datos no est\u00E1 en modo de creaci\u00F3n al llamar a createFinished.

# Arguments:
#
#    {0} = directoryPath
#
XSDG6.D=No se ha encontrado el directorio de segmentos de datos en {0} durante la restauraci\u00F3n de la copia de seguridad. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrupta.

# Arguments:
#
#    {0} = directoryName
#
XSDG7.D=No se ha podido eliminar el directorio {0} durante la restauraci\u00F3n. Aseg\u00FArese de que los permisos son los correctos.

# Arguments:
#
#    {0} = directoryName
#    {1} = directoryName
#
XSDG8.D=No se ha podido copiar el directorio ''{0}'' en ''{1}'' durante la restauraci\u00F3n. Aseg\u00FArese de que haya suficiente espacio y que los permisos son los correctos. 

XSDG9.D=El thread de Derby se he interrumpido durante una operaci\u00F3n de E/S de disco. Compruebe la aplicaci\u00F3n para buscar el origen de la interrupci\u00F3n.

# Arguments:
#
#    {0} = filePath
#
XSLA0.D=No se puede vaciar el archivo log en el disco {0}.

# Arguments:
#
#    {0} = object
#
XSLA1.D=Se ha enviado el registro de log al flujo, pero no se puede aplicar al almac\u00E9n (Objeto {0}). Esto tambi\u00E9n puede causar problemas de recuperaci\u00F3n.

XSLA2.D=El sistema se cerrar\u00E1, se ha obtenido una excepci\u00F3n de E/S al acceder al archivo log.

XSLA3.D=Log corrupto. Incluye datos no v\u00E1lidos en el flujo de log.

XSLA4.D=Se ha producido un error al intentar escribir el log de recuperaci\u00F3n de transacci\u00F3n. Probablemente se deba a que el disco con el log de recuperaci\u00F3n est\u00E1 lleno. Si el disco est\u00E1 lleno, la \u00FAnica forma de continuar es liberar espacio en el disco ampli\u00E1ndolo o suprimiendo archivos no relacionados con Derby. Tambi\u00E9n es posible que el sistema de archivos o el disco donde reside el log de transacci\u00F3n de Derby sea de solo lectura. Tambi\u00E9n se puede producir un error si el disco o sistema de archivos ha fallado.

# Arguments:
#
#    {0} = transactionID
#
XSLA5.D=No se puede leer el flujo por alg\u00FAn motivo para realizar un rollback en la transacci\u00F3n {0}.

XSLA6.D=No se puede recuperar la base de datos.

# Arguments:
#
#    {0} = operation
#
XSLA7.D=No se puede rehacer la operaci\u00F3n {0} en el log.

# Arguments:
#
#    {0} = transactionID
#    {1} = undoableOperation
#    {2} = compensationOperation
#
XSLA8.D=No se puede realizar un rollback en la transacci\u00F3n {0}, se est\u00E1 intentando compensar la operaci\u00F3n {1} con {2}

XSLAA.D=Una excepci\u00F3n anterior ha marcado el almac\u00E9n para cerrarlo.

# Arguments:
#
#    {0} = logfileName
#
XSLAB.D=No se ha encontrado el archivo log {0}, aseg\u00FArese de que la propiedad logDevice se ha definido con el separador de ruta de acceso correcto para la plataforma.

# Arguments:
#
#    {0} = directoryPath
#
XSLAC.D=La base de datos en {0} tiene un formato incompatible con la versi\u00F3n actual del software, puede haber sido creada o actualizada por una versi\u00F3n posterior.

# Arguments:
#
#    {0} = length
#    {1} = length
#    {2} = logInstant
#    {3} = logfileName
#
XSLAD.D=Registro de log en instante {2} del archivo de log {3} corrupto. Se esperaba una longitud de registro de log {0}, longitud real {1}.

# Arguments:
#
#    {0} = fileName
#
XSLAE.D=El archivo de control en {0} no se puede escribir ni actualizar.

XSLAF.D=Se ha creado una base de datos de s\u00F3lo lectura con buffers de datos sucios.

XSLAH.D=Se est\u00E1 actualizando una base de datos de s\u00F3lo lectura.

XSLAI.D=No se puede registrar el log de punto de control

XSLAJ.D=Se ha marcado el sistema de registro para que se cierre debido a un problema anterior y que no permitir\u00E1 m\u00E1s operaciones hasta que se cierre y reinicie el sistema.

# Arguments:
#
#    {0} = number
#
XSLAK.D=La base de datos ha superado el n\u00FAmero de log m\u00E1s grande {0}.

# Arguments:
#
#    {0} = logfileName
#    {1} = position
#    {2} = size
#    {3} = size
#
XSLAL.D=El tama\u00F1o del registro de log {2} excede el tama\u00F1o de archivo log m\u00E1ximo permitido {3}. Se ha encontrado un error en el archivo log {0}, posici\u00F3n {1}.

# Arguments:
#
#    {0} = exceptionDetails
#    {1} = directoryPath
#
XSLAM.D=No se puede verificar el formato de la base de datos en {1} debido a IOException: {0}

# Arguments:
#
#    {0} = directoryPath
#    {1} = versionNumber
#
XSLAN.D=La base de datos en {0} tiene un formato incompatible con la versi\u00F3n actual del software. La base de datos se ha creado o actualizado con la versi\u00F3n {1}.

# Arguments:
#
#    {0} = detailedMessage
#
XSLAO.D=Error de recuperaci\u00F3n, problema inesperado: {0}.

# Arguments:
#
#    {0} = directoryPath
#    {1} = versionNumber
#
XSLAP.D=La base de datos {0} est\u00E1 en la versi\u00F3n {1}. No se pueden actualizar las bases de datos Beta.

# Arguments:
#
#    {0} = directoryName
#
XSLAQ.D=No se puede crear una archivo log en el directorio {0}.

# Arguments:
#
#    {0} = logfileName
#    {1} = logFileName
#
XSLAR.D=No se ha podido copiar el archivo log ''{0}'' en ''{1}'' durante la restauraci\u00F3n. Aseg\u00FArese de que haya suficiente espacio y que los permisos son los correctos. 

# Arguments:
#
#    {0} = directoryName
#
XSLAS.D=No se ha encontrado el directorio log {0} al restaurar la copia de seguridad. Aseg\u00FArese de que la copia de seguridad es la correcta y que no est\u00E1 corrupta.

# Arguments:
#
#    {0} = directoryName
#
XSLAT.D=El directorio log ''{0}'' ya existe. El directorio puede pertenecer a otra base de datos. Compruebe que la ubicaci\u00F3n especificada para el atributo logDevice sea correcta.

# Arguments:
#
#    {0} = logOperation
#
XSLB1.S=La operaci\u00F3n de log {0} ha encontrado un error al escribirse en el flujo de log. Esto puede deberse a una operaci\u00F3n de log incorrecta o a un buffer de log interno lleno debido a una operaci\u00F3n de log demasiado grande.

# Arguments:
#
#    {0} = logOperation
#
XSLB2.S=La operaci\u00F3n de log {0} est\u00E1 registrando demasiados datos, ha llenado el buffer de log interno.

# Arguments:
#
#    {0} = logInstant
#    {1} = truncationPoint
#    {2} = logInstant
#    {3} = logInstant
#
XSLB5.S=Instante de truncationLWM {1} no v\u00E1lido para el punto de truncamiento {0}. El rango permitido es de {2} a {3}.

XSLB6.S=Se ha intentado registrar 0 o un registro de log de longitud -ve.

# Arguments:
#
#    {0} = logInstant
#    {1} = logInstant
#
XSLB8.S=Se ha intentado restablecer la exploraci\u00F3n en {0}, m\u00E1s all\u00E1 de su l\u00EDmite de {1}.

XSLB9.S=No se pueden emitir m\u00E1s cambios, la f\u00E1brica de logs se ha parado.

XSRS0.S=No se puede congelar la base de datos despu\u00E9s de haberla congelado.

# Arguments:
#
#    {0} = directoryPath
#
XSRS1.S=No se puede realizar copia de seguridad de la base de datos en {0}, ya que no es un directorio.

# Arguments:
#
#    {0} = fileName
#    {1} = fileName
#
XSRS4.S=Error al cambiar el nombre del archivo (durante la copia de seguridad) de {0} en {1}.

# Arguments:
#
#    {0} = path
#    {1} = path
#
XSRS5.S=Error al copiar el archivo (durante la copia de seguridad) de {0} en {1}.

# Arguments:
#
#    {0} = directoryName
#
XSRS6.S=No se puede crear el directorio de copia de seguridad {0}.

XSRS7.S=La copia de seguridad ha obtenido una excepci\u00F3n inesperada.

XSRS8.S=El dispositivo log s\u00F3lo se puede definir durante el tiempo de creaci\u00F3n de la base de datos, no se puede cambiar en el momento.

# Arguments:
#
#    {0} = recordName
#
XSRS9.S=El registro {0} ya no existe

XSRSA.S=No se puede realizar una copia de seguridad de la base de datos cuando existen operaciones sin confirmar. Confirme las transacciones con operaciones de bloqueo de copia de seguridad. 

XSRSB.S=La copia de seguridad no se puede realizar en una transacci\u00F3n con operaciones no registradas sin confirmar.

# Arguments:
#
#    {0} = directoryLocation
#
XSRSC.S=No se puede realizar la copia de seguridad de la base de datos en {0}, es un directorio de base de datos.

XSTA2.S=Ya estaba activa una transacci\u00F3n cuando se intent\u00F3 activar otra transacci\u00F3n.

XSTB0.M=Se ha devuelto una excepci\u00F3n al abortar una transacci\u00F3n.

XSTB2.M=No se pueden registrar cambios de transacci\u00F3n, es posible que est\u00E9 intentando escribir en una base de datos de s\u00F3lo lectura.

XSTB3.M=No se puede abortar la transacci\u00F3n porque el gestor de log es nulo, probablemente debido a un error anterior.

XSTB5.M=Se ha encontrado un problema inesperado al crear la base de datos con el registro desactivado.

XSTB6.M=No se puede sustituir una tabla de transacci\u00F3n por otra mientras una est\u00E9 en uso.

XXXXX.C.6=Cierre de sesi\u00F3n de base de datos normal.

02000=No se ha encontrado ninguna fila para FETCH, UPDATE o DELETE; o el resultado de una consulta es una tabla vac\u00EDa.

# Arguments:
#
#    {0} = operatorName
#    {1} = detailedError
#
10000=Se ha encontrado un error al evaluar una expresi\u00F3n de consulta XML para el operador {0}: {1}

42Z00.U=Llamada de m\u00E9todo Java o referencia de campo

42Z01.U=Sin tipo

# Arguments:
#
#    {0} = javaClassName
#
42Z10=La clase Java enlazada a un tipo definido por el usuario no puede ser una clase utilizada internamente por Derby: ''{0}''.

# Arguments:
#
#    {0} = dataType
#
42Z12.U=Error interno: intento no v\u00E1lido de acceder a {0} como un flujo

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z30.U=tiempo transcurrido en este ResultSet =

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z31.U=tiempo transcurrido en este ResultSet y posteriormente =

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z32.U=tiempo total de desglose: 

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z33.U=tiempo del constructor (milisegundos) =

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z34.U=tiempo de apertura (milisegundos) =

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z35.U=siguiente tiempo (milisegundos) =

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z36.U=tiempo de cierre (milisegundos) =

# Translators: This is part of query plan printout; the string is complete as is.
# This is a start or stop position for a scan.
#
42Z37.U=Ninguno

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z38.U=Informaci\u00F3n de posicionamiento no disponible porque este ResultSet nunca se ha abierto.

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = exceptionMessage
#
42Z39.U=Excepci\u00F3n inesperada {0} al obtener el posicionador.

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = searchOperator
#    {1} = number
#
42Z40.U={0} en las primeras {1} columnas.

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z41.U=Sem\u00E1ntica de valores nulos ordenados en las siguientes columnas: 

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z42.U=ID de columna

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z43.U=Operador

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z44.U=Valores nulos ordenados

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z45.U=Valor devuelto desconocido

# Translators: This is part of query plan printout; the string is complete as is.
#
42Z46.U=Denegar resultado de comparaci\u00F3n

# Arguments:
#
#    {0} = className
#
42Z47.U=La obtenci\u00F3n de un plan de consulta como cadena no est\u00E1 soportado actualmente para {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = term
#    {1} = columnNumber
#
42Z48.U=ID de columna[{0}][{1}]

42Z54.U=Esta excepci\u00F3n para la sentencia despu\u00E9s del an\u00E1lisis; no se necesitan m\u00E1s procesos.

42Z55.U=Ejecuci\u00F3n parada despu\u00E9s de analizar mediante el indicador de depuraci\u00F3n StopAfterParsing.

42Z56.U=Ejecuci\u00F3n parada despu\u00E9s de enlazar mediante el indicador de depuraci\u00F3n StopAfterBinding.

42Z57.U=Ejecuci\u00F3n parada despu\u00E9s de optimizar mediante el indicador de depuraci\u00F3n StopAfterOptimizing.

42Z58.U=Ejecuci\u00F3n parada despu\u00E9s de generar mediante el indicador de depuraci\u00F3n StopAfterGenerating.

# A transaction isolation level. See http://en.wikipedia.org/wiki/Isolation_%28database_systems%29
# Translators: This is part of query plan printout; the string is complete as is.
#
42Z80.U=serializable

# A transaction isolation level. See http://en.wikipedia.org/wiki/Isolation_%28database_systems%29
# Translators: This is part of query plan printout; the string is complete as is.
#
42Z81.U=lectura confirmada

# A lock mode.
# Translators: This is part of query plan printout; the string is complete as is.
# This is shorthand for "exclusive lock".
#
42Z82.U=exclusivo

# A lock mode.
# Translators: This is part of query plan printout; the string is complete as is.
#
42Z83.U=uso compartido instant\u00E1neo

# A lock mode.
# Translators: This is part of query plan printout; the string is complete as is.
#
42Z84.U=compartir

# A lock granularity.
# Translators: This is part of query plan printout; the string is complete as is.
#
42Z85.U=tabla

# A lock granularity.
# Translators: This is part of query plan printout; the string is complete as is.
#
42Z86.U=fila

# Lock mode and granularity.
# Translators: This is part of query plan printout; the string is complete as is.
#
42Z87.U=compartir tabla

# Lock mode and granularity.
# Translators: This is part of query plan printout; the string is complete as is.
#
42Z88.U=compartir fila

# Translators: This is part of query plan printout; the string is complete as is.
#
43X00.U=Conectado a

# Translators: This is part of query plan printout; the string is complete as is.
#
43X01.U=N\u00FAmero de subconsulta de inicio

# Translators: This is part of query plan printout; the string is complete as is.
#
43X02.U=Cualquier ResultSet

# Translators: This is part of query plan printout; the string is complete as is.
#
43X03.U=N\u00FAmero de aperturas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X04.U=Filas vistas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X05.U=Juego de resultados de origen

# Translators: This is part of query plan printout; the string is complete as is.
#
43X06.U=N\u00FAmero de subconsulta de fin

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = number
#
43X07.U=recuento de filas estimado por el optimizador: {0,number,###########0.00}

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = number
#
43X08.U=coste estimado por el optimizador: {0,number,###########0.00}

# Translators: This is part of query plan printout; the string is complete as is.
#
43X09.U=segundos

# Translators: This is part of query plan printout; the string is complete as is.
#
43X11.U=Nodo

# Arguments:
#
#    {0} = methodName
#    {1} = className
#
43X12.U={0} no se ha implantado actualmente para {1}

# Translators: This is part of query plan printout; the string is complete as is.
#
43X13.U=Suprimir ResultSet mediante

# Lock granularity.
# Translators: This is part of query plan printout; the string is complete as is.
#
43X14.U=bloqueo de tabla

# Lock granularity.
# Translators: This is part of query plan printout; the string is complete as is.
#
43X15.U=bloqueo de fila

# Translators: This is part of query plan printout; the string is complete as is.
# This is shorthand for "deferred update".
#
43X16.U=diferido

# Translators: This is part of query plan printout; the string is complete as is.
#
43X17.U=Filas suprimidas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X18.U=\u00CDndices actualizados

43X19.U=Suprimir

# Translators: This is part of query plan printout; the string is complete as is.
#
43X20.U=ResultSet de agregado escalar distinto

# Translators: This is part of query plan printout; the string is complete as is.
#
43X21.U=Entrada de filas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X22.U=Agregado escalar distinto

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#    {1} = constraintOrIndex
#    {2} = constraintOrIndexName
#
43X23.U=ResultSet de exploraci\u00F3n distinto para {0} mediante {1} {2}

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#
43X26.U=ResultSet de exploraci\u00F3n distinto para {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = isolationLevel
#    {1} = lockString
#
43X27.U=a nivel de aislamiento {0} mediante bloqueo {1}

# Translators: This is part of query plan printout; the string is complete as is.
#
43X28.U=informaci\u00F3n de exploraci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43X29.U=La columna distinta es el n\u00FAmero de columna

# Translators: This is part of query plan printout; the string is complete as is.
#
43X30.U=Las columnas distintas son los n\u00FAmeros de columna

# Translators: This is part of query plan printout; the string is complete as is.
#
43X31.U=Tama\u00F1o de tabla hash

# Translators: This is part of query plan printout; the string is complete as is.
#
43X32.U=Filas filtradas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X33.U=siguiente tiempo en milisegundos/fila

# Translators: This is part of query plan printout; the string is complete as is.
#
43X34.U=posici\u00F3n de inicio

# Translators: This is part of query plan printout; the string is complete as is.
#
43X35.U=posici\u00F3n de parada

# Translators: This is part of query plan printout; the string is complete as is.
#
43X36.U=cualificadores de exploraci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43X37.U=siguientes cualificadores

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#    {1} = indexName
#
43X38.U=en {0} mediante {1}

# Translators: This is part of query plan printout; the string is complete as is.
#
43X39.U=Exploraci\u00F3n distinta

# Translators: This is part of query plan printout; the string is complete as is.
#
43X40.U=Informaci\u00F3n de ordenaci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43X41.U=ResultSet de agregado agrupado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X42.U=Con agregado distinto

# Translators: This is part of query plan printout; the string is complete as is.
#
43X43.U=Clasificado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X44.U=Agregado agrupado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X45.U=Uni\u00F3n hash existente

# Translators: This is part of query plan printout; the string is complete as is.
#
43X46.U=ResultSet de uni\u00F3n hash existente

# Translators: This is part of query plan printout; the string is complete as is.
#
43X47.U=Uni\u00F3n hash

# Translators: This is part of query plan printout; the string is complete as is.
#
43X48.U=ResultSet de uni\u00F3n hash

# Translators: This is part of query plan printout; the string is complete as is.
#
43X49.U=Uni\u00F3n externa izquierda hash

# Translators: This is part of query plan printout; the string is complete as is.
#
43X50.U=ResultSet de uni\u00F3n externa izquierda hash

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#    {1} = constraintOrIndex
#    {2} = constraintOrIndexName
#
43X51.U=ResultSet de exploraci\u00F3n hash para {0} mediante {1} {2}

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#
43X52.U=ResultSet de exploraci\u00F3n hash para {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
43X53.U=La clave hash es el n\u00FAmero de columna

# Translators: This is part of query plan printout; the string is complete as is.
#
43X54.U=Las claves hash son los n\u00FAmero de columna

# Translators: This is part of query plan printout; the string is complete as is.
#
43X55.U=Exploraci\u00F3n hash

# Translators: This is part of query plan printout; the string is complete as is.
#
43X56.U=Subconsultas conectadas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X57.U=ResultSet de tabla hash

# Translators: This is part of query plan printout; the string is complete as is.
#
43X58.U=Tabla hash

# Translators: This is part of query plan printout; the string is complete as is.
# Shorthand for "all columns".
#
43X59.U=todo

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#
43X60.U=Fila de \u00EDndice para ResultSet de fila base para {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
43X61.U=Columnas accedidas desde la pila

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#
43X62.U=para {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
43X63.U=Fila de \u00EDndice para fila base

# Translators: This is part of query plan printout; the string is complete as is.
#
43X64.U=modo de inserci\u00F3n: inserci\u00F3n en bloque

# Translators: This is part of query plan printout; the string is complete as is.
#
43X65.U=modo de inserci\u00F3n: normal (no se ha podido realizar la inserci\u00F3n en bloque porque hay una tabla que no est\u00E1 vac\u00EDa)

# Translators: This is part of query plan printout; the string is complete as is.
#
43X66.U=modo de inserci\u00F3n: normal

# Translators: This is part of query plan printout; the string is complete as is.
#
43X67.U=Insertar ResultSet mediante

# Translators: This is part of query plan printout; the string is complete as is.
#
43X68.U=Filas insertadas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X69.U=Insertar

# Translators: This is part of query plan printout; the string is complete as is.
#
43X70.U=Unir

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#    {1} = indexName
#
43X71.U=ResultSet de exploraci\u00F3n en \u00EDndice de \u00FAltima clave para {0} mediante \u00EDndice {1}

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = isolationLevel
#    {1} = lockString
#
43X72.U=a nivel de aislamiento {0} mediante bloqueo {1} elegido por el optimizador

# Translators: This is part of query plan printout; the string is complete as is.
#
43X73.U=Exploraci\u00F3n de tabla

# Translators: This is part of query plan printout; the string is complete as is.
#
43X74.U=Exploraci\u00F3n de \u00EDndice

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#
43X75.U=sobre {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
43X76.U=ResultSet materializado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X77.U=tiempo de creaci\u00F3n de conglomerado temporal (milisegundos)

# Translators: This is part of query plan printout; the string is complete as is.
#
43X78.U=tiempo de recuperaci\u00F3n de conglomerado temporal (milisegundos)

# Translators: This is part of query plan printout; the string is complete as is.
#
43X79.U=Filas vistas desde la izquierda

# Translators: This is part of query plan printout; the string is complete as is.
#
43X80.U=Filas vistas desde la derecha

# Translators: This is part of query plan printout; the string is complete as is.
#
43X81.U=Filas devueltas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X82.U=Juego de resultados izquierdo

# Translators: This is part of query plan printout; the string is complete as is.
#
43X83.U=Juego de resultados derecho

# Translators: This is part of query plan printout; the string is complete as is.
#
43X84.U=Uni\u00F3n existente de bucle anidado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X85.U=ResultSet de uni\u00F3n existente de bucle anidado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X86.U=Uni\u00F3n de bucle anidado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X87.U=ResultSet de uni\u00F3n de bucle anidado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X88.U=Filas derechas devueltas vac\u00EDas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X89.U=Uni\u00F3n externa izquierda de bucle anidado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X90.U=ResultSet de uni\u00F3n externa izquierda de bucle anidado

# Translators: This is part of query plan printout; the string is complete as is.
#
43X91.U=Normalizar ResultSet

# Translators: This is part of query plan printout; the string is complete as is.
#
43X92.U=ResultSet una vez

# Translators: This is part of query plan printout; the string is complete as is.
#
43X93.U=ResultSet de proyecci\u00F3n-restricci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43X94.U=restricci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43X95.U=proyecci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43X96.U=tiempo de restricci\u00F3n (milisegundos)

# Translators: This is part of query plan printout; the string is complete as is.
#
43X97.U=tiempo de proyecci\u00F3n (milisegundos)

# Translators: This is part of query plan printout; the string is complete as is.
#
43X98.U=Restricci\u00F3n de proyecto

# Translators: This is part of query plan printout; the string is complete as is.
#
43X99.U=ResultSet de fila

# Translators: This is part of query plan printout; the string is complete as is.
#
43X9A.U=ResultSet de recuento de filas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X9B.U=Recuento de filas

# Translators: This is part of query plan printout; the string is complete as is.
#
43X9C.U=ResultSet de ventana: 

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y00.U=ResultSet de agregado escalar

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y01.U=Optimizaci\u00F3n de clave de \u00EDndice

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y02.U=Agregado escalar

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y03.U=ResultSet no sensible al desplazamiento

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y04.U=N\u00FAmero de lecturas de la tabla hash

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y05.U=N\u00FAmero de escrituras en la tabla hash

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y06.U=Ordenar ResultSet

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y07.U=Eliminar duplicados

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y08.U=Ordenar

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#    {1} = constraintOrIndex
#    {2} = constraintOrIndexName
#
43Y09.U=ResultSet de exploraci\u00F3n de \u00EDndice para {0} mediante {1} {2}

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#
43Y10.U=ResultSet de exploraci\u00F3n de tabla para {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y11.U=Bloqueo real utilizado: bloqueo de nivel de tabla.

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y12.U=Tama\u00F1o de recuperaci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y13.U=cualificadores

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y14.U=ResultSet de uni\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableOrRow
#
43Y16.U=ResultSet de actualizaci\u00F3n mediante bloqueo {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y17.U=Filas actualizadas

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = javaClassName
#
43Y19.U=ResultSet de VTI para {0}

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y20.U=VTI

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y21.U=Subconsultas materializadas

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y22.U=Nombre de sentencia

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y23.U=Texto de sentencia

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y24.U=Tiempo de an\u00E1lisis

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y25.U=Tiempo de enlace

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y26.U=Tiempo de optimizaci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y27.U=Tiempo de generaci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y28.U=Tiempo de compilaci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y29.U=Tiempo de ejecuci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y30.U=Registro de hora de inicio de compilaci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y31.U=Registro de hora de fin de compilaci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y32.U=Registro de hora de inicio de ejecuci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y33.U=Registro de hora de fin de ejecuci\u00F3n

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y44.U=Texto del plan de ejecuci\u00F3n de sentencia

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = number
#
43Y45.U=Tiempo de ejecuci\u00F3n 100%, {0} segundos

43Y46.U=Insertar ResultSet de VTI

43Y47.U=Suprimir ResultSet de VTI

43Y49.U=Insertar VTI

43Y50.U=Suprimir VTI

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y51.U=Suprimir ResultSet en cascada

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y52.U=Suprimir ResultSet en cascada mediante

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y53.U=Acciones de referencia en tablas dependientes

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y54.U=Iniciar acci\u00F3n de referencia en n\u00FAmero de tabla dependiente

# Translators: This is part of query plan printout; the string is complete as is.
#
43Y55.U=Finalizar acci\u00F3n de referencia en n\u00FAmero de tabla dependiente

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = tableName
#    {1} = userSuppliedOptimizerOverrides
#
43Y56.U=Las sustituciones de optimizador proporcionadas por el usuario en {0} son {1}

# Translators: This is part of query plan printout; the string is complete as is.
#
# Arguments:
#
#    {0} = userSuppliedOptimizerOverrides
#
43Y57.U=Las sustituciones de optimizador proporcionadas por el usuario para uni\u00F3n son {0}

44X00.U=Nombre de tipo SQL

# Arguments:
#
#    {0} = url
#
46001=Excepci\u00F3n al acceder al archivo jar mediante la URL ''{0}''.

46J01=La firma del m\u00E9todo Java tiene un formato no v\u00E1lido.

# Arguments:
#
#    {0} = number
#    {1} = number
#
46J02=La firma del m\u00E9todo Java contiene un n\u00FAmero incorrecto ({0}) de par\u00E1metros, se esperaba {1}.

# Arguments:
#
#    {0} = prefix
#
54002=Una constante de cadena que comienza por ''{0}'' es demasiado larga.

54004=La sentencia SELECT tiene demasiados elementos en la lista SELECT, GROUP BY u ORDER BY.

# Arguments:
#
#    {0} = operator
#    {1} = number
#
54006=La longitud resultante de la operaci\u00F3n {0} es mayor que {1}.

54008=La sentencia CREATE INDEX especifica demasiadas columnas (16 es el n\u00FAmero m\u00E1ximo).

# Arguments:
#
#    {0} = number
#    {1} = tableOrViewName
#    {2} = number
#
54011=Se han especificado demasiadas columnas ({0}) para la tabla o vista {1}. El l\u00EDmite es {2}.

54038=Se ha excedido la profundidad m\u00E1xima de los disparadores anidados.

BIN01=(No se muestra el valor de datos binarios)

# Arguments:
#
#    {0} = columnName
#
S0022=No se ha encontrado la columna ''{0}''.

# Arguments:
#
#    {0} = errorMessage
#    {1} = exceptionClassName
#
XJ001.U=Excepci\u00F3n de Java: ''{1}: {0}''.

# Arguments:
#
#    {0} = oldVersion
#    {1} = newVersion
#
XJ050.U=La base de datos necesita actualizarse desde la versi\u00F3n {0}, defina el atributo ''upgrade=true'' en el URL de conexi\u00F3n JDBC para permitir la actualizaci\u00F3n a la versi\u00F3n {1}.

XJ082.U=No se permiten los valores BLOB/CLOB como receptor o par\u00E1metros de m\u00E9todo.

# Arguments:
#
#    {0} = operation
#
XJ083.U=''{0}'' no permitido porque el ResultSet no es un ResultSet actualizable. 

# Arguments:
#
#    {0} = methodName
#
XJ084.U=La columna no corresponde a una columna de la tabla base. No se puede emitir ''{0}'' en esta columna.

# Arguments:
#
#    {0} = xmlPackageName
#
XML00=No se ha encontrado la API ''{0}'' o las clases de implantaci\u00F3n. No se permiten operaciones XML a menos que estas clases est\u00E9n en la classpath.

# Arguments:
#
#    {0} = errorMessage
#
XML01=Se ha encontrado un error no esperado al procesar XML: {0}

XN002.U=No se ha devuelto SECTKN.

XSAJ0.U=Tipo de exploraci\u00F3n

XSAJ1.U=N\u00FAmero de p\u00E1ginas visitadas

XSAJ2.U=N\u00FAmero de filas visitadas

XSAJ3.U=N\u00FAmero de filas suprimidas visitadas

XSAJ4.U=N\u00FAmero de filas cualificadas

XSAJ5.U=N\u00FAmero de columnas recuperadas

XSAJ6.U=Bit definido de columnas recuperadas

XSAJ7.U=Altura del \u00E1rbol

XSAJ8.U=Tipo de ordenaci\u00F3n

XSAJA.U=N\u00FAmero de filas de entrada

XSAJB.U=N\u00FAmero de filas de salida

XSAJC.U=N\u00FAmero de ejecuciones de fusi\u00F3n

XSAJD.U=Tama\u00F1o de ejecuciones de fusi\u00F3n

XSAJE.U=Todo

# This is a type of conglomerate.
#
XSAJF.U=\u00E1rbol B

# This is a type of conglomerate.
#
XSAJG.U=pila

XSAJH.U=ordenar

# This is a type of sort.
#
XSAJI.U=externa

# This is a type of sort.
#
XSAJJ.U=interna

A001=Error fatal: no existe ning\u00FAn servicio de autenticaci\u00F3n para el sistema

A002=Error fatal: no existe ning\u00FAn servicio de autenticaci\u00F3n para la base de datos

# Arguments:
#
#    {0} = propertyName
#
A011=Advertencia: no se ha mencionado ning\u00FAn nombre de servidor/host de LDAP en la propiedad {0}; se asume localhost:389

A020=Autenticaci\u00F3n no v\u00E1lida.

# Arguments:
#
#    {0} = className
#    {1} = fileName
#    {2} = errorMessage
#
C000=Se ha escrito la clase {0} en el archivo {1}. Proporcione soporte con el archivo y la informaci\u00F3n de excepci\u00F3n siguiente: {2}

# Arguments:
#
#    {0} = className
#    {1} = jarName
#
C001=La clase {0} tiene un tipo de certificado desconocido en el jar {1}, se esperaba un certificado X509.

# Arguments:
#
#    {0} = className
#    {1} = jarName
#    {2} = errorMessage
#
C002=Se ha devuelto una excepci\u00F3n de seguridad al acceder a la clase {0} del jar {1} : {2}

# Arguments:
#
#    {0} = jarName
#    {1} = errorMessage
#
C003=Excepci\u00F3n al cargar el jar de base de datos {0} - {1}

# Arguments:
#
#    {0} = className
#
C004=Cargador de clases anticuado para la clase {0}

# Arguments:
#
#    {0} = classpath
#
C005=Cargador de clases de base de datos iniciado - derby.database.classpath=''{0}''

# Arguments:
#
#    {0} = className
#    {1} = jarName
#
C006=Se ha cargado {0} desde el jar de base de datos {1}

# Arguments:
#
#    {0} = className
#    {1} = jarName
#    {2} = detailedError
#
C007=Excepci\u00F3n al cargar la clase {0} desde el jar {1} - {2}

# Arguments:
#
#    {0} = className
#    {1} = detailedError
#
C008=Excepci\u00F3n al cargar la clase {0}: {1}

# Arguments:
#
#    {0} = derbyVersion
#    {1} = id
#    {2} = directoryName
#    {3} = classloader
#    {4} = JarClassPath
#
D000=:\n Iniciando instancia {1} de Derby (versi\u00F3n {0}) \nen el directorio de base de datos {2} en modo de s\u00F3lo lectura con el cargador de clases {3}. \nCargado desde {4}.

# Arguments:
#
#    {0} = derbyVersion
#    {1} = id
#    {2} = directoryName
#    {3} = classloader
#    {4} = JarClassPath
#
D001=:\n Iniciando instancia {1} de Derby, versi\u00F3n {0}: \nen el directorio de base de datos {2} con el cargador de clases {3}\nCargado desde {4}

# Arguments:
#
#    {0} = id
#    {1} = dbDirectory
#    {2} = classloader
#
D002=:\nCerrando la instancia {0} en el directorio de base de datos {1} con cargador de clases {2}

# Arguments:
#
#    {0} = databaseName
#    {1} = filePath
#
D004=Copia de seguridad iniciada para la base de datos situada en {0} a {1}.

# Arguments:
#
#    {0} = filePath
#    {1} = filePath
#
D005=Se ha movido la copia de seguridad antigua de {0} a {1}

# Arguments:
#
#    {0} = filePath
#
D006=Se ha completado la copia de seguridad del segmento de datos a {0}. 

D007=Se ha editado service.properties de la base de datos para utilizar el dispositivo log por defecto

# Arguments:
#
#    {0} = errorMessage
#
D008=Error al editar service.properties de la base de datos, copia de seguridad abortada: {0}

# Arguments:
#
#    {0} = filePath
#    {1} = filePath
#
D009=Se ha copiado el directorio de log de {0} a {1}

D010=Copia de seguridad abortada debido a un error

# Arguments:
#
#    {0} = filePath
#
D011=Se ha eliminado la copia de seguridad antigua de {0}

# Arguments:
#
#    {0} = backupInstant
#
D012=Copia de seguridad completada, instancia de log en {0} \n

# Arguments:
#
#    {0} = durabilityProperty
#    {1} = noSync
#
D013=Advertencia: La base de datos se ha iniciado mediante {0}={1}. En este modo, es posible que la base de datos no se pueda recuperar, las transacciones confirmadas se podr\u00EDan perder, y la base de datos podr\u00EDa estar en un estado inconsistente. Utilice este modo s\u00F3lo cuando estas consecuencias sean aceptables. \n

D015=No se puede leer m\u00E1s porque otra transacci\u00F3n ha modificado el valor.

# Arguments:
#
#    {0} = pageId
#    {1} = overFlow
#    {2} = pageVersion
#    {3} = slotsInUse
#    {4} = deletedRowCount
#    {5} = pageStatus
#    {6} = nextId
#    {7} = firstFreeByte
#    {8} = freeSpace
#    {9} = totalSpace
#    {10} = spareSpace
#    {11} = minimumRecordSize
#    {12} = pageSize
#    {13} = hexPageDump
#
D016=\n---------------------------------------------------\nID de p\u00E1gina:            {0}\n Overflow:          {1}\n PageVersion:       {2}\n SlotsInUse:        {3}\n DeletedRowCount:   {4}\n PageStatus:        {5}\n NextId:            {6}\n firstFreeByte:     {7}\n freeSpace:         {8}\n totalSpace:        {9}\n spareSpace:        {10}%\n minimumRecordSize: {11}\n PageSize:          {12}\n---------------------------------------------------\n{13}\n---------------------------------------------------

I024=Base de datos no disponible

I025=Controlador JDBC no disponible

# Arguments:
#
#    {0} = errorMessage
#
I026=El registro de controlador JDBC con java.sql.DriverManager ha fallado: {0}

I027=No se ha definido ninguna marca o se ha excedido el l\u00EDmite de lectura de marcas.

I028=Error de lectura del flujo por parte del cliente al transferir de datos de usuario al servidor.

# Arguments:
#
#    {0} = expectedCount
#    {1} = gotCount
#
I029=Se ha alcanzado el final del archivo antes de tiempo; se esperaba {0}, se ha obtenido {1}.

# Arguments:
#
#    {0} = timestamp
#
J003={0}: cerrando motor de Derby

J004=Identidad de base de datos

J005=Cerrar Derby

J006=Anular registro de AutoloadedDriver

J007=Crear base de datos

J008=Sin detalles

J010=Cifrar base de datos en disco

J013=Actualizar base de datos

J016=Proveedor de servicio de cifrado

J017=Algoritmo de cifrado

J018=Longitud de clave de cifrado

J019=Clave de cifrado externa

J020=Clave de cifrado secreta

J021=Configuraci\u00F3n regional de la base de datos

J022=Nombre de usuario

J023=Contrase\u00F1a de usuario

J025=Ruta de acceso del directorio de log

J028=Ruta de acceso de copia de seguridad para la recuperaci\u00F3n en avance

J029=Ruta de acceso de copia de seguridad para crear base de datos a partir de copia de seguridad

J030=Ruta de acceso de copia de seguridad para restaurar base de datos a partir de copia de seguridad

J031=Ordenaci\u00F3n para tipos de dato de caracteres

# Arguments:
#
#    {0} = className
#
J100=No se ha encontrado la clase del servidor de red, {0}. La classpath debe contener derbynet.jar.

# Arguments:
#
#    {0} = className
#    {1} = errorMessage
#
J101=No se puede cargar la clase del servidor de red, {0}. {1} Compruebe la integridad del archivo derbynet.jar.

# Arguments:
#
#    {0} = errorMessage
#
J102=Se ha generado una excepci\u00F3n al iniciar el servidor de red. {0}

# Arguments:
#
#    {0} = errorMessage
#
J103=Se ha generado una excepci\u00F3n al cerrar el servidor de red. {0}

J104=El objeto ya est\u00E1 cerrado.

J105=La precisi\u00F3n excede de 31 d\u00EDgitos.

J107=Error para el elemento del lote #

# Arguments:
#
#    {0} = propertyName
#
J108=El gestor de seguridad no permite acceder a la propiedad del sistema {0}.

# Arguments:
#
#    {0} = errorMessage
#
J109=Se ha detectado una configuraci\u00F3n de cliente TCP/IP incorrecto. No se ha podido determinar la direcci\u00F3n IP del host local: ''{0}''. Aseg\u00FArese de que la m\u00E1quina cliente tiene configurada correctamente una direcci\u00F3n IP.

J110=Mecanismo de seguridad no soportado

J111=Falta la contrase\u00F1a

J112=Falta el ID de usuario

J113=ID de usuario o contrase\u00F1a no v\u00E1lidos

J114=ID de usuario revocado

J115=Contrase\u00F1a nueva no v\u00E1lida

J116=Error de servicio de seguridad local para una operaci\u00F3n que no se puede reintentar.

J117=Falta SECTKN en ACCSEC cuando es necesario o no es v\u00E1lido

J118=Contrase\u00F1a caducada

J120=Error de conexi\u00F3n no especificado

J121=El usuario no tiene autorizaci\u00F3n para acceder a la base de datos

J122=Se ha emitido un comando que solicita servicios de la base de datos antes del comando que solicita acceso a la base de datos (ACCRDB)

J123=El comando solicitado ha encontrado una condici\u00F3n no estructurada y espec\u00EDfica de la implantaci\u00F3n para la que no hab\u00EDa ning\u00FAn mensaje estructurado (puede encontrar m\u00E1s informaci\u00F3n en el archivo derby.log del servidor)

J124=El comando de acceso a base de datos relacional (ACCRDB) no se puede emitir porque ya se ha accedido actualmente a la base de datos

J125=Se ha detectado un error de no coincidencia de descriptor de datos.

# Arguments:
#
#    {0} = hexNumber
#
J126=Se ha detectado un error de protocolo de conversaci\u00F3n. Motivo: 0x{0}.

J128=El cursor no est\u00E1 abierto

J129=Se ha emitido un comando de apertura de consulta para una consulta que ya estaba abierta

J130=Se ha detectado un error de protocolo (error de descripci\u00F3n de FDOCA no v\u00E1lida).

# Arguments:
#
#    {0} = hexNumber
#
J131=Se ha detectado un error de protocolo (error de sintaxis de la flujo de datos). Motivo: 0x{0}. Es posible que se haya intentado abrir una conexi\u00F3n no cifrada con un servidor SSL activado.

J132=Nombre de usuario para la conexi\u00F3n

J133=Contrase\u00F1a de usuario para la conexi\u00F3n

# Arguments:
#
#    {0} = maxStatements
#
J134=No se permiten valores negativos para la propiedad maxStatements: {0}

# Arguments:
#
#    {0} = transactionXid
#
J135=Se ha producido un timeout en la transacci\u00F3n XA y se va a realizar un rollback. El Xid de transacci\u00F3n es {0}.

# Arguments:
#
#    {0} = transactionXid
#
J136=Exist\u00EDa una transacci\u00F3n XA asociada a la conexi\u00F3n que se cierra. Se va a realizar un rollback en la transacci\u00F3n. El Xid de transacci\u00F3n es {0}.

J137=No se ha podido anular el registro del controlador JDBC al cerrar el motor de Derby. Aseg\u00FArese de que SQLPermission ("deregisterDriver") se otorga a derby.jar.

L001=------------  Principio de mensaje de error -------------\n

L002=------------ Fin de mensaje de error -------------\n

L003=\n------------  Principio de pila de errores de cierre -------------\n

L004=\n------------ Fin de pila de errores de cierre -------------\n

L005=\n------------  Principio de pila de errores -------------\n

L006=\n------------  Fin de pila de errores -------------\n

L007=Advertencia: no se ha encontrado el archivo log, se est\u00E1 creando uno nuevo. Posible inconsistencia en la base de datos

# Arguments:
#
#    {0} = fileName
#
L008=Suprimiendo archivo log antiguo incompatible {0}

# Arguments:
#
#    {0} = fileName
#
L009=Suprimiendo archivo log antiguo {0}

# Arguments:
#
#    {0} = fileName
#    {1} = position
#    {2} = position
#
L010=Se ha detectado un registro de log incompleto en el archivo {0}, borrando el archivo log desde la posici\u00F3n {1} hasta el fin de archivo en {2}.

L011=El daemon de punto de control ha obtenido una excepci\u00F3n est\u00E1ndar

# Arguments:
#
#    {0} = transactionID
#
L012=El registro de log no es el primero pero la transacci\u00F3n no est\u00E1 en una tabla de transacci\u00F3n: {0}

# Arguments:
#
#    {0} = transactionID
#
L013=El registro de log es el primero pero la transacci\u00F3n ya est\u00E1 en la tabla de transacci\u00F3n: {0}

L014=Instante de inicio incorrecto

# Arguments:
#
#    {0} = fileName
#
L015=Existe un nuevo archivo log y no se puede suprimir {0}

# Arguments:
#
#    {0} = fileName
#
L016=No se puede crear un nuevo archivo log {0}

# Arguments:
#
#    {0} = fileName
#    {1} = errorMessage
#
L017=No se puede crear un nuevo archivo log {0} debido a {1}

# Arguments:
#
#    {0} = fileName
#
L018=El sistema puede estar en un estado inconsistente, falta el archivo {0}

# Arguments:
#
#    {0} = testModeProperty
#    {1} = testMode
#
L020=Advertencia: La base de datos se ha iniciado al menos una vez mediante {0}={1}. Como resultado de este modo utilizado, es posible que la base de datos no se pueda recuperar, las transacciones confirmadas se podr\u00EDan perder y la base de datos podr\u00EDa estar en un estado inconsistente. Esto podr\u00EDa causar errores inesperados.\n

# Arguments:
#
#    {0} = testModeProperty
#    {1} = testMode
#    {2} = testModeProperty
#    {3} = testMode
#
L021=Advertencia: La base de datos se ha arrancado previamente o actualmente mediante {0} definido en {1}. Tenga en cuenta que este modo {0}={1} no garantiza la recuperaci\u00F3n y es probablemente lo que podr\u00EDa haber causado este error de inicio.\n

L022=Advertencia: debido a un problema de permisos al obtener acceso a los archivos log, el estado de la base de datos se a cambiado a s\u00F3lo lectura. \n        

# Arguments:
#
#    {0} = timestamp
#
R001=----  Principio de mensaje de error de replicaci\u00F3n ({0}) ----

R002=--------------------  Fin de mensaje de error de replicaci\u00F3n ---------------------

# Arguments:
#
#    {0} = dbname
#
R003=Se ha iniciado el rol esclavo de replicaci\u00F3n para la base de datos ''{0}''.

# Arguments:
#
#    {0} = dbname
#
R004=Se ha detenido el rol de esclavo de replicaci\u00F3n para la base de datos ''{0}''.

# Arguments:
#
#    {0} = dbname
#
R005=El esclavo de replicaci\u00F3n ha obtenido un error fatal para la base de datos ''{0}''. La replicaci\u00F3n se parar\u00E1.

# Arguments:
#
#    {0} = dbname
#
R006=Se ha perdido la conexi\u00F3n con el maestro de replicaci\u00F3n de la base de datos ''{0}''.

# Arguments:
#
#    {0} = dbname
#
R007=Se ha iniciado el rol de maestro de replicaci\u00F3n para la base de datos ''{0}''.

# Arguments:
#
#    {0} = dbname
#
R008=Se ha parado el rol de maestro de replicaci\u00F3n para la base de datos ''{0}''.

R009=Se he producido una excepci\u00F3n durante el env\u00EDo de log.

# Arguments:
#
#    {0} = dbname
#
R010=El maestro de replicaci\u00F3n est\u00E1 intentando volver a conectarse con el esclavo de la base de datos ''{0}''.

# Arguments:
#
#    {0} = dbname
#    {1} = hostname
#    {2} = port
#
R011=La base de datos esclava de replicaci\u00F3n ''{0}'' recibe conexiones del maestro en ''{1}:{2}''.

R012=Manejador de conexi\u00F3n de replicaci\u00F3n no v\u00E1lido.

# Arguments:
#
#    {0} = timestamp
#    {1} = message
#
R013=Mensaje de replicaci\u00F3n ({0}): {1}

# Arguments:
#
#    {0} = dbname
#
R020=El failover se ha realizado correctamente para la base de datos ''{0}''.

# Translators: Please translate the ALL CAPS words.
#
M001=\n# ********************************************************************\n# ***        NO edite este archivo.         ***\n# *** SI CAMBIA SU CONTENIDO PODR\u00CDA CAUSAR DA\u00D1OS EN LOS DATOS. ***\n# ********************************************************************

M002=Se han restaurado las propiedades del servicio que estaban corruptas o que faltaban del archivo de copia de seguridad.

M003=Se ha suprimido el archivo de copia de seguridad de propiedades del servicio restante.

# Arguments:
#
#    {0} = servicePropertiesBackupFile
#
M004=Fallo al suprimir el archivo de copia de seguridad de propiedades del servicio restante, supr\u00EDmalo manualmente: {0}

# Translators: Please translate the ALL CAPS words.
#
M005=\n# *************************************************************************\n# ***              NO TOQUE LOS ARCHIVOS DE ESTE DIRECTORIO                ***\n# *** LOS ARCHIVOS DE ESTE DIRECTORIO Y SUBDIRECTORIOS CONSTITUYEN UNA BASE DE DATOS DE DERBY,     ***\n# *** QUE INCLUYE LOS DATOS (USUARIO Y SISTEMA) Y LOS       ***\n# *** ARCHIVOS NECESARIOS PARA UNA RECUPERACI\u00D3N DE LA BASE DE DATOS.                            ***\n# *** LA EDICI\u00D3N, ADICI\u00D3N O SUPRESI\u00D3N DE CUALQUIER ARCHIVO PUEDE PROVOCAR    ***\n# *** CORRUPCI\u00D3N DE DATOS Y UN ESTADO NO RECUPERABLE EN LA BASE DE DATOS.     ***\n# *************************************************************************

# Translators: Please translate the ALL CAPS words.
#
M006=\n# *************************************************************************\n# ***              DO NOT TOUCH FILES IN THIS DIRECTORY!                ***\n# *** FILES IN THIS DIRECTORY ARE USED BY THE DERBY DATABASE RECOVERY   ***\n# *** SYSTEM. EDITING, ADDING, OR DELETING FILES IN THIS DIRECTORY      ***\n# *** WILL CAUSE THE DERBY RECOVERY SYSTEM TO FAIL, LEADING TO          ***\n# *** NON-RECOVERABLE CORRUPT DATABASES.                                ***\n# *************************************************************************

# Translators: Please translate the ALL CAPS words.
#
M007=\n# *************************************************************************\n# ***              DO NOT TOUCH FILES IN THIS DIRECTORY!                ***\n# *** FILES IN THIS DIRECTORY ARE USED BY THE DERBY DATABASE TO STORE   *** \n# *** USER AND SYSTEM DATA. EDITING, ADDING, OR DELETING FILES IN THIS  ***\n# *** DIRECTORY WILL CORRUPT THE ASSOCIATED DERBY DATABASE AND MAKE     ***\n# *** IT NON-RECOVERABLE.                                               ***\n# *************************************************************************

# Arguments:
#
#    {0} = propertyName
#    {1} = error
#
M008=ADVERTENCIA: no se ha podido leer la propiedad {0} debido a una excepci\u00F3n de seguridad: {1}. Esto podr\u00EDa suponer un riesgo de seguridad.\n                

# Arguments:
#
#    {0} = fileName
#    {1} = error
#
M009=No se ha podido crear el archivo o directorio {0} debido a una excepci\u00F3n de seguridad: {1}.\n                

# Arguments:
#
#    {0} = error
#
M00A=ADVERTENCIA: no se puede obtener el cargador de clase de contexto debido a una excepci\u00F3n de seguridad: {0}. Esto puede provocar una p\u00E9rdida de cargador de clase.\n                

# Arguments:
#
#    {0} = error
#
M00B=ADVERTENCIA: no se puede definir el cargador de clase de contexto debido a una excepci\u00F3n de seguridad: {0}. Esto puede provocar una p\u00E9rdida de cargador de clase.\n                

# Arguments:
#
#    {0} = error
#
M010=ADVERTENCIA: no se ha podido hacer ThreadGroup#setDaemon en daemons de Derby debido a una excepci\u00F3n de seguridad: {0}. Esto puede tener un impacto en la operaci\u00F3n.\n                

N001=Este error lo ha causado el siguiente error.
